#
# Copyright (c) 2014, 2019, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000={0} \uBAA8\uC74C\uC740 \uC77D\uAE30 \uC804\uC6A9\uC774\uBA70 {1}\uC774(\uAC00) \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
2001={0} \uBAA8\uC74C\uC5D0 \uB9C8\uC9C0\uB9C9\uC73C\uB85C \uC218\uC815\uB41C \uC2DC\uAC04\uC744 \uB098\uD0C0\uB0B4\uB294 \uC2DC\uAC04 \uAE30\uB85D\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
2002=\uBD80\uC801\uD569\uD55C \uD544\uD130 \uC870\uAC74\uC785\uB2C8\uB2E4.
2003=\uAE30\uC220\uC790\uAC00 \uAE30\uC874 \uBAA8\uC74C\uACFC \uC77C\uCE58\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
2004={0} \uC778\uC218\uB294 \uB110\uC77C \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2005={0} \uC9D1\uD569\uC774 \uBE44\uC5B4 \uC788\uC2B5\uB2C8\uB2E4.
2006=''since'' \uBC0F ''until'' \uC778\uC218\uB294 \uBAA8\uB450 \uB110\uC77C \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2007={0} \uBAA8\uC74C\uC5D0 \uBC84\uC804\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
2008={0} \uC778\uC218\uB294 \uC591\uC218\uC5EC\uC57C \uD569\uB2C8\uB2E4.
2009=key(), keys() \uB610\uB294 filter() \uBA54\uC18C\uB4DC\uB97C \uC0AC\uC6A9\uD558\uC5EC \uC9C0\uC815\uB41C \uC804\uCCB4 \uD0A4\uB294 {0}\uAC1C \uC774\uBA70 \uCD5C\uB300 \uD55C\uACC4\uC778 {1}\uAC1C\uB97C \uCD08\uACFC\uD569\uB2C8\uB2E4.
2010={0} \uC774\uD130\uB808\uC774\uD130\uAC00 {1} \uBB38\uC11C\uB97C \uBC18\uD658\uD55C \uD6C4 \uB110\uC744 \uBC18\uD658\uD588\uC2B5\uB2C8\uB2E4.
2011=\uBD80\uC801\uD569\uD55C \uC778\uC218 \uAC12 "{0}"\uC785\uB2C8\uB2E4.
2012=LOB \uC720\uD615 \uB610\uB294 JSON \uC720\uD615\uC5D0 \uB300\uD574 \uCD5C\uB300 \uAE38\uC774\uB97C \uC124\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2013=\uCF58\uD150\uCE20 \uC5F4 \uC720\uD615\uC774 "{0}"\uC778 \uACBD\uC6B0 SecureFile LOB \uC124\uC815\uC744 \uC0AC\uC6A9\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2014=last-modified \uC5F4 \uC778\uB371\uC2A4\uB294 last-modified \uC5F4 \uC774\uB984\uC774 \uC124\uC815\uB41C \uACBD\uC6B0\uC5D0\uB9CC \uC124\uC815\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
2015=\uC9C0\uC815 \uBA54\uC18C\uB4DC\uAC00 "SEQUENCE"\uC778 \uACBD\uC6B0 \uD0A4 \uC5F4 \uC2DC\uD000\uC2A4 \uC774\uB984\uC744 \uC9C0\uC815\uD574\uC57C \uD569\uB2C8\uB2E4.
2016=\uBC84\uC804 \uBA54\uC18C\uB4DC\uAC00 \uC9C0\uC815\uB418\uC5C8\uC9C0\uB9CC \uBC84\uC804 \uC5F4 \uC774\uB984\uC740 \uC9C0\uC815\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4.
2017=\uC9C0\uC815\uB41C \uD0A4 \uC5F4 \uC720\uD615\uC740 \uCD5C\uB300 \uAE38\uC774\uC640 \uD568\uAED8 \uC0AC\uC6A9\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2018=GUID \uB610\uB294 UUID\uB97C \uC0AC\uC6A9\uD558\uC5EC \uBB38\uC790 \uC720\uD615 \uD0A4 \uAC12\uC744 \uC9C0\uC815\uD558\uB294 \uACBD\uC6B0 \uD0A4 \uC5F4 \uAE38\uC774\uB294 32\uBC14\uC774\uD2B8 \uC774\uC0C1\uC774\uC5B4\uC57C \uD569\uB2C8\uB2E4.
2019=\uCF58\uD150\uCE20 \uC5F4 \uC720\uD615\uC774 BLOB\uC774 \uC544\uB2CC \uACBD\uC6B0 \uBAA8\uC74C\uC5D0 \uB9E4\uCCB4 \uC720\uD615 \uC5F4\uC774 \uC788\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2020=\uBB38\uC11C\uC758 \uB9E4\uCCB4 \uC720\uD615\uC774 "application/json"\uC774 \uC544\uB2D9\uB2C8\uB2E4. getContentAsString()\uC740 JSON \uBB38\uC11C\uC5D0 \uB300\uD574\uC11C\uB9CC \uC9C0\uC6D0\uB429\uB2C8\uB2E4.
2021={0} \uC9D1\uD569\uC5D0 \uB110\uC774 \uD3EC\uD568\uB418\uC5B4 \uC788\uC2B5\uB2C8\uB2E4.
2022=\uBC14\uAFC0 \uBB38\uC11C\uC5D0 \uB300\uD55C \uD0A4\uB294 key() \uBA54\uC18C\uB4DC\uB97C \uC0AC\uC6A9\uD558\uC5EC \uC9C0\uC815\uD574\uC57C \uD569\uB2C8\uB2E4.
2023={0} \uC778\uC218\uB294 \uC74C\uC218\uAC00 \uC544\uB2C8\uC5B4\uC57C \uD569\uB2C8\uB2E4.
2024=\uBD80\uC801\uD569\uD55C \uC778\uB371\uC2A4 \uC0DD\uC131 \uC0AC\uC591\uC785\uB2C8\uB2E4.
2025=\uBD80\uC801\uD569\uD55C \uC778\uB371\uC2A4 \uC0AD\uC81C \uC0AC\uC591\uC785\uB2C8\uB2E4.
2026=\uBAA8\uC74C \uBA54\uD0C0\uB370\uC774\uD130 \uBB38\uC11C\uC5D0 \uCF58\uD150\uCE20\uAC00 \uC5C6\uAC70\uB098 \uBE48 \uCF58\uD150\uCE20\uAC00 \uC788\uC2B5\uB2C8\uB2E4.
2027=\uBAA8\uC74C \uBA54\uD0C0\uB370\uC774\uD130 \uBB38\uC11C\uB294 \uBD80\uC801\uD569\uD55C JSON\uC785\uB2C8\uB2E4.
2028=\uBAA8\uC74C \uBA54\uD0C0\uB370\uC774\uD130 \uBB38\uC11C\uB294 \uBD80\uC801\uD569\uD55C JSON\uC774\uBA70 \uC778\uCF54\uB529\uC744 \uD655\uC778\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2029=\uBAA8\uC74C \uBA54\uD0C0\uB370\uC774\uD130 \uBB38\uC11C\uB97C \uCC98\uB9AC\uD558\uB294 \uB3D9\uC548 IOException\uC774 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
2030=\uBAA8\uC74C \uBA54\uD0C0\uB370\uC774\uD130\uC5D0 "{0}"\uC5D0 \uB300\uD55C \uBD80\uC801\uD569\uD55C \uAC12\uC774 \uC788\uC2B5\uB2C8\uB2E4.
2031=\uBAA8\uC74C \uBA54\uD0C0\uB370\uC774\uD130\uB294 JSON \uAC1D\uCCB4\uC5EC\uC57C \uD569\uB2C8\uB2E4.
2032=\uAC1D\uCCB4 \uD0A4 "{0}"\uC774(\uAC00) \uBAA8\uC74C \uBA54\uD0C0\uB370\uC774\uD130\uC5D0 \uC788\uC5B4\uC57C \uD569\uB2C8\uB2E4.
2033=\uBAA8\uC74C\uC740 \uD074\uB77C\uC774\uC5B8\uD2B8\uAC00 \uC9C0\uC815\uD55C \uD0A4\uB85C \uAD6C\uC131\uB418\uC9C0 \uC54A\uC558\uC9C0\uB9CC \uC785\uB825 \uBB38\uC11C\uC5D0\uB294 \uD0A4\uAC00 \uC788\uC2B5\uB2C8\uB2E4.
2034=\uBB38\uC11C\uAC00 \uD074\uB77C\uC774\uC5B8\uD2B8\uAC00 \uC9C0\uC815\uD55C \uD0A4\uB85C \uAD6C\uC131\uB418\uC9C0 \uC54A\uC558\uC9C0\uB9CC {0} \uC774\uD130\uB808\uC774\uD130\uAC00 {1} \uBB38\uC11C\uB97C \uBC18\uD658\uD55C \uD6C4 \uD0A4\uAC00 \uC788\uB294 \uBB38\uC11C\uB97C \uBC18\uD658\uD588\uC2B5\uB2C8\uB2E4.
2035=\uC81C\uACF5\uB41C JDBC \uC811\uC18D\uC5D0\uC11C \uD638\uCD9C\uB41C getCurrentSchema()\uAC00 \uB110\uC744 \uBC18\uD658\uD588\uC2B5\uB2C8\uB2E4.
2036=\uBD80\uC801\uD569\uD55C \uD504\uB85C\uC81D\uC158 \uC0AC\uC591\uC785\uB2C8\uB2E4.
2037={0} \uAC12\uC740 {1} \uC720\uD615\uC758 \uBD80\uC801\uD569\uD55C \uD0A4 \uC785\uB2C8\uB2E4.
2038=\uC778\uB371\uC2A4 \uC694\uCCAD\uC5D0 {0}\uAC1C\uAC00 \uB118\uB294 \uC5F4\uC774 \uC788\uC2B5\uB2C8\uB2E4.
2039=\uC778\uB371\uC2A4\uB294 \uC554\uD638\uD654\uB41C \uCF58\uD150\uCE20\uC5D0\uC11C \uC0DD\uC131\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4. \uC778\uB371\uC2F1\uC740 \uCF58\uD150\uCE20 \uC5F4 \uC554\uD638\uD654\uAC00 NONE\uC73C\uB85C \uC124\uC815\uB41C \uACBD\uC6B0\uC5D0\uB9CC \uD5C8\uC6A9\uB429\uB2C8\uB2E4.
2040=next()\uB294 \uB2EB\uD78C \uCEE4\uC11C\uC5D0\uC11C \uD638\uCD9C\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2041=\uBAA8\uC74C\uC744 \uC0AD\uC81C\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. \uBAA8\uC74C\uC5D0 \uB300\uD55C \uBAA8\uB4E0 \uBBF8\uCC98\uB9AC \uC4F0\uAE30\uAC00 \uCEE4\uBC0B\uB418\uC5C8\uB294\uC9C0 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.
2042=\uC774 \uC791\uC5C5\uC744 \uC218\uD589\uD558\uB824\uBA74 SODA\uAC00 \uD2B8\uB79C\uC7AD\uC158\uC744 \uC2DC\uC791\uD574\uC57C \uD558\uC9C0\uB9CC, JDBC \uC811\uC18D \uC790\uB3D9 \uCEE4\uBC0B\uC744 \uC0AC\uC6A9 \uC548\uD568\uC73C\uB85C \uC124\uC815\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
2043={0} \uC0AC\uC591 \uBB38\uC11C\uC5D0 \uCF58\uD150\uCE20\uAC00 \uC5C6\uAC70\uB098 \uBE48 \uCF58\uD150\uCE20\uAC00 \uC788\uC2B5\uB2C8\uB2E4.
2045=\uD504\uB85C\uC81D\uC158 \uC0AC\uC591\uC5D0\uB294 \uD3EC\uD568 \uBC0F \uC81C\uC678 \uADDC\uCE59\uC774 \uD63C\uD569\uB418\uC5B4 \uC788\uC73C\uBA74 \uC548\uB429\uB2C8\uB2E4.
2046=\uC778\uB371\uC2A4\uC758 \uACBD\uB85C \uB610\uB294 order by \uC870\uAC74\uC5D0 \uBC30\uC5F4 \uB2E8\uACC4\uAC00 \uD3EC\uD568\uB418\uC5B4 \uC788\uC73C\uBA74 \uC548\uB429\uB2C8\uB2E4.
2047=\uC811\uC18D\uC740 OracleConnection \uB610\uB294 OracleConnection\uC5D0 \uB300\uD55C \uB798\uD37C\uC5EC\uC57C \uD569\uB2C8\uB2E4.
2048=\uC5B8\uC5B4 \uB9E4\uAC1C\uBCC0\uC218\uB294 12.1.0.2 Oracle Database \uD14D\uC2A4\uD2B8 \uC778\uB371\uC2A4\uC5D0 \uB300\uD574 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
2049=\uAE30\uBCF8 \uD568\uC218 \uC778\uB371\uC2A4 \uBAA8\uB4DC\uB294 12.2.0.1 Oracle Database \uB9B4\uB9AC\uC2A4\uBD80\uD130 \uC9C0\uC6D0\uB418\uB294 json_value "null on empty" \uC808\uC744 \uC0AC\uC6A9\uD569\uB2C8\uB2E4. "scalarRequired" \uBC0F "lax" \uBAA8\uB4DC\uB294 12.1.0.2\uC5D0\uC11C \uC9C0\uC6D0\uB429\uB2C8\uB2E4. \uCC38\uACE0: "lax" \uC778\uB371\uC2A4\uB294 QBE\uC5D0 \uC0AC\uC6A9\uB418\uC9C0 \uC54A\uC73C\uBBC0\uB85C "scalarRequired"\uAC00 \uAD8C\uC7A5\uB429\uB2C8\uB2E4.
2050="{0}"\uC740(\uB294) 12.1.0.2 Oracle Database \uD14D\uC2A4\uD2B8 \uC778\uB371\uC2A4\uC5D0 \uB300\uD574 \uC9C0\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2051="{0}" \uC791\uC5C5\uC744 \uC218\uD589\uD558\uB824\uBA74 \uC811\uC18D\uC774 \uC790\uB3D9 \uCEE4\uBC0B \uBAA8\uB4DC\uC778 \uC0C1\uD0DC\uC5D0\uC11C \uD2B8\uB79C\uC7AD\uC158\uC744 \uAD00\uB9AC\uD574\uC57C \uD569\uB2C8\uB2E4. \uB2E8, "avoidTxnManagement" \uD50C\uB798\uADF8\uAC00 OracleDatabase \uC778\uC2A4\uD134\uC2A4\uC5D0\uC11C true\uB85C \uC124\uC815\uB418\uC5B4\uC57C \uD569\uB2C8\uB2E4. \uC791\uC5C5\uC744 \uC2E4\uD589\uD558\uB824\uBA74 \uC790\uB3D9 \uCEE4\uBC0B \uBAA8\uB4DC\uB97C \uC0AC\uC6A9 \uC548\uD568\uC73C\uB85C \uC124\uC815\uD558\uC2ED\uC2DC\uC624.
2052=keyLike()\uB294 \uD074\uB77C\uC774\uC5B8\uD2B8 \uC9C0\uC815 \uD0A4 \uBC0F varchar2 \uD0A4 \uC5F4 \uC720\uD615\uC758 \uBAA8\uC74C\uC5D0 \uB300\uD574\uC11C\uB9CC \uC9C0\uC815\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
2053=\uC9C0\uC815\uB41C \uC774\uB984\uC744 \uC0AC\uC6A9\uD558\uB294 \uC778\uB371\uC2A4\uAC00 \uC2A4\uD0A4\uB9C8\uC5D0 \uC874\uC7AC\uD569\uB2C8\uB2E4.
2054=\uC9D1\uACC4 \uC791\uC5C5\uC5D0 \uB300\uD574\uC11C\uB294 \uAC74\uB108\uB6F0\uAE30 \uB610\uB294 \uC81C\uD55C\uC744 \uC124\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2055=12.2 Database \uC774\uD6C4 \uB9B4\uB9AC\uC2A4\uC5D0\uC11C\uB294 textIndex121WithLang \uB9E4\uAC1C\uBCC0\uC218\uB97C true\uB85C \uC124\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2056=\uD504\uB85C\uC81D\uC158 \uC0AC\uC591\uC5D0\uB294 \uBC30\uC5F4 \uB2E8\uACC4\uAC00 \uD3EC\uD568\uB418\uC9C0 \uC54A\uC544\uC57C \uD569\uB2C8\uB2E4.
2057=\uD504\uB85C\uC81D\uC158 \uC0AC\uC591\uC5D0\uC11C \uACBD\uB85C\uB294 \uACF5\uD1B5 \uC811\uB450\uC5B4\uB97C \uACF5\uC720\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2058={0} \uBA54\uC18C\uB4DC\uB294 {1} \uBA54\uC18C\uB4DC\uC640 \uD568\uAED8 \uC9C0\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2059=\uC785\uB825 \uBB38\uC11C\uC758 JSON \uCF58\uD150\uCE20\uB97C \uBC14\uC774\uB108\uB9AC\uB85C \uBCC0\uD658\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. \uC785\uB825 \uBB38\uC11C\uC758 \uCF58\uD150\uCE20\uAC00 \uC801\uD569\uD55C JSON\uC778\uC9C0 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.
2060=\uBC14\uC774\uB108\uB9AC JSON\uC744 \uD14D\uC2A4\uD2B8 JSON\uC73C\uB85C \uC804\uD658\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
2061=\uBB38\uC11C \uD0A4\uC5D0 \uC9C0\uC815\uB41C \uACBD\uB85C\uAC00 \uBD80\uC801\uD569\uD569\uB2C8\uB2E4.
2062=\uACBD\uB85C\uB97C \uBB38\uC11C\uC5D0\uC11C \uCD94\uCD9C\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2063=\uACBD\uB85C\uB97C \uBB38\uC11C\uC5D0 \uC0BD\uC785\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2064=contentColumn.sqlType\uC774 JSON\uC778 \uACBD\uC6B0 \uAC80\uC99D\uC744 \uC9C0\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

#
# Internal errors  (2500 to 2999 error code range)
#
2500={0} \uBAA8\uC74C\uC5D0 \uC5F4 \uC720\uD615 {1}\uC758 \uBC14\uC774\uB108\uB9AC \uB0B4\uC6A9\uC774 \uC788\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2501={0} \uBAA8\uC74C\uC740 {1} \uBC84\uC804 \uC9C0\uC815\uC744 \uC0AC\uC6A9\uD558\uBA70 \uC2A4\uD2B8\uB9BC \uC4F0\uAE30\uAC00 \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
2502={0} \uBAA8\uC74C\uC5D0 \uBB38\uC11C \uC800\uC7A5\uC774 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
2503={0} \uBAA8\uC74C\uC5D0 \uBB38\uC11C \uC0BD\uC785\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
2504=UUID \uAE30\uBC18 \uD0A4\uB97C \uC0DD\uC131\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
2505={0} \uD0A4\uAC00 \uD3EC\uD568\uB41C \uBB38\uC11C \uD06C\uAE30\uAC00 {1}\uC774\uBA70, 2GB \uC81C\uD55C\uC744 \uCD08\uACFC\uD569\uB2C8\uB2E4.
2506=IDENTITY \uD0A4 \uC9C0\uC815\uC744 \uC704\uD574\uC11C\uB294 SQL\uC5D0\uC11C RETURNING \uC9C0\uC6D0\uC774 \uD544\uC694\uD569\uB2C8\uB2E4.
2507=\uB370\uC774\uD130\uBCA0\uC774\uC2A4 \uBC84\uC804\uC744 \uAC00\uC838\uC624\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=\uC790\uB974\uAE30\uAC00 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC73C\uBA70 {0} \uBAA8\uC74C\uC740 \uD14C\uC774\uBE14 \uAE30\uBC18\uC774 \uC544\uB2D9\uB2C8\uB2E4.
3001=JSON \uAC80\uC0C9 \uC778\uB371\uC2A4\uB294 {0} \uC720\uD615\uC758 \uCF58\uD150\uCE20 \uC5F4\uC5D0 \uB300\uD574 \uAD6C\uD604\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
3002=JSON \uAC80\uC0C9 \uC778\uB371\uC2A4\uB294 NVARCHAR2 \uD0A4\uB97C \uC0AC\uC6A9\uD558\uB294 \uBAA8\uC74C\uC5D0 \uB300\uD574 \uAD6C\uD604\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
3003=JVM(Java Virtual Machine)\uC5D0\uC11C\uB294 MD5 \uBC84\uC804 \uC9C0\uC815 \uC54C\uACE0\uB9AC\uC998\uC774 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. \uB2E4\uB978 \uBC84\uC804 \uC9C0\uC815 \uC54C\uACE0\uB9AC\uC998\uC73C\uB85C \uC804\uD658\uD558\uC2ED\uC2DC\uC624.
3004=JVM(Java Virtual Machine)\uC5D0\uC11C\uB294 SHA256 \uBC84\uC804 \uC9C0\uC815 \uC54C\uACE0\uB9AC\uC998\uC774 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. \uB2E4\uB978 \uBC84\uC804 \uC9C0\uC815 \uC54C\uACE0\uB9AC\uC998\uC73C\uB85C \uC804\uD658\uD558\uC2ED\uC2DC\uC624.
3005=\uAE30\uB2A5\uC774 \uAD6C\uD604\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4.
3006=JSON \uACF5\uAC04 \uC778\uB371\uC2A4\uD654\uB294 \uC774\uAE30\uC885 \uBAA8\uC74C\uC5D0\uC11C \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
3007=JSON \uAC80\uC0C9 \uC778\uB371\uC2A4\uD654\uB294 \uC774\uAE30\uC885 \uBAA8\uC74C\uC5D0\uC11C \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
3008=JSON \uD568\uC218 \uC778\uB371\uC2A4\uD654\uB294 \uC774\uAE30\uC885 \uBAA8\uC74C\uC5D0\uC11C \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
3009=Query-by-example(QBE)\uC740 \uC774\uAE30\uC885 \uBAA8\uC74C\uC5D0\uC11C \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
