#
# Copyright (c) 2014, 2020, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=A(z) {0} gy\u0171jtem\u00E9ny \u00EDr\u00E1sv\u00E9dett, {1} nem megengedett.
2001=A(z) {0} gy\u0171jtem\u00E9ny nem rendelkezik az utols\u00F3 m\u00F3dos\u00EDt\u00E1st jelz\u0151 id\u0151b\u00E9lyeggel.
2002=\u00C9rv\u00E9nytelen sz\u0171r\u00E9si felt\u00E9tel.
2003=A le\u00EDr\u00F3 nem egyezik megl\u00E9v\u0151 gy\u0171jtem\u00E9nnyel.
2004=A(z) {0} argumentum nem lehet null \u00E9rt\u00E9k\u0171.
2005=A(z) {0} k\u00E9szlet \u00FCres.
2006=A ''since'' \u00E9s az ''until'' argumentum nem lehet egyar\u00E1nt null \u00E9rt\u00E9k\u0171.
2007=A(z) {0} gy\u0171jtem\u00E9ny nem rendelkezik v\u00E1ltozattal.
2008=A(z) {0} argumentumnak pozit\u00EDv \u00E9rt\u00E9k\u0171nek kell lennie.
2009=A key(), keys() vagy filter() met\u00F3dus haszn\u00E1lat\u00E1val megadott kulcsok sz\u00E1ma \u00F6sszesen {0}, amely meghaladja a legfeljebb megengedett {1} hat\u00E1r\u00E9rt\u00E9ket.
2010=A(z) {0} iter\u00E1tor null \u00E9rt\u00E9ket adott vissza {1} dokumentum visszaad\u00E1sa ut\u00E1n.
2011=\u00C9rv\u00E9nytelen "{0}" argumentum\u00E9rt\u00E9k.
2012=A maxim\u00E1lis hossz\u00FAs\u00E1g LOB \u00E9s JSON t\u00EDpusn\u00E1l nem \u00E1ll\u00EDthat\u00F3 be.
2013=SecureFile LOB be\u00E1ll\u00EDt\u00E1sok nem haszn\u00E1lhat\u00F3k, ha a tartalomoszlop t\u00EDpusa "{0}"
2014=A legut\u00F3bb m\u00F3dos\u00EDtott oszlopindex csak akkor \u00E1ll\u00EDthat\u00F3 be, ha legut\u00F3bb m\u00F3dos\u00EDtott oszlopn\u00E9v meg van adva.
2015=Ha a hozz\u00E1rendel\u00E9si m\u00F3dszer "SEQUENCE", kulcsoszlop sorrendi nev\u00E9t meg kell adni.
2016=Verzi\u00F3kezel\u00E9si m\u00F3dszer lett megadva, de a verzi\u00F3oszlop neve nincs megadva.
2017=A kulcsoszlop megadott t\u00EDpusa nem haszn\u00E1lhat\u00F3 maxim\u00E1lis hossz\u00FAs\u00E1ggal.
2018=Karakter t\u00EDpus\u00FA kulcs\u00E9rt\u00E9kek hozz\u00E1rendel\u00E9s\u00E9n\u00E9l a GUID vagy az UUID haszn\u00E1latakor a kulcsoszlop hossz\u00FAs\u00E1g\u00E1nak legal\u00E1bb 32 b\u00E1jtnak kell lennie.
2019=A gy\u0171jtem\u00E9ny csak akkor rendelkezhet m\u00E9diat\u00EDpus oszloppal, ha a tartalomoszlop t\u00EDpusa BLOB.
2020=A dokumentum m\u00E9diat\u00EDpusa nem "application/json". A getContentAsString() csak JSON dokumentumokn\u00E1l haszn\u00E1lhat\u00F3.
2021=A(z) {0} k\u00E9szlet null \u00E9rt\u00E9ket tartalmaz.
2022=A cser\u00E9lni k\u00EDv\u00E1nt dokumentumhoz tartoz\u00F3 kulcsot meg kell adni a key() met\u00F3dus haszn\u00E1lat\u00E1val.
2023=A(z) {0} argumentumnak nem negat\u00EDv \u00E9rt\u00E9k\u0171nek kell lennie.
2024=\u00C9rv\u00E9nytelen indexl\u00E9trehoz\u00E1si specifik\u00E1ci\u00F3.
2025=\u00C9rv\u00E9nytelen indexeldob\u00E1si specifik\u00E1ci\u00F3.
2026=A gy\u0171jtem\u00E9ny metaadat-dokumentuma nem rendelkezik tartalommal, vagy az \u00FCres.
2027=A gy\u0171jtem\u00E9ny metaadat-dokumentuma nem \u00E9rv\u00E9nyes JSON.
2028=A gy\u0171jtem\u00E9ny metaadat-dokumentuma nem \u00E9rv\u00E9nyes JSON, nem \u00E1llap\u00EDthat\u00F3 meg a k\u00F3dol\u00E1s.
2029=IOException t\u00F6rt\u00E9nt a gy\u0171jtem\u00E9ny metaadat-dokumentum\u00E1nak feldolgoz\u00E1sakor.
2030=\u00C9rv\u00E9nytelen \u00E9rt\u00E9k "{0}" sz\u00E1m\u00E1ra a gy\u0171jtem\u00E9ny metaadataiban.
2031=A gy\u0171jtem\u00E9ny metaadatainak JSON objektumnak kell lenni\u00FCk.
2032=A(z) "{0}" objektumkulcs nem v\u00E1rt a gy\u0171jtem\u00E9ny metaadataiban.
2033=A gy\u0171jtem\u00E9ny nincs konfigur\u00E1lva \u00FCgyf\u00E9l \u00E1ltal hozz\u00E1rendelt kulcsokra, de a bemeneti dokumentum kulccsal rendelkezik.
2034=A gy\u0171jtem\u00E9ny nincs konfigur\u00E1lva \u00FCgyf\u00E9l \u00E1ltal hozz\u00E1rendelt kulcsra, de a(z) {0} iter\u00E1tor kulccsal rendelkez\u0151 dokumentumot adott vissza {1} dokumentum visszaad\u00E1sa ut\u00E1n.
2035=A megadott JDBC kapcsolaton h\u00EDvott getCurrentSchema() null \u00E9rt\u00E9ket adott vissza.
2036=\u00C9rv\u00E9nytelen lek\u00E9pez\u00E9s-specifik\u00E1ci\u00F3.
2037=A(z) {0} \u00E9rt\u00E9k nem \u00E9rv\u00E9nyes {1} t\u00EDpus\u00FA kulcs.
2038=Az indexk\u00E9relem {0} oszlopn\u00E1l t\u00F6bbet tartalmaz.
2039=Index nem hozhat\u00F3 l\u00E9tre titkos\u00EDtott tartalmon. Az indexel\u00E9s kiz\u00E1r\u00F3lag akkor megengedett, ha a tartalomoszlop titkos\u00EDt\u00E1s\u00E1nak be\u00E1ll\u00EDt\u00E1sa NONE.
2040=A next() nem h\u00EDvhat\u00F3 lez\u00E1rt kurzoron.
2041=Hiba a gy\u0171jtem\u00E9ny eldob\u00E1s\u00E1nak megpr\u00F3b\u00E1l\u00E1sakor. Ellen\u0151rizze, hogy a gy\u0171jtem\u00E9nybe befejez\u0151dtek-e a folyamatban l\u00E9v\u0151 \u00EDr\u00E1sok.
2042=Enn\u00E9l a m\u0171veletn\u00E9l SODA sz\u00FCks\u00E9ges tranzakci\u00F3 ind\u00EDt\u00E1s\u00E1hoz, de hiba t\u00F6rt\u00E9nt a JDBC-kapcsolat automatikus j\u00F3v\u00E1hagy\u00E1s\u00E1nak letilt\u00E1sakor.
2043={0} specifik\u00E1ci\u00F3s dokumentuma nem rendelkezik tartalommal, vagy az \u00FCres.
2045=A lek\u00E9pez\u00E9s-specifik\u00E1ci\u00F3 nem tartalmazhat vegyesen befoglal\u00F3 \u00E9s kiz\u00E1r\u00F3 szab\u00E1lyokat.
2046=Index vagy rendez\u00E9si felt\u00E9tel el\u00E9r\u00E9si \u00FAtvonala nem tartalmazhat t\u00F6mbl\u00E9p\u00E9seket.
2047=A kapcsolat csak OracleConnection vagy egy OracleConnection-csomagol\u00F3 lehet.
2048=A 12.1.0.2 Oracle Database sz\u00F6vegindexe nem t\u00E1mogatja a nyelvi param\u00E9tert.
2049=Az alap\u00E9rtelmezett funkcion\u00E1lis index m\u00F3d json_value "null on empty" utas\u00EDt\u00E1sr\u00E9szen alapul, amelyet az Oracle Database 12.2.0.1-es \u00E9s \u00FAjabb verzi\u00F3i t\u00E1mogatnak. A "scalarRequired" \u00E9s a "lax" m\u00F3dot a 12.1.0.2-es verzi\u00F3 t\u00E1mogatja. Megjegyz\u00E9s: a QBE-k nem haszn\u00E1lj\u00E1k a "lax" indexeket, ez\u00E9rt a "scalarRequired" index haszn\u00E1lata aj\u00E1nlott.
2050=A(z) "{0}" nem adhat\u00F3 meg a 12.1.0.2 Oracle Database sz\u00F6vegindexe sz\u00E1m\u00E1ra.
2051=A(z) "{0}" m\u0171velethez tranzakci\u00F3kezel\u00E9s sz\u00FCks\u00E9ges, ha a kapcsolat automatikus j\u00F3v\u00E1hagy\u00E1s m\u00F3dban van, de az "avoidTxnManagement" jelz\u0151 igaz \u00E9rt\u00E9kre van \u00E1ll\u00EDtva az Oracle Database-p\u00E9ld\u00E1nyon. A m\u0171velet v\u00E9grehajt\u00E1s\u00E1hoz tiltsa le az automatikus j\u00F3v\u00E1hagy\u00E1s m\u00F3dot.
2052=A keyLike() csak \u00FCgyf\u00E9l \u00E1ltal hozz\u00E1rendelt kulcsokat \u00E9s varchar2 t\u00EDpus\u00FA kulcsoszlopot tartalmaz\u00F3 gy\u0171jtem\u00E9nyhez adhat\u00F3 meg.
2053=A megadott nev\u0171 index m\u00E1r l\u00E9tezik a s\u00E9m\u00E1ban.
2054=sz\u00E1ml\u00E1l\u00E1si m\u0171velethez nem \u00E1ll\u00EDthat\u00F3 be a kihagy\u00E1s vagy a korl\u00E1t.
2055=Az igaz \u00E9rt\u00E9kre be\u00E1ll\u00EDtott textIndex121WithLang param\u00E9tert a 12.2-n\u00E9l \u00FAjabb adatb\u00E1zis-verzi\u00F3k nem t\u00E1mogatj\u00E1k.
2056=A lek\u00E9pez\u00E9s-specifik\u00E1ci\u00F3 nem tartalmazhat t\u00F6mbl\u00E9p\u00E9seket.
2057=Lek\u00E9pez\u00E9s-specifik\u00E1ci\u00F3ban az el\u00E9r\u00E9si utak nem haszn\u00E1lhatnak k\u00F6z\u00F6s el\u0151tagot.
2058=A(z) {0} met\u00F3dus nem hat\u00E1rozhat\u00F3 meg a(z) {1} met\u00F3dussal egy\u00FCtt.
2059=Hiba t\u00F6rt\u00E9nt a bemeneti dokumentumhoz tartoz\u00F3 JSON bin\u00E1riss\u00E1 alak\u00EDt\u00E1sa k\u00F6zben. Gy\u0151z\u0151dj\u00F6n meg r\u00F3la, hogy a bemeneti dokumentum tartalma \u00E9rv\u00E9nyes JSON.
2060=Hiba t\u00F6rt\u00E9nt a bin\u00E1ris JSON sz\u00F6veges JSON-n\u00E1 alak\u00EDt\u00E1sa k\u00F6zben.
2061=\u00C9rv\u00E9nytelen a dokumentum kulcs\u00E1hoz megadott el\u00E9r\u00E9si \u00FAt.
2062=A dokumentumb\u00F3l nem nyerhet\u0151 ki az el\u00E9r\u00E9si \u00FAt.
2063=Nem illeszthet\u0151 be el\u00E9r\u00E9si \u00FAt a dokumentumba.
2064=Nem adhat\u00F3 meg \u00E9rv\u00E9nyes\u00EDt\u00E9s, ha a contentColumn.sqlType \u00E9rt\u00E9ke JSON.
2065=A(z) {0} t\u00EDpus nem t\u00E1mogatott
2066=A(z) {0} tipp nem Karakterl\u00E1nc t\u00EDpus\u00FA, vagy tartalmazza a /* vagy a */ karakterp\u00E1rt.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=A(z) {0} gy\u0171jtem\u00E9ny nem rendelkezhet bin\u00E1ris tartalommal {1} oszlopt\u00EDpusban.
2501=A(z) {0} gy\u0171jtem\u00E9ny {1} verzi\u00F3kezel\u00E9st haszn\u00E1l, folyamatos \u00E1tviteli \u00EDr\u00E1s nem megengedett.
2502=Dokumentum ment\u00E9se sikertelen a gy\u0171jtem\u00E9nybe: {0}.
2503=Dokumentum besz\u00FAr\u00E1sa sikertelen a gy\u0171jtem\u00E9nybe: {0}.
2504=Nem lehet UUID alap\u00FA kulcsot el\u0151\u00E1ll\u00EDtani.
2505=A(z) {0} kulcs m\u00E9rete {1}, ez pedig nagyobb, mint a megengedett 2 GB.
2506=IDENTITY kulcs hozz\u00E1rendel\u00E9s\u00E9hez a RETURNING t\u00E1mogat\u00E1sa sz\u00FCks\u00E9ges az SQL rendszeren.
2507=Hiba az adatb\u00E1zis-verzi\u00F3 megszerz\u00E9sekor.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=A csonkol\u00E1s nem t\u00E1mogatott, a(z) {0} gy\u0171jtem\u00E9ny nem t\u00E1bl\u00E1n alapul\u00F3.
3001=A JSON keres\u00E9si index nincs megval\u00F3s\u00EDtva {0} t\u00EDpus\u00FA tartalomoszlopokhoz.
3002=A JSON keres\u00E9si index nincs megval\u00F3s\u00EDtva NVARCHAR2 kulcsokkal rendelkez\u0151 gy\u0171jtem\u00E9nyekhez.
3003=A Java virtu\u00E1lis sz\u00E1m\u00EDt\u00F3g\u00E9p (JVM) nem teszi t\u00E1mogatja az MD5 verzi\u00F3kezel\u00E9si algoritmust. V\u00E1ltson m\u00E1sik verzi\u00F3kezel\u00E9si algoritmusra.
3004=A Java virtu\u00E1lis sz\u00E1m\u00EDt\u00F3g\u00E9p (JVM) nem teszi t\u00E1mogatja az SHA256 verzi\u00F3kezel\u00E9si algoritmust. V\u00E1ltson m\u00E1sik verzi\u00F3kezel\u00E9si algoritmusra.
3005=A szolg\u00E1ltat\u00E1s nincs megval\u00F3s\u00EDtva.
3006=A JSON t\u00E9rbeli indexel\u00E9s heterog\u00E9n gy\u0171jtem\u00E9nyek eset\u00E9n nem t\u00E1mogatott.
3007=A JSON keres\u00E9si indexel\u00E9s heterog\u00E9n gy\u0171jtem\u00E9nyek eset\u00E9n nem t\u00E1mogatott.
3008=A JSON funkcion\u00E1lis indexel\u00E9s heterog\u00E9n gy\u0171jtem\u00E9nyek eset\u00E9n nem t\u00E1mogatott.
3009=A Lek\u00E9rdez\u00E9s p\u00E9lda alapj\u00E1n (QBE) heterog\u00E9n gy\u0171jtem\u00E9nyek eset\u00E9n nem t\u00E1mogatott.
