#
# Copyright (c) 2014, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Kolekcia {0} je len na \u010D\u00EDtanie, {1} nie je povolen\u00E9.
2001=Kolekcia {0} nem\u00E1 \u017Eiadnu \u010Dasov\u00FA zna\u010Dku, ktor\u00E1 by ozna\u010Dovala, kedy bola naposledy modifikovan\u00E1.
2002=Neplatn\u00E1 podmienka filtra.
2003=Deskriptor nezodpoved\u00E1 existuj\u00FAcej kolekcii.
2004=Argument {0} nem\u00F4\u017Ee by\u0165 null.
2005=Mno\u017Eina {0} je pr\u00E1zdna.
2006=Obidva argumenty ''since'' a ''until'' nem\u00F4\u017Eu by\u0165 null.
2007=Kolekcia {0} nem\u00E1 verziu.
2008=Argument {0} mus\u00ED by\u0165 kladn\u00FD.
2009=Celkov\u00FD po\u010Det k\u013E\u00FA\u010Dov zadan\u00FDch pomocou met\u00F3d key(), keys() alebo filter() je {0}, \u010Do prekra\u010Duje maxim\u00E1lny limit {1}.
2010=Iter\u00E1tor {0} vr\u00E1til hodnotu null po vr\u00E1ten\u00ED {1} dokumentov.
2011=Neplatn\u00E1 hodnota argumentu "{0}".
2012=Pre typy LOB nie je mo\u017En\u00E9 nastavi\u0165 maxim\u00E1lnu d\u013A\u017Eku.
2013=Nastavenia objektu SecureFile LOB nie je mo\u017En\u00E9 pou\u017Ei\u0165, ke\u010F je st\u013Apec obsahu typu "{0}"
2014=Index naposledy modifikovan\u00E9ho st\u013Apca je mo\u017En\u00E9 nastavi\u0165, len ak je nastaven\u00FD n\u00E1zov naposledy modifikovan\u00E9ho st\u013Apca.
2015=Ak je met\u00F3da priradenia "SEQUENCE", je potrebn\u00E9 zada\u0165 n\u00E1zov sekvencie k\u013E\u00FA\u010Dov\u00FDch st\u013Apcov.
2016=Met\u00F3da verzie bola zadan\u00E1, ale nie je zadan\u00FD n\u00E1zov st\u013Apca verzie.
2017=Zadan\u00FD typ k\u013E\u00FA\u010Dov\u00E9ho st\u013Apca nie je mo\u017En\u00E9 pou\u017Ei\u0165 s maxim\u00E1lnou d\u013A\u017Ekou.
2018=Ak sa na priradenie hodn\u00F4t k\u013E\u00FA\u010Dov znakov\u00FDch typov pou\u017E\u00EDva GUID alebo UUID, d\u013A\u017Eka k\u013E\u00FA\u010Dov\u00E9ho st\u013Apca mus\u00ED by\u0165 32 bajtov alebo v\u00E4\u010D\u0161ia.
2019=Kolekcia nemus\u00ED ma\u0165 st\u013Apec typu m\u00E9dia, ak typom st\u013Apca obsahu nie je BLOB.
2020=Typ m\u00E9dia dokumentu nie je "application/json". Met\u00F3da getContentAsString() je podporovan\u00E1 len pre dokumenty JSON.
2021=Mno\u017Eina {0} obsahuje hodnotu null.
2022=K\u013E\u00FA\u010D pre dokument, ktor\u00FD sa m\u00E1 nahradi\u0165, mus\u00ED by\u0165 zadan\u00FD pomocou met\u00F3dy key().
2023=Argument {0} mus\u00ED by\u0165 nez\u00E1porn\u00FD.
2024=Neplatn\u00E1 \u0161pecifik\u00E1cia vytvorenia indexu.
2025=Neplatn\u00E1 \u0161pecifik\u00E1cia zru\u0161enia indexu.
2026=Dokument metad\u00E1t kolekcie nem\u00E1 \u017Eiadny obsah alebo m\u00E1 pr\u00E1zdny obsah.
2027=Dokument metad\u00E1t kolekcie nie je platn\u00FD form\u00E1t JSON.
2028=Dokument metad\u00E1t kolekcie nie je platn\u00FD form\u00E1t JSON, nepodarilo sa ur\u010Di\u0165 k\u00F3dovanie.
2029=Po\u010Das spracovania dokumentu metad\u00E1t kolekcie sa vyskytla v\u00FDnimka IOException.
2030=Neplatn\u00E1 hodnota pre "{0}" v metad\u00E1tach kolekcie.
2031=Metad\u00E1ta kolekcie musia by\u0165 objektom JSON.
2032=K\u013E\u00FA\u010D objektu "{0}" sa neo\u010Dak\u00E1va v metad\u00E1tach kolekcie.
2033=Kolekcia nie je nakonfigurovan\u00E1 s k\u013E\u00FA\u010Dmi priraden\u00FDmi klientom, ale vstupn\u00FD dokument m\u00E1 k\u013E\u00FA\u010D.
2034=Kolekcia nie je nakonfigurovan\u00E1 s k\u013E\u00FA\u010Dom priraden\u00FDm klientom, ale iter\u00E1tor {0} vr\u00E1til dokument s k\u013E\u00FA\u010Dom po vr\u00E1ten\u00ED {1} dokumentov.
2035=Met\u00F3da getCurrentSchema() vyvolan\u00E1 pre zadan\u00E9 pripojenie JDBC vr\u00E1tila hodnotu null.
2036=Neplatn\u00E1 \u0161pecifik\u00E1cia projekcie.
2037=Hodnota {0} nie je platn\u00FD k\u013E\u00FA\u010D typu {1}.
2038=Po\u017Eiadavka indexu m\u00E1 v\u00E4\u010D\u0161\u00ED po\u010Det st\u013Apcov ako {0}.
2039=Nie je mo\u017En\u00E9 vytvori\u0165 index pre \u0161ifrovan\u00FD obsah. Indexovanie je povolen\u00E9, len ak je \u0161ifrovanie st\u013Apca obsahu nastaven\u00E9 na NONE.

#
# Internal errors  (2500 to 2999 error code range)
#
2500=Kolekcia {0} nem\u00F4\u017Ee ma\u0165 bin\u00E1rny obsah v type st\u013Apca {1}.
2501=Kolekcia {0} pou\u017E\u00EDva vytv\u00E1ranie verzi\u00ED {1}, z\u00E1pisy vysielania toku d\u00E1t nie s\u00FA povolen\u00E9.
2502=Ulo\u017Eenie dokumentu do kolekcie {0} zlyhalo.
2503=Vlo\u017Eenie dokumentu do kolekcie {0} zlyhalo.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Skr\u00E1tenie nie je podporovan\u00E9, kolekcia {0} nie je zalo\u017Een\u00E1 na tabu\u013Eke.
3001=Funkcia indexAll nie je implementovan\u00E1 pre st\u013Apce obsahu s typom {0}.
3002=Funkcia indexAll nie je implementovan\u00E1 pre kolekcie s k\u013E\u00FA\u010Dmi NVARCHAR2. 
