#
# Copyright (c) 2014, 2020, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Kolekcia {0} je len na \u010D\u00EDtanie, {1} nie je povolen\u00E9.
2001=Kolekcia {0} nem\u00E1 \u017Eiadnu \u010Dasov\u00FA zna\u010Dku, ktor\u00E1 by ozna\u010Dovala, kedy bola naposledy modifikovan\u00E1.
2002=Neplatn\u00E1 podmienka filtra.
2003=Deskriptor nezodpoved\u00E1 existuj\u00FAcej kolekcii.
2004=Argument {0} nem\u00F4\u017Ee by\u0165 null.
2005=Mno\u017Eina {0} je pr\u00E1zdna.
2006=Obidva argumenty ''since'' a ''until'' nem\u00F4\u017Eu by\u0165 null.
2007=Kolekcia {0} nem\u00E1 verziu.
2008=Argument {0} mus\u00ED by\u0165 kladn\u00FD.
2009=Celkov\u00FD po\u010Det k\u013E\u00FA\u010Dov zadan\u00FDch pomocou met\u00F3d key(), keys() alebo filter() je {0}, \u010Do prekra\u010Duje maxim\u00E1lny limit {1}.
2010=Iter\u00E1tor {0} vr\u00E1til hodnotu null po vr\u00E1ten\u00ED {1} dokumentov.
2011=Neplatn\u00E1 hodnota argumentu "{0}".
2012=Maxim\u00E1lnu d\u013A\u017Eku nie je mo\u017En\u00E9 nastavi\u0165 pre typy LOB ani pre typ JSON.
2013=Nastavenia objektu SecureFile LOB nie je mo\u017En\u00E9 pou\u017Ei\u0165, ke\u010F je st\u013Apec obsahu typu "{0}"
2014=Index naposledy modifikovan\u00E9ho st\u013Apca je mo\u017En\u00E9 nastavi\u0165, len ak je nastaven\u00FD n\u00E1zov naposledy modifikovan\u00E9ho st\u013Apca.
2015=Ak je met\u00F3da priradenia "SEQUENCE", je potrebn\u00E9 zada\u0165 n\u00E1zov sekvencie k\u013E\u00FA\u010Dov\u00FDch st\u013Apcov.
2016=Met\u00F3da verzie bola zadan\u00E1, ale nie je zadan\u00FD n\u00E1zov st\u013Apca verzie.
2017=Zadan\u00FD typ k\u013E\u00FA\u010Dov\u00E9ho st\u013Apca nie je mo\u017En\u00E9 pou\u017Ei\u0165 s maxim\u00E1lnou d\u013A\u017Ekou.
2018=Ak sa na priradenie hodn\u00F4t k\u013E\u00FA\u010Dov znakov\u00FDch typov pou\u017E\u00EDva GUID alebo UUID, d\u013A\u017Eka k\u013E\u00FA\u010Dov\u00E9ho st\u013Apca mus\u00ED by\u0165 32 bajtov alebo v\u00E4\u010D\u0161ia.
2019=Kolekcia nemus\u00ED ma\u0165 st\u013Apec typu m\u00E9dia, ak typom st\u013Apca obsahu nie je BLOB.
2020=Typ m\u00E9dia dokumentu nie je "application/json". Met\u00F3da getContentAsString() je podporovan\u00E1 len pre dokumenty JSON.
2021=Mno\u017Eina {0} obsahuje hodnotu null.
2022=K\u013E\u00FA\u010D pre dokument, ktor\u00FD sa m\u00E1 nahradi\u0165, mus\u00ED by\u0165 zadan\u00FD pomocou met\u00F3dy key().
2023=Argument {0} mus\u00ED by\u0165 nez\u00E1porn\u00FD.
2024=Neplatn\u00E1 \u0161pecifik\u00E1cia vytvorenia indexu.
2025=Neplatn\u00E1 \u0161pecifik\u00E1cia zru\u0161enia indexu.
2026=Dokument metad\u00E1t kolekcie nem\u00E1 \u017Eiadny obsah alebo m\u00E1 pr\u00E1zdny obsah.
2027=Dokument metad\u00E1t kolekcie nie je platn\u00FD form\u00E1t JSON.
2028=Dokument metad\u00E1t kolekcie nie je platn\u00FD form\u00E1t JSON, nepodarilo sa ur\u010Di\u0165 k\u00F3dovanie.
2029=Po\u010Das spracovania dokumentu metad\u00E1t kolekcie sa vyskytla v\u00FDnimka IOException.
2030=Neplatn\u00E1 hodnota pre "{0}" v metad\u00E1tach kolekcie.
2031=Metad\u00E1ta kolekcie musia by\u0165 objektom JSON.
2032=K\u013E\u00FA\u010D objektu "{0}" sa neo\u010Dak\u00E1va v metad\u00E1tach kolekcie.
2033=Kolekcia nie je nakonfigurovan\u00E1 s k\u013E\u00FA\u010Dmi priraden\u00FDmi klientom, ale vstupn\u00FD dokument m\u00E1 k\u013E\u00FA\u010D.
2034=Kolekcia nie je nakonfigurovan\u00E1 s k\u013E\u00FA\u010Dom priraden\u00FDm klientom, ale iter\u00E1tor {0} vr\u00E1til dokument s k\u013E\u00FA\u010Dom po vr\u00E1ten\u00ED {1} dokumentov.
2035=Met\u00F3da getCurrentSchema() vyvolan\u00E1 pre zadan\u00E9 pripojenie JDBC vr\u00E1tila hodnotu null.
2036=Neplatn\u00E1 \u0161pecifik\u00E1cia projekcie.
2037=Hodnota {0} nie je platn\u00FD k\u013E\u00FA\u010D typu {1}.
2038=Po\u017Eiadavka indexu m\u00E1 v\u00E4\u010D\u0161\u00ED po\u010Det st\u013Apcov ako {0}.
2039=Nie je mo\u017En\u00E9 vytvori\u0165 index pre \u0161ifrovan\u00FD obsah. Indexovanie je povolen\u00E9, len ak je \u0161ifrovanie st\u013Apca obsahu nastaven\u00E9 na NONE.
2040=next() nie je mo\u017En\u00E9 vola\u0165 na uzavretom kurzore.
2041=Chyba pri pokuse o zru\u0161enie kolekcie. Skontrolujte, \u010Di s\u00FA potvrden\u00E9 v\u0161etky nevybaven\u00E9 z\u00E1pisy do kolekcie.
2042=Na spustenie transakcie sa pre t\u00FAto oper\u00E1ciu vy\u017Eaduje SODA, ale vyskytla sa chyba deaktiv\u00E1cie automatick\u00E9ho potvrdzovania pripojenia JDBC.
2043=Dokument \u0161pecifik\u00E1cie {0} nem\u00E1 \u017Eiadny obsah alebo je pr\u00E1zdny.
2045=\u0160pecifik\u00E1cia projekcie by nemala obsahova\u0165 kombin\u00E1ciu pravidiel zahrnutia a vyl\u00FA\u010Denia.
2046=Cesta pre podmienku indexu alebo zoradenia by nemala obsahova\u0165 kroky po\u013Ea.
2047=Pripojenie mus\u00ED by\u0165 OracleConnection alebo wrapper pre OracleConnection.
2048=Parameter Jazyk nie je podporovan\u00FD v textovom indexe datab\u00E1zy Oracle 12.1.0.2.
2049=Predvolen\u00FD re\u017Eim funk\u010Dn\u00E9ho indexu pou\u017E\u00EDva podporovan\u00FA klauzulu json_value "null on empty", ktor\u00E1 za\u010D\u00EDna vydan\u00EDm datab\u00E1zy Oracle 12.2.0.1. Re\u017Eimy "scalarRequired" a "lax" s\u00FA podporovan\u00E9 vo vydan\u00ED 12.1.0.2. Pozn\u00E1mka: indexy "lax" sa nepou\u017E\u00EDvaj\u00FA v QBEs, preto sa "scalarRequired" neodpor\u00FA\u010Da.
2050="{0}" nemo\u017Eno zada\u0165 pre textov\u00FD index datab\u00E1zy Oracle 12.1.0.2.
2051=Oper\u00E1cia "{0}" vy\u017Eaduje spr\u00E1vu transakci\u00ED, ke\u010F je pripojenie v re\u017Eime automatick\u00E9ho potvrdenia, ale pr\u00EDznak "avoidTxnManagement" je nastaven\u00FD na hodnotu true pre in\u0161tanciu OracleDatabase. Ak chcete t\u00FAto oper\u00E1ciu vykona\u0165, deaktivujte re\u017Eim automatick\u00E9ho potvrdenia.
2052=keyLike() je mo\u017En\u00E9 zada\u0165 len pre kolekciu s klientom priraden\u00FDmi k\u013E\u00FA\u010Dmi a s typom st\u013Apca k\u013E\u00FA\u010Da varchar2.
2053=Index so zadan\u00FDm n\u00E1zvom u\u017E v sch\u00E9me existuje.
2054=vynecha\u0165, inak nemo\u017Eno nastavi\u0165 limit pre oper\u00E1ciu po\u010D\u00EDtania.
2055=Parameter textIndex121WithLang nastaven\u00FD na hodnotu true nie je podporovan\u00FD vo vydaniach datab\u00E1zy vy\u0161\u0161\u00EDch ako 12.2.
2056=\u0160pecifik\u00E1cia projekcie by nemala obsahova\u0165 kroky po\u013Ea.
2057=Cesty v \u0161pecifik\u00E1cii projekcie nem\u00F4\u017Eu zdie\u013Ea\u0165 spolo\u010Dn\u00FD prefix.
2058=Met\u00F3du {0} nie je mo\u017En\u00E9 zada\u0165 spolu s met\u00F3dou {1}.
2059=Pri konverzii obsahu JSON vstupn\u00E9ho dokumentu na bin\u00E1rny sa vyskytla chyba. Skontrolujte, \u010Di obsah vstupn\u00E9ho dokumentu je platn\u00FDm obsahom JSON.
2060=Pri konverzii bin\u00E1rneho obsahu JSON na textov\u00FD obsah JSON sa vyskytla chyba.
2061=Cesta zadan\u00E1 pre k\u013E\u00FA\u010D dokumentu je neplatn\u00E1.
2062=Cestu sa nepodarilo extrahova\u0165 z dokumentu.
2063=Cestu sa nepodarilo vlo\u017Ei\u0165 do dokumentu.
2064=Overenie by sa nemalo zad\u00E1va\u0165, ke\u010F contentColumn.sqlType je JSON.
2065=Nepodporovan\u00FD typ: {0}
2066=Pom\u00F4cka {0} nie je typu Re\u0165azec alebo obsahuje /* or */.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=Kolekcia {0} nem\u00F4\u017Ee ma\u0165 bin\u00E1rny obsah v type st\u013Apca {1}.
2501=Kolekcia {0} pou\u017E\u00EDva vytv\u00E1ranie verzi\u00ED {1}, z\u00E1pisy vysielania toku d\u00E1t nie s\u00FA povolen\u00E9.
2502=Ulo\u017Eenie dokumentu do kolekcie {0} zlyhalo.
2503=Vlo\u017Eenie dokumentu do kolekcie {0} zlyhalo.
2504=K\u013E\u00FA\u010D UUID sa ned\u00E1 vygenerova\u0165.
2505=Dokument s k\u013E\u00FA\u010Dom {0} m\u00E1 ve\u013Ekos\u0165 {1}, ktor\u00E1 prekra\u010Duje limit 2 GB.
2506=Priradenie k\u013E\u00FA\u010Da IDENTITY vy\u017Eaduje podporu klauzuly RETURNING v SQL.
2507=Chyba pri z\u00EDskavan\u00ED verzie datab\u00E1zy.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Skr\u00E1tenie nie je podporovan\u00E9, kolekcia {0} nie je zalo\u017Een\u00E1 na tabu\u013Eke.
3001=Index vyh\u013Ead\u00E1vania JSON nie je implementovan\u00FD pre st\u013Apce obsahu s typom {0}.
3002=Index vyh\u013Ead\u00E1vania JSON nie je implementovan\u00FD pre kolekcie s k\u013E\u00FA\u010Dmi NVARCHAR2.
3003=Java Virtual Machine (JVM) nepodporuje algoritmus vytv\u00E1rania verzi\u00ED MD5. Prepnite na in\u00FD algoritmus vytv\u00E1rania verzi\u00ED.
3004=Java Virtual Machine (JVM) nepodporuje algoritmus vytv\u00E1rania verzi\u00ED SHA256. Prepnite na in\u00FD algoritmus vytv\u00E1rania verzi\u00ED.
3005=Funkcia nie je implementovan\u00E1.
3006=Priestorov\u00E9 indexovanie JSON nie je podporovan\u00E9 pre heterog\u00E9nne kolekcie.
3007=Indexovanie vyh\u013Ead\u00E1vania JSON nie je podporovan\u00E9 pre heterog\u00E9nne kolekcie.
3008=Funk\u010Dn\u00E9 indexovanie JSON nie je podporovan\u00E9 pre heterog\u00E9nne kolekcie.
3009=Dopyt pod\u013Ea pr\u00EDkladu (QBE) nie je podporovan\u00FD pre heterog\u00E9nne kolekcie.
