#
# Copyright (c) 2014, 2020, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=O conjunto {0} \u00E9 somente para leitura; {1} n\u00E3o \u00E9 permitido.
2001=O conjunto {0} n\u00E3o tem time stamp indicando quando foi modificado pela \u00FAltima vez.
2002=Condi\u00E7\u00E3o de filtro inv\u00E1lida.
2003=O descritor n\u00E3o corresponde ao conjunto existente.
2004=O argumento {0} n\u00E3o pode ser nulo.
2005=O conjunto {0} est\u00E1 vazio.
2006=Os argumentos ''since'' e ''until'' n\u00E3o podem ser nulos ao mesmo tempo.
2007=O conjunto {0} n\u00E3o tem vers\u00E3o.
2008=O argumento {0} deve ser positivo.
2009=O n\u00FAmero total de chaves especificadas usando os m\u00E9todos key(), keys() ou filter() \u00E9 {0}, o que excede o limite m\u00E1ximo de {1}.
2010=O iterador {0} retornou um valor nulo, ap\u00F3s retornar {1} documentos.
2011=valor "{0}" de argumento inv\u00E1lido.
2012=N\u00E3o \u00E9 poss\u00EDvel definir um tamanho m\u00E1ximo para tipos de LOB ou para o tipo de JSON.
2013=N\u00E3o \u00E9 poss\u00EDvel usar as defini\u00E7\u00F5es de LOB SecureFile quando o tipo de coluna de conte\u00FAdo \u00E9 "{0}"
2014=O \u00EDndice de coluna modificado pela \u00FAltima vez s\u00F3 pode ser definido quando o nome de coluna modificado pela \u00FAltima vez \u00E9 definido.
2015=Se o m\u00E9todo de designa\u00E7\u00E3o for "SEQUENCE", ser\u00E1 necess\u00E1rio especificar um nome de sequ\u00EAncia de coluna.
2016=Um m\u00E9todo de vers\u00E3o foi especificado, mas o nome da coluna da vers\u00E3o n\u00E3o foi.
2017=O tipo de coluna de chave especificado n\u00E3o pode ser usado com um tamanho m\u00E1ximo.
2018=Ao usar GUID ou UUID para designar valores de chave de tipo de caractere, o tamanho da coluna de chaves de ter 32 bytes ou mais.
2019=O conjunto  n\u00E3o pode ter uma coluna de tipo de m\u00EDdia, a n\u00E3o ser que o tipo de coluna de conte\u00FAdo seja BLOB.
2020=O tipo de m\u00EDdia do documento n\u00E3o \u00E9 "application/json". A a\u00E7\u00E3o getContentAsString() s\u00F3 \u00E9 suportada para documentos JSON.
2021=O conjunto {0} cont\u00E9m valor nulo.
2022=A chave para que o documento seja substitu\u00EDdo deve ser especificada usando o m\u00E9todo key().
2023=O argumento {0} deve ser positivo.
2024=Especifica\u00E7\u00E3o inv\u00E1lida para cria\u00E7\u00E3o de \u00EDndice.
2025=Especifica\u00E7\u00E3o inv\u00E1lida para elimina\u00E7\u00E3o de \u00EDndice.
2026=O documento de metadados do conjunto n\u00E3o tem conte\u00FAdo ou ele est\u00E1 vazio.
2027=O documento de metadados do conjunto n\u00E3o \u00E9 um JSON v\u00E1lido.
2028=O documento de metadados do conjunto n\u00E3o \u00E9 um JSON v\u00E1lido. N\u00E3o foi poss\u00EDvel determinar a codifica\u00E7\u00E3o.
2029=Ocorreu uma IOException ao processar o documento de metadados do conjunto.
2030=Valor inv\u00E1lido para "{0}" nos metadados do conjunto.
2031=Os metadados do conjunto devem ser um objeto JSON.
2032=A chave de objeto "{0}" \u00E9 inesperada nos metadados do conjunto.
2033=O conjunto n\u00E3o est\u00E1 configurado com as chaves designadas pelo cliente, mas o documento de entrada tem uma chave.
2034=O conjunto n\u00E3o est\u00E1 configurado com a chave designada pelo cliente, mas o iterador {0} retornou um documento com uma chave, ap\u00F3s retornar {1} documentos.
2035=A a\u00E7\u00E3o getCurrentSchema() chamada na conex\u00E3o JDBC fornecida retornou um valor nulo.
2036=Especifica\u00E7\u00E3o de proje\u00E7\u00E3o inv\u00E1lida.
2037=O valor {0} n\u00E3o \u00E9 uma chave v\u00E1lida do tipo {1}.
2038=A solicita\u00E7\u00E3o de \u00EDndice tem mais de {0} colunas.
2039=N\u00E3o \u00E9 poss\u00EDvel criar o \u00EDndice no conte\u00FAdo criptografado. A indexa\u00E7\u00E3o s\u00F3 ser\u00E1 permitida se a criptografia da coluna de conte\u00FAdo estiver definida como NONE.
2040=next() n\u00E3o pode ser chamado em um cursor fechado.
2041=Erro ao tentar eliminar a cole\u00E7\u00E3o. Certifique-se de que todas as grava\u00E7\u00F5es pendentes na cole\u00E7\u00E3o sejam confirmadas.
2042=Esta opera\u00E7\u00E3o requer SODA para iniciar uma transa\u00E7\u00E3o, mas h\u00E1 um erro ao desativar a confirma\u00E7\u00E3o autom\u00E1tica da conex\u00E3o JDBC.
2043=O documento de especifica\u00E7\u00E3o {0} n\u00E3o tem conte\u00FAdo ou est\u00E1 vazio.
2045=A especifica\u00E7\u00E3o da proje\u00E7\u00E3o n\u00E3o deve conter uma combina\u00E7\u00E3o de regras de inclus\u00E3o e exclus\u00E3o.
2046=O caminho para uma condi\u00E7\u00E3o de \u00EDndice ou 'ordenar por' n\u00E3o deve conter etapas de array.
2047=A conex\u00E3o deve ser uma conex\u00E3o Oracle ou um encapsulador para uma conex\u00E3o Oracle.
2048=N\u00E3o h\u00E1 suporte para o par\u00E2metro de idioma com um \u00EDndice de texto do Oracle Database 12.1.0.2.
2049=O modo de \u00EDndice funcional padr\u00E3o conta com a cl\u00E1usula json_value "null on empty", para a qual h\u00E1 suporte a partir da release 12.2.0.1 do Oracle Database. H\u00E1 suporte para os modos "scalarRequired" e "lax" na vers\u00E3o 12.1.0.2. Observa\u00E7\u00E3o: os \u00EDndices "lax" n\u00E3o s\u00E3o usados por QBEs. Portanto, recomenda-se o uso de "scalarRequired".
2050="{0}" n\u00E3o pode ser especificado(a) para um \u00EDndice de texto do Oracle Database12.1.0.2.
2051=A opera\u00E7\u00E3o "{0}" requer gerenciamento de transa\u00E7\u00F5es quando a conex\u00E3o \u00E9 feita no modo de commit autom\u00E1tico, mas o flag "avoidTxnManagement"\u00E9 definido como verdadeiro na inst\u00E2ncia do Oracle Database. Desative o modo de commit autom\u00E1tico para executar a opera\u00E7\u00E3o.
2052=keyLike() s\u00F3 pode ser especificado para uma cole\u00E7\u00E3o com chaves designadas pelo cliente e um tipo de coluna de chaves varchar2.
2053=J\u00E1 existe no esquema um item com o nome especificado.
2054=uma opera\u00E7\u00E3o de contagem n\u00E3o pode ser ignorada nem ter um limite definido.
2055=N\u00E3o h\u00E1 suporte para definir o par\u00E2metro textIndex121WithLang como verdadeiro nas releases de banco de dados posteriores \u00E0 12.2.
2056=A especifica\u00E7\u00E3o de proje\u00E7\u00E3o n\u00E3o deve conter etapas de array.
2057=Em uma especifica\u00E7\u00E3o de proje\u00E7\u00E3o, os caminhos n\u00E3o podem compartilhar um prefixo comum.
2058=O m\u00E9todo {0} n\u00E3o pode ser especificado em conjunto com o m\u00E9todo {1}.
2059=Ocorreu um erro durante a convers\u00E3o do conte\u00FAdo JSON do documento de entrada para bin\u00E1rio. Certifique-se de que o conte\u00FAdo do documento de entrada seja JSON v\u00E1lido.
2060=Ocorreu um erro durante a convers\u00E3o do JSON bin\u00E1rio para JSON textual.
2061=O caminho especificado para a chave de documento \u00E9 inv\u00E1lido.
2062=N\u00E3o foi poss\u00EDvel extrair o caminho do documento.
2063=N\u00E3o foi poss\u00EDvel inserir o caminho no documento.
2064=A valida\u00E7\u00E3o n\u00E3o deve ser especificada quando contentColumn.sqlType \u00E9 JSON.
2065=Tipo n\u00E3o suportado: {0}
2066=A dica {0} n\u00E3o \u00E9 do tipo String ou cont\u00E9m /* ou */.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=O conjunto {0} n\u00E3o pode ter conte\u00FAdo bin\u00E1rio no tipo de coluna {1}.
2501=O conjunto {0} usa o controle de vers\u00E3o {1}; as grava\u00E7\u00F5es de streaming n\u00E3o s\u00E3o permitidas.
2502=Falha ao salvar o documento no conjunto {0}.
2503=Falha ao inserir o documento no conjunto {0}.
2504=N\u00E3o \u00E9 poss\u00EDvel gerar a chave baseada no UUID.
2505=O documento com a chave {0} tem o tamanho {1}, que excede o limite de 2GB.
2506=A designa\u00E7\u00E3o de chave IDENTITY exige suporte RETURNING na SQL.
2507=Erro ao obter a vers\u00E3o do banco de dados.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Truncamento n\u00E3o suportado. O conjunto {0} n\u00E3o \u00E9 baseado em tabela.
3001=O \u00EDndice de pesquisa JSON n\u00E3o \u00E9 implementado para colunas de conte\u00FAdo com o tipo {0}.
3002=O \u00EDndice de pesquisa JSON n\u00E3o \u00E9 implementado para conjuntos com chaves NVARCHAR2.
3003=A JVM (Java Virtual Machine) n\u00E3o suporta o algoritmo de vers\u00E3o MD5. Alterne para outro algoritmo de vers\u00E3o.
3004=A JVM (Java Virtual Machine) n\u00E3o suporta o algoritmo de vers\u00E3o SHA256. Alterne para outro algoritmo de vers\u00E3o.
3005=Funcionalidade n\u00E3o implementada.
3006=A indexa\u00E7\u00E3o espacial JSON n\u00E3o \u00E9 suportada em conjuntos heterog\u00EAneos.
3007=A indexa\u00E7\u00E3o de pesquisa JSON n\u00E3o \u00E9 suportada em conjuntos heterog\u00EAneos.
3008=A indexa\u00E7\u00E3o funcional JSON n\u00E3o \u00E9 suportada em conjuntos heterog\u00EAneos.
3009=O QBE (Query-by-example) n\u00E3o \u00E9 suportado em conjuntos heterog\u00EAneos.
