#
# Copyright (c) 2014, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Colec\u0163ia {0} este read-only; nu se permite {1}.
2001=Colec\u0163ia {0} nu are niciun marcaj temporal ce indic\u0103 data ultimei modific\u0103ri.
2002=Condi\u0163ie de filtrare nevalid\u0103.
2003=Descriptorul nu corespunde cu colec\u0163ia existent\u0103.
2004=Argumentul {0} nu poate fi nul.
2005=Setul {0} este gol.
2006=Argumentele ''since'' \u015Fi ''until'' nu pot fi ambele nule.
2007=Colec\u0163ia {0} nu are nicio versiune.
2008=Argumentul {0} trebuie s\u0103 fie pozitiv.
2009=Nr. total de chei specificat utiliz\u00E2nd metodele key(), keys() sau filter() este {0}, care dep\u0103\u015Fe\u015Fte limita maxim\u0103, de {1}.
2010=Iteratorul {0} a returnat o valoare nul\u0103 dup\u0103 returnarea a {1} documente.
2011=Valoare nevalid\u0103 argument, "{0}".
2012=Nu poate fi setat\u0103 o lungime maxim\u0103 pt. tipurile LOB.
2013=Set\u0103rile LOB SecureFile nu pot fi utilizate c\u00E2nd tipul coloanei de con\u0163inut este "{0}"
2014=Indexarea coloanei last-modified poate fi setat\u0103 doar c\u00E2nd este setat numele coloanei last-modified.
2015=Dac\u0103 metoda de asignare este "SEQUENCE", trebuie specificat un nume pt. secven\u0163a de coloane de chei.
2016=A fost specificat\u0103 o metod\u0103 version, dar nu este specificat numele coloanei version.
2017=Tipul specificat de coloan\u0103 de chei nu poate fi utilizat cu o lungime maxim\u0103.
2018=La utilizarea GUID sau UUID pt. asignarea valorilor cheilor pt. tipurile de caractere, lungimea coloanei de chei trebuie s\u0103 aib\u0103 minim 32 bytes.
2019=Colec\u0163ia nu poate avea o coloan\u0103 pt. tipul de media dec\u00E2t dac\u0103 tipul de coloan\u0103 de con\u0163inut este BLOB.
2020=Tipul de media al documentului nu este "application/json". getContentAsString() este acceptat\u0103 doar pt. documente JSON.
2021=Setul {0} con\u0163ine o valoare nul\u0103.
2022=Cheia pt. documentul de \u00EEnlocuit trebuie specificat\u0103 utiliz\u00E2nd metoda key().
2023=Argumentul {0} nu trebuie s\u0103 fie negativ.
2024=Specifica\u0163i nevalid\u0103 de creare a index\u0103rii.
2025=Specifica\u0163i nevalid\u0103 de abandonare a index\u0103rii.
2026=Documentul de metadate ale colec\u0163iei nu are con\u0163inut sau are con\u0163inut gol.
2027=Documentul de metadate ale colec\u0163iei nu este un document JSON valid.
2028=Documentul de metadate ale colec\u0163iei nu este un document JSON valid; nu a putut fi stabilit\u0103 codificarea.
2029=A survenit IOException la procesarea documentului de metadate ale colec\u0163iei.
2030=Valoare nevalid\u0103 pt. "{0}" \u00EEn metadatele colec\u0163iei.
2031=Metadatele colec\u0163iei trebuie s\u0103 fie un obiect JSON.
2032=Nu se a\u015Ftepta cheia de obiect "{0}" \u00EEn metadatele colec\u0163iei.
2033=Colec\u0163ia nu este configurat\u0103 cu chei asignate de client, dar documentul de intrare are o cheie.
2034=Colec\u0163ia nu este configurat\u0103 cu cheie asignat\u0103 de client, dar iteratorul {0} a returnat un document cu o cheie dup\u0103 returnarea a {1} documente.
2035=getCurrentSchema() invocat\u0103 \u00EEn conexiunea JDBC specificat\u0103 a returnat o valoare nul\u0103.
2036=Specifica\u0163ie de proiec\u0163ie nevalid\u0103.
2037=Valoarea {0} nu este o cheie valid\u0103 de tip {1}.
2038=Cererea de indexare are peste {0} coloane.
2039=Indexarea nu a putut fi creat\u0103 pt. con\u0163inutul criptat. Indexarea este permis\u0103 doar c\u00E2nd criptarea coloanei de con\u0163inut este setat\u0103 la NONE.

#
# Internal errors  (2500 to 2999 error code range)
#
2500=Colec\u0163ia {0} nu poate avea con\u0163inut binar \u00EEn tipul de coloan\u0103 {1}.
2501=Colec\u0163ia {0} utilizeaz\u0103 crearea de versiuni {1}; transmiterea \u00EEn flux a scrierilor nu este permis\u0103.
2502=Salvarea documentului \u00EEn colec\u0163ia {0} a e\u015Fuat.
2503=Inserarea documentului \u00EEn colec\u0163ia {0} a e\u015Fuat.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Trunchierea nu este acceptat\u0103; colec\u0163ia {0} nu este bazat\u0103 pe tabel.
3001=indexAll nu este implementat\u0103 pt. coloanele de con\u0163inut cu tipul {0}.
3002=indexAll nu este implementat\u0103 pt. colec\u0163iile cu chei NVARCHAR2.
