#
# Copyright (c) 2014, 2018, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Collection {0} ist schreibgesch\u00FCtzt, {1} nicht zul\u00E4ssig.
2001=Collection {0} enth\u00E4lt keinen Zeitstempel mit Angabe der letzten \u00C4nderung.
2002=Ung\u00FCltige Filterbedingung.
2003=Deskriptor stimmt nicht mit vorhandener Collection \u00FCberein.
2004=Argument {0} darf nicht Null sein.
2005={0}-Set ist leer.
2006=Argumente ''since'' und ''until'' d\u00FCrfen nicht beide Null sein.
2007=Collection {0} hat keine Version.
2008=Argument {0} muss positiv sein.
2009=Die Gesamtanzahl von Schl\u00FCsseln, die mit key()-, keys()- oder filter()-Methoden angegeben wird, ist {0}; dies \u00FCberschreitet den maximalen Grenzwert von {1}.
2010={0} Iterator hat Null zur\u00FCckgegeben, nachdem {1} Dokumente zur\u00FCckgegeben wurden.
2011=Ung\u00FCltiger Argumentwert "{0}".
2012=F\u00FCr LOB-Typen kann keine maximale L\u00E4nge festgelegt werden.
2013=SecureFile-LOB-Einstellungen k\u00F6nnen nicht verwendet werden, wenn die Inhaltsspalte "{0}" ist
2014=Der zuletzt ge\u00E4nderte Spaltenindex kann nur festgelegt werden, wenn der zuletzt angegebene Spaltenname festgelegt ist.
2015=Wenn die Zuweisungsmethode "SEQUENCE" ist, muss ein Schl\u00FCsselspaltensequenzname angegeben werden.
2016=Eine Versionsmethode wurde angegeben, der Versionsspaltenname jedoch nicht.
2017=Der angegebene Spaltentyp kann nicht mit einer Maximall\u00E4nge verwendet werden.
2018=Bei der Verwendung von GUID oder UUID zur Zuweisung von Zeichentypschl\u00FCsselwerten muss die Schl\u00FCsselspaltenl\u00E4nge 32 Byte oder h\u00F6her sein.
2019=Die Collection darf keine Mediatypspalte enthalten, es sei denn, der Inhaltsspaltentyp ist BLOB.
2020=Mediatyp des Dokuments ist nicht "application/json". Nur getContentAsString() wird f\u00FCr JSON-Dokumente unterst\u00FCtzt.
2021={0}-Set enth\u00E4lt Null.
2022=Der Schl\u00FCssel f\u00FCr das zu ersetzende Dokument muss mit der key()-Methode angegeben werden.
2023=Argument {0} darf nicht negativ sein.
2024=Ung\u00FCltige Spezifikation zum Erstellen von Index.
2025=Ung\u00FCltige Spezifikation zum L\u00F6schen von Index.
2026=Collection-Metadatendokument hat keinen Inhalt oder der Inhalt ist leer.
2027=Collection-Metadatendokument ist kein g\u00FCltiges JSON-Dokument.
2028=Collection-Metadatendokument ist kein g\u00FCltiges JSON-Dokument, Codierung konnte nicht bestimmt werden.
2029=IOException bei der Verarbeitung von Collection-Metadatendokument.
2030=Ung\u00FCltiger Wert f\u00FCr "{0}" in den Collection-Metadaten.
2031=Die Collection-Metadaten m\u00FCssen ein JSON-Objekt sein.
2032=Der Objektschl\u00FCssel "{0}" ist in den Collection-Metadaten unerwartet
2033=Die Collection ist nicht mit vom Client zugewiesenen Schl\u00FCsseln konfiguriert, das Eingabedokument enth\u00E4lt jedoch einen Schl\u00FCssel.
2034=Die Collection ist nicht mit vom Client zugewiesenen Schl\u00FCsseln konfiguriert, {0} Iterator hat jedoch ein Dokument mit einem Schl\u00FCssel zur\u00FCckgegeben, nachdem {1} Dokumente zur\u00FCckgegeben wurden.
2035=getCurrentSchema(), die auf der angegebenen JDBC-Verbindung aufgerufen wurde, hat Null zur\u00FCckgegeben.
2036=Ung\u00FCltige Projizierungsspezifikation.
2037=Der Wert {0} ist kein g\u00FCltiger Schl\u00FCssel vom Typ {1}.
2038=Indexanforderung hat mehr als {0} Spalten. 
2039=Index kann auf verschl\u00FCsseltem Inhalt nicht erstellt werden. Die Indexierung ist nur zul\u00E4ssig, wenn die Verschl\u00FCsselung der Inhaltsspalte auf NONE gesetzt ist.
2040=next() kann bei einem geschlossenen Cursor nicht aufgerufen werden.
2041=Fehler beim Versuch, die Collection zu l\u00F6schen. Stellen Sie sicher, dass alle ausstehenden Schreibvorg\u00E4nge in die Collection festgeschrieben wurden.
2042=F\u00FCr diesen Vorgang muss SODA eine Transaktion starten. Es liegt jedoch ein Fehler vor, der das automatische Festschreiben f\u00FCr die JDBC-Verbindung deaktiviert.
2043={0}-Spezifikationsdokument hat keinen Inhalt oder ist leer.
2045=Projektionsspezifikation darf keine Mischung aus Include- und Exclude-Regeln enthalten.
2046=Pfad f\u00FCr eine index- oder order by-Bedingung darf keine Arrayschritte enthalten.
2047=Verbindung muss eine OracleConnection oder ein Wrapper f\u00FCr eine OracleConnection sein.
2048=Sprachparameter wird nicht mit einem Textindex in Oracle Database 12.1.0.2 unterst\u00FCtzt.
2049=Der standardm\u00E4\u00DFige, funktionale Indexmodus ist von der json_value "null on empty"-Klausel abh\u00E4ngig, die ab Oracle Database Release 12.2.0.1 unterst\u00FCtzt wird. Die Modi "scalarRequired" und "lax" werden in 12.1.0.2 unterst\u00FCtzt. Hinweis: "lax"-Indizes werden nicht von QBEs verwendet, weshalb "scalarRequired" empfohlen wird.
2050="{0}" kann nicht f\u00FCr einenTextindex in Oracle Database 12.1.0.2 angegeben werden.
2051=Der Vorgang "{0}" erfordert Transaktionsmanagement, wenn sich die Verbindung im Auto-Commit-Modus befindet, aber "avoidTxnManagement" in der OracleDatabase-Instanz auf "true" gesetzt ist. Deaktivieren Sie den Auto-Commit-Modus, um den Vorgang auszuf\u00FChren.
2052=keyLike() kann nur f\u00FCr eine Collection mit vom Client zugewiesenen Schl\u00FCsseln und dem Schl\u00FCsselspaltentyp varchar2 angegeben werden.
2053=Es ist bereits ein Index mit dem angegebenen Namen im Schema vorhanden.
2054=\u00DCberspringen oder Begrenzen kann f\u00FCr einen Z\u00E4hlvorgang nicht festgelegt werden.
2055=Die Festlegung des textIndex121WithLang-Parameters auf "true" wird bei Datenbank-Releases ab 12.2 nicht unterst\u00FCtzt.
2056=Projektionsspezifikation darf keine Arrayschritte enthalten.
2057=In einer Projektionsspezifikation d\u00FCrfen Pfade kein gemeinsames Pr\u00E4fix haben.

#
# Internal errors  (2500 to 2999 error code range)
#
2500=Collection {0} kann keinen bin\u00E4ren Inhalt in Spaltentyp {1} enthalten.
2501=Collection {0} verwendet {1}-Versionierung, Streaming von Schreibzugriffen ist nicht zul\u00E4ssig.
2502=Speichern von Dokument in Collection {0} war nicht erfolgreich.
2503=Einf\u00FCgen von Dokument in Collection {0} war nicht erfolgreich.
2504=UUID-basierter Schl\u00FCssel kann nicht generiert werden.
2505=Dokument mit Schl\u00FCssel {0} hat Gr\u00F6\u00DFe {1}, die den Grenzwert von 2 GB \u00FCberschreitet.
2506=IDENTITY-Schl\u00FCsselzuweisung erfordert RETURNING-Unterst\u00FCtzung in SQL.
2507=Fehler beim Abrufen der Datenbankversion.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Abschneiden wird nicht unterst\u00FCtzt, Collection {0} ist nicht tabellenbasiert.
3001=JSON-Suchindex ist f\u00FCr Inhaltsspalten mit Typ {0} nicht implementiert.
3002=JSON-Suchindex ist f\u00FCr Collections mit NVARCHAR2-Schl\u00FCsseln nicht implementiert.
3003=Java Virtual Machine (JVM) unterst\u00FCtzt den Versionierungsalgorithmus MD5 nicht. Wechseln Sie zu einem anderen Versionierungsalgorithmus.
3004=Java Virtual Machine (JVM) unterst\u00FCtzt den Versionierungsalgorithmus SHA256 nicht. Wechseln Sie zu einem anderen Versionierungsalgorithmus.
3005=Feature ist nicht implementiert.
3006=R\u00E4umliche JSON-Indexierung wird bei heterogenen Collections nicht unterst\u00FCtzt.
3007=JSON-Suchindexierung wird bei heterogenen Collections nicht unterst\u00FCtzt.
3008=JSON-Funktionsindexierung wird bei heterogenen Collections nicht unterst\u00FCtzt.
3009=Abfrage nach Beispiel (QBE) wird bei heterogenen Collections nicht unterst\u00FCtzt.
