#
# Copyright (c) 2014, 2016, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=\u05D4\u05D0\u05D5\u05E1\u05E3 {0} \u05D4\u05D5\u05D0 \u05DC\u05E7\u05E8\u05D9\u05D0\u05D4 \u05D1\u05DC\u05D1\u05D3, {1} \u05D0\u05E1\u05D5\u05E8.
2001=\u05DC\u05D0\u05D5\u05E1\u05E3 {0} \u05D0\u05D9\u05DF \u05D7\u05D5\u05EA\u05DE\u05EA \u05D6\u05DE\u05DF \u05D4\u05DE\u05E2\u05D9\u05D3\u05D4 \u05E2\u05DC \u05EA\u05D0\u05E8\u05D9\u05DA \u05D4\u05E9\u05D9\u05E0\u05D5\u05D9 \u05D4\u05D0\u05D7\u05E8\u05D5\u05DF.
2002=\u05EA\u05E0\u05D0\u05D9 \u05DE\u05E1\u05E0\u05DF \u05DC\u05D0 \u05EA\u05E7\u05E3.
2003=\u05D4\u05EA\u05D9\u05D0\u05D5\u05E8 \u05DC\u05D0 \u05EA\u05D5\u05D0\u05DD \u05DC\u05D0\u05D5\u05E1\u05E3 \u05D4\u05E7\u05D9\u05D9\u05DD.
2004=\u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8 {0} \u05DC\u05D0 \u05D9\u05DB\u05D5\u05DC \u05DC\u05D4\u05D9\u05D5\u05EA null.
2005=\u05E7\u05D1\u05D5\u05E6\u05EA {0} \u05E8\u05D9\u05E7\u05D4.
2006=\u05D4\u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8\u05D9\u05DD ''since'' \u05D5-''until'' \u05DC\u05D0 \u05D9\u05DB\u05D5\u05DC\u05D9\u05DD \u05E9\u05E0\u05D9\u05D4\u05DD \u05DC\u05D4\u05D9\u05D5\u05EA null.
2007=\u05DC\u05D0\u05D5\u05E1\u05E3 {0} \u05D0\u05D9\u05DF \u05D2\u05E8\u05E1\u05D4.
2008=\u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8 {0} \u05D7\u05D9\u05D9\u05D1 \u05DC\u05D4\u05D9\u05D5\u05EA \u05D7\u05D9\u05D5\u05D1\u05D9.
2009=\u05D4\u05DE\u05E1\u05E4\u05E8 \u05D4\u05DB\u05D5\u05DC\u05DC \u05E9\u05DC \u05D4\u05DE\u05E4\u05EA\u05D7\u05D5\u05EA \u05D4\u05DE\u05E9\u05EA\u05DE\u05E9\u05D9\u05DD \u05D1\u05E9\u05D9\u05D8\u05D5\u05EA key(), keys() \u05D0\u05D5 filter() \u05D4\u05D5\u05D0 {0}, \u05E9\u05D7\u05D5\u05E8\u05D2 \u05DE\u05D4\u05D2\u05D1\u05D5\u05DC \u05D4\u05DE\u05E8\u05D1\u05D9 {1}.
2010=\u05D4\u05D0\u05D9\u05D8\u05E8\u05D8\u05D5\u05E8 {0} \u05D4\u05D7\u05D6\u05D9\u05E8 null, \u05DC\u05D0\u05D7\u05E8 \u05D4\u05D7\u05D6\u05E8\u05EA {1} \u05DE\u05E1\u05DE\u05DB\u05D9\u05DD.
2011=\u05E2\u05E8\u05DA \u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8 \u05DC\u05D0 \u05EA\u05E7\u05E3 "{0}".
2012=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05D2\u05D3\u05D9\u05E8 \u05D0\u05D5\u05E8\u05DA \u05DE\u05E8\u05D1\u05D9 \u05DC\u05E1\u05D5\u05D2\u05D9 LOB.
2013=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05E9\u05EA\u05DE\u05E9 \u05D1\u05D4\u05D2\u05D3\u05E8\u05D5\u05EA SecureFile LOB \u05DB\u05D0\u05E9\u05E8 \u05E1\u05D5\u05D2 \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05EA\u05D5\u05DB\u05DF \u05D4\u05D5\u05D0 "{0}"
2014=\u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05D2\u05D3\u05D9\u05E8 \u05D0\u05EA \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D4\u05E2\u05DE\u05D5\u05D3\u05D4 \u05D4\u05D0\u05D7\u05E8\u05D5\u05DF \u05E9\u05E2\u05D5\u05D3\u05DB\u05DF \u05E8\u05E7 \u05DB\u05D0\u05E9\u05E8 \u05DE\u05D2\u05D3\u05D9\u05E8\u05D9\u05DD \u05D0\u05EA \u05E9\u05DD \u05D4\u05E2\u05DE\u05D5\u05D3\u05D4 \u05D4\u05D0\u05D7\u05E8\u05D5\u05DF \u05E9\u05E2\u05D5\u05D3\u05DB\u05DF.
2015=\u05D0\u05DD \u05E9\u05D9\u05D8\u05EA \u05D4\u05D4\u05E7\u05E6\u05D0\u05D4 \u05D4\u05D9\u05D0 "SEQUENCE", \u05D9\u05E9 \u05DC\u05E6\u05D9\u05D9\u05DF \u05E9\u05DD \u05E8\u05E6\u05E3 \u05E2\u05DE\u05D5\u05D3\u05D5\u05EA \u05DE\u05E4\u05EA\u05D7.
2016=\u05E9\u05D9\u05D8\u05EA \u05D4\u05D2\u05E8\u05E1\u05D4 \u05E6\u05D5\u05D9\u05E0\u05D4 \u05D0\u05D1\u05DC \u05E9\u05DD \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05D2\u05E8\u05E1\u05D4 \u05DC\u05D0 \u05E6\u05D5\u05D9\u05DF.
2017=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05E9\u05EA\u05DE\u05E9 \u05D1\u05E1\u05D5\u05D2 \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05DE\u05E4\u05EA\u05D7 \u05E9\u05E6\u05D5\u05D9\u05DF \u05E2\u05DD \u05D0\u05D5\u05E8\u05DA \u05DE\u05E8\u05D1\u05D9.
2018=\u05DB\u05D0\u05E9\u05E8 \u05DE\u05E9\u05EA\u05DE\u05E9\u05D9\u05DD \u05D1-GUID \u05D0\u05D5 \u05D1-UUID \u05DB\u05D3\u05D9 \u05DC\u05D4\u05E7\u05E6\u05D5\u05EA \u05E2\u05E8\u05DB\u05D9 \u05DE\u05E4\u05EA\u05D7 \u05DC\u05E1\u05D5\u05D2 \u05EA\u05D5, \u05D0\u05D5\u05E8\u05DA \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05DE\u05E4\u05EA\u05D7 \u05D7\u05D9\u05D9\u05D1 \u05DC\u05D4\u05D9\u05D5\u05EA 32 \u05D1\u05D9\u05D9\u05D8\u05D9\u05DD \u05D5\u05DE\u05E2\u05DC\u05D4.
2019=\u05DC\u05D0\u05D5\u05E1\u05E3 \u05DC\u05D0 \u05D9\u05DB\u05D5\u05DC\u05D4 \u05DC\u05D4\u05D9\u05D5\u05EA \u05E2\u05DE\u05D5\u05D3\u05EA \u05E1\u05D5\u05D2 \u05DE\u05D3\u05D9\u05D4 \u05D0\u05DC\u05D0 \u05D0\u05DD \u05DB\u05DF \u05E1\u05D5\u05D2 \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05EA\u05D5\u05DB\u05DF \u05D4\u05D5\u05D0 BLOB.
2020=\u05E1\u05D5\u05D2 \u05D4\u05DE\u05D3\u05D9\u05D4 \u05E9\u05DC \u05D4\u05DE\u05E1\u05DE\u05DA \u05D0\u05D9\u05E0\u05D5 "application/json". getContentAsString() \u05E0\u05EA\u05DE\u05DA \u05E8\u05E7 \u05DC\u05DE\u05E1\u05DE\u05DB\u05D9 JSON.
2021=\u05E7\u05D1\u05D5\u05E6\u05EA {0} \u05DB\u05D5\u05DC\u05DC\u05EA null.
2022=\u05D9\u05E9 \u05DC\u05E6\u05D9\u05D9\u05DF \u05D0\u05EA \u05D4\u05DE\u05E4\u05EA\u05D7 \u05DC\u05DE\u05E1\u05DE\u05DA \u05DC\u05D4\u05D7\u05DC\u05E4\u05D4 \u05D1\u05D0\u05DE\u05E6\u05E2\u05D5\u05EA \u05D4\u05E9\u05D9\u05D8\u05D4 key().
2023=\u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8 {0} \u05D0\u05D9\u05E0\u05D5 \u05D9\u05DB\u05D5\u05DC \u05DC\u05D4\u05D9\u05D5\u05EA \u05E9\u05DC\u05D9\u05DC\u05D9.
2024=\u05DE\u05E4\u05E8\u05D8 \u05D9\u05E6\u05D9\u05E8\u05EA \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05DC\u05D0 \u05EA\u05E7\u05E3.
2025=\u05DE\u05E4\u05E8\u05D8 \u05DE\u05D7\u05D9\u05E7\u05EA \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05DC\u05D0 \u05EA\u05E7\u05E3.
2026=\u05DC\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05DF \u05EA\u05D5\u05DB\u05DF \u05D0\u05D5 \u05E9\u05D4\u05EA\u05D5\u05DB\u05DF \u05E9\u05DC\u05D5 \u05E8\u05D9\u05E7.
2027=\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05E0\u05D5 JSON \u05EA\u05E7\u05E3.
2028=\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05E0\u05D5 JSON \u05EA\u05E7\u05E3, \u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E7\u05D5\u05D1\u05E2 \u05DE\u05D4\u05D5 \u05D4\u05E7\u05D9\u05D3\u05D5\u05D3.
2029=\u05D0\u05D9\u05E8\u05E2 IOException \u05D1\u05E2\u05EA \u05E2\u05D9\u05D1\u05D5\u05D3 \u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3.
2030=\u05E2\u05E8\u05DA \u05DC\u05D0 \u05EA\u05E7\u05E3 \u05DC-"{0}" \u05D1\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3.
2031=\u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3 \u05D7\u05D9\u05D9\u05D1 \u05DC\u05D4\u05D9\u05D5\u05EA \u05D0\u05D5\u05D1\u05D9\u05D9\u05E7\u05D8 JSON.
2032=\u05DE\u05E4\u05EA\u05D7 \u05D4\u05D0\u05D5\u05D1\u05D9\u05D9\u05E7\u05D8 "{0}" \u05D0\u05D9\u05E0\u05D5 \u05E6\u05E4\u05D5\u05D9 \u05D1\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3.
2033=\u05D4\u05D0\u05D5\u05E1\u05E3 \u05DC\u05D0 \u05DE\u05D5\u05D2\u05D3\u05E8 \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7\u05D5\u05EA \u05DE\u05D5\u05E7\u05E6\u05D9\u05DD \u05DC\u05DC\u05E7\u05D5\u05D7, \u05D0\u05DA \u05DC\u05DE\u05E1\u05DE\u05DA \u05D4\u05E7\u05DC\u05D8 \u05D9\u05E9 \u05DE\u05E4\u05EA\u05D7.
2034=\u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05E0\u05D5 \u05DE\u05D5\u05D2\u05D3\u05E8 \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7 \u05DE\u05D5\u05E7\u05E6\u05D4 \u05DC\u05DC\u05E7\u05D5\u05D7, \u05D0\u05D1\u05DC \u05D4\u05D0\u05D9\u05D8\u05E8\u05D8\u05D5\u05E8 {0} \u05DE\u05D7\u05D6\u05D9\u05E8 \u05DE\u05E1\u05DE\u05DA \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7, \u05DC\u05D0\u05D7\u05E8 \u05D4\u05D7\u05D6\u05E8\u05EA {1} \u05DE\u05E1\u05DE\u05DB\u05D9\u05DD.
2035=getCurrentSchema() \u05E9\u05D4\u05D5\u05E4\u05E2\u05DC \u05D1\u05D7\u05D9\u05D1\u05D5\u05E8 JDBC \u05E9\u05E1\u05D5\u05E4\u05E7 \u05D4\u05D7\u05D6\u05D9\u05E8 null.
2036=\u05DE\u05E4\u05E8\u05D8 projection \u05DC\u05D0 \u05EA\u05E7\u05E3.
2037=\u05D4\u05E2\u05E8\u05DA {0} \u05D0\u05D9\u05E0\u05D5 \u05E1\u05D5\u05D2 \u05DE\u05E4\u05EA\u05D7 \u05EA\u05E7\u05E3 {1}.
2038=\u05D1\u05D1\u05E7\u05E9\u05EA \u05D4\u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D9\u05E9 \u05D9\u05D5\u05EA\u05E8 \u05DE-{0} \u05E2\u05DE\u05D5\u05D3\u05D5\u05EA.
2039=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D9\u05E6\u05D5\u05E8 \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D1\u05EA\u05D5\u05DB\u05DF \u05DE\u05D5\u05E6\u05E4\u05DF, \u05D4\u05DE\u05D9\u05E4\u05EA\u05D5\u05D7 \u05DE\u05D5\u05EA\u05E8 \u05E8\u05E7 \u05D0\u05DD \u05D4\u05E6\u05E4\u05E0\u05EA \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05EA\u05D5\u05DB\u05DF \u05DE\u05D5\u05D2\u05D3\u05E8 \u05DB-NONE.
2040=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E7\u05E8\u05D5\u05D0 \u05DC-next() \u05D1\u05E1\u05DE\u05DF \u05E1\u05D2\u05D5\u05E8.
2041=\u05D0\u05D9\u05E8\u05E2\u05D4 \u05E9\u05D2\u05D9\u05D0\u05D4 \u05D1\u05E2\u05EA \u05E0\u05D9\u05E1\u05D9\u05D5\u05DF \u05DC\u05E9\u05DE\u05D5\u05D8 \u05D0\u05EA \u05D4\u05D0\u05D5\u05E1\u05E3. \u05D5\u05D3\u05D0 \u05E9\u05DB\u05DC \u05D4\u05DB\u05EA\u05D9\u05D1\u05D5\u05EA  \u05D4\u05E4\u05EA\u05D5\u05D7\u05D5\u05EA \u05DC\u05D0\u05D5\u05E1\u05E3 \u05DE\u05D1\u05D5\u05E6\u05E2\u05D5\u05EA.
2042=\u05DC\u05E4\u05E2\u05D5\u05DC\u05D4 \u05D6\u05D5 \u05E0\u05D3\u05E8\u05E9\u05EA SODA \u05DB\u05D3\u05D9 \u05DC\u05D4\u05E4\u05E2\u05D9\u05DC \u05EA\u05E0\u05D5\u05E2\u05D4, \u05D0\u05DA \u05D9\u05E9 \u05E9\u05D2\u05D9\u05D0\u05D4 \u05D1\u05D4\u05E9\u05D1\u05EA\u05EA \u05D1\u05D9\u05E6\u05D5\u05E2 auto-commit \u05D0\u05D5\u05D8\u05D5\u05DE\u05D8\u05D9 \u05E9\u05DC \u05D7\u05D9\u05D1\u05D5\u05E8 JDBC.
2043=\u05DC\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05E4\u05E8\u05D8 \u05E9\u05DC \u05D4\u05D4\u05D9\u05D8\u05DC \u05D0\u05D9\u05DF \u05EA\u05D5\u05DB\u05DF \u05D0\u05D5 \u05E9\u05D4\u05EA\u05D5\u05DB\u05DF \u05E9\u05DC\u05D5 \u05E8\u05D9\u05E7.
2044=\u05DC\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05E4\u05E8\u05D8 \u05E9\u05DC \u05D4\u05D8\u05DC\u05D0\u05D9 \u05D0\u05D9\u05DF \u05EA\u05D5\u05DB\u05DF, \u05D0\u05D5 \u05E9\u05D4\u05EA\u05D5\u05DB\u05DF \u05E9\u05DC\u05D5 \u05E8\u05D9\u05E7.
2045=\u05DE\u05E4\u05E8\u05D8 \u05D4\u05D9\u05D8\u05DC \u05DC\u05D0 \u05D0\u05DE\u05D5\u05E8 \u05DC\u05D4\u05DB\u05D9\u05DC \u05EA\u05E2\u05E8\u05D5\u05D1\u05EA \u05E9\u05DC \u05DB\u05DC\u05DC\u05D9 \u05D4\u05DB\u05DC\u05DC\u05D4 \u05D5\u05DB\u05DC\u05DC\u05D9 \u05D0\u05D9-\u05D4\u05DB\u05DC\u05DC\u05D4.
#
# Internal errors  (2500 to 2999 error code range)
#
2500=\u05DC\u05D0\u05D5\u05E1\u05E3 {0} \u05DC\u05D0 \u05D9\u05DB\u05D5\u05DC \u05DC\u05D4\u05D9\u05D5\u05EA \u05EA\u05D5\u05DB\u05DF \u05D1\u05D9\u05E0\u05E8\u05D9 \u05D1\u05E1\u05D5\u05D2 \u05D4\u05E2\u05DE\u05D5\u05D3\u05D4 {1}.
2501=\u05D4\u05D0\u05D5\u05E1\u05E3 {0} \u05DE\u05E9\u05EA\u05DE\u05E9 \u05D1\u05E0\u05D9\u05D4\u05D5\u05DC \u05D2\u05E8\u05E1\u05D0\u05D5\u05EA {1}, \u05DB\u05EA\u05D9\u05D1\u05D5\u05EA \u05D1\u05DE\u05E6\u05D1 \u05D6\u05E8\u05D9\u05DE\u05D4 \u05D0\u05E1\u05D5\u05E8\u05D5\u05EA.
2502=\u05E9\u05DE\u05D9\u05E8\u05EA \u05DE\u05E1\u05DE\u05DA \u05D1\u05D0\u05D5\u05E1\u05E3 {0} \u05E0\u05DB\u05E9\u05DC\u05D4.
2503=\u05D4\u05D5\u05E1\u05E4\u05EA \u05DE\u05E1\u05DE\u05DA \u05DC\u05D0\u05D5\u05E1\u05E3 {0} \u05E0\u05DB\u05E9\u05DC\u05D4.
2504=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D9\u05E6\u05D5\u05E8 \u05DE\u05E4\u05EA\u05D7 \u05DE\u05D1\u05D5\u05E1\u05E1 UUID.
2505=\u05DE\u05E1\u05DE\u05DA \u05E2\u05DD \u05D4\u05DE\u05E4\u05EA\u05D7 {0} \u05D4\u05D5\u05D0 \u05D1\u05D2\u05D5\u05D3\u05DC {1}, \u05E9\u05D7\u05D5\u05E8\u05D2 \u05DE\u05D4\u05DE\u05D2\u05D1\u05DC\u05D4 \u05E9\u05DC 2GB.
2506=\u05D4\u05E7\u05E6\u05D0\u05EA \u05DE\u05E4\u05EA\u05D7 IDENTITY \u05DE\u05D7\u05D9\u05D9\u05D1 \u05EA\u05DE\u05D9\u05DB\u05EA RETURNING \u05D1-SQL.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=\u05D4\u05E7\u05D9\u05E6\u05D5\u05E5 \u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA, \u05D4\u05D0\u05D5\u05E1\u05E3 {0} \u05D0\u05D9\u05E0\u05D5 \u05DE\u05D1\u05D5\u05E1\u05E1 \u05D8\u05D1\u05DC\u05D4.
3001=indexAll \u05D0\u05D9\u05E0\u05D5 \u05DE\u05DE\u05D5\u05DE\u05E9 \u05DC\u05E2\u05DE\u05D5\u05D3\u05D5\u05EA \u05EA\u05D5\u05DB\u05DF \u05E2\u05DD \u05D4\u05E1\u05D5\u05D2 {0}.
3002=indexAll \u05D0\u05D9\u05E0\u05D5 \u05DE\u05DE\u05D5\u05DE\u05E9 \u05DC\u05D0\u05D5\u05E1\u05E4\u05D9\u05DD \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7\u05D5\u05EA NVARCHAR2.
3003=Java Virtual Machine \u200F(JVM) \u05D0\u05D9\u05E0\u05D5 \u05EA\u05D5\u05DE\u05DA \u05DE\u05D0\u05DC\u05D2\u05D5\u05E8\u05D9\u05EA\u05DD \u05E0\u05D9\u05D4\u05D5\u05DC \u05D4\u05D2\u05E8\u05E1\u05D0\u05D5\u05EA MD5. \u05E9\u05E0\u05D4 \u05DC\u05D0\u05DC\u05D2\u05D5\u05E8\u05D9\u05EA\u05DD \u05E0\u05D9\u05D4\u05D5\u05DC \u05D2\u05E8\u05E1\u05D0\u05D5\u05EA \u05D0\u05D7\u05E8.
3004=Java Virtual Machine \u200F(JVM) \u05D0\u05D9\u05E0\u05D5 \u05EA\u05D5\u05DE\u05DA \u05DE\u05D0\u05DC\u05D2\u05D5\u05E8\u05D9\u05EA\u05DD \u05E0\u05D9\u05D4\u05D5\u05DC \u05D4\u05D2\u05E8\u05E1\u05D0\u05D5\u05EA SHA256. \u05E9\u05E0\u05D4 \u05DC\u05D0\u05DC\u05D2\u05D5\u05E8\u05D9\u05EA\u05DD \u05E0\u05D9\u05D4\u05D5\u05DC \u05D2\u05E8\u05E1\u05D0\u05D5\u05EA \u05D0\u05D7\u05E8.
3005=\u05D4\u05EA\u05DB\u05D5\u05E0\u05D4 \u05DC\u05D0 \u05DE\u05D5\u05DE\u05E9\u05D4.
