#
# Copyright (c) 2014, 2020, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Ker\u00E4ily {0} on vain luku -muodossa, {1} ei ole sallittu.
2001=Ker\u00E4ilyll\u00E4 {0} ei ole aikaleimaa, joka osoittaisi viimeist\u00E4 muokkausta.
2002=Virheellinen suodattimen ehto.
2003=Kuvaaja ei vastaa olemassa olevaa ker\u00E4ily\u00E4.
2004=Argumentti {0} ei voi olla tyhj\u00E4.
2005={0} -joukko on tyhj\u00E4.
2006=Sek\u00E4 since-argumentti ett\u00E4 until-argumentti eiv\u00E4t voi olla tyhji\u00E4.
2007=Ker\u00E4ilyll\u00E4 {0} ei ole versiota.
2008=Argumentin {0} on oltava positiivinen.
2009=key()-, keys()- ja filter()-menetelmill\u00E4 m\u00E4\u00E4ritettyjen avainten kokonaism\u00E4\u00E4r\u00E4 on {0}, joka ylitt\u00E4\u00E4 enimm\u00E4israjan {1}.
2010=Iteroija {0} palautti tyhj\u00E4n, kun se oli palauttanut {1} asiakirjaa.
2011=Virheellinen argumentin arvo {0}.
2012=Enimm\u00E4ispituutta ei voi m\u00E4\u00E4ritt\u00E4\u00E4 LOB-tyypeille tai JSON-tyypille.
2013=SecureFile-LOB-asetuksia ei voi k\u00E4ytt\u00E4\u00E4, kun sis\u00E4ll\u00F6n saraketyyppi on {0}
2014=Viimeksi muokatun sarakkeen indeksin voi m\u00E4\u00E4ritt\u00E4\u00E4 vain, kun viimeksi muokatun sarakkeen nimi on m\u00E4\u00E4ritetty.
2015=Jos m\u00E4\u00E4ritysmenetelm\u00E4 on SEQUENCE, avainsarakkeen sarjan nimi on m\u00E4\u00E4ritett\u00E4v\u00E4.
2016=Version menetelm\u00E4 m\u00E4\u00E4ritettiin, mutta version sarakkeen nime\u00E4 ei ole m\u00E4\u00E4ritetty.
2017=M\u00E4\u00E4ritetty\u00E4 avainsaraketyyppi\u00E4 ei voi k\u00E4ytt\u00E4\u00E4 enimm\u00E4ispituuden kanssa.
2018=Kun GUID- tai UUID-tunnusta k\u00E4ytet\u00E4\u00E4n merkkityypin avainarvojen m\u00E4\u00E4ritykseen, avainsarakkeen pituuden on oltava v\u00E4hint\u00E4\u00E4n 32 tavua.
2019=Ker\u00E4ilyss\u00E4 ei voi olla mediatyypin saraketta, ellei sis\u00E4ll\u00F6n saraketyyppi ole BLOB.
2020=Asiakirjan mediatyyppi ei ole sovellus/json. getContentAsString() on tuettu vain JSON-asiakirjoille.
2021={0} -joukko sis\u00E4lt\u00E4\u00E4 tyhj\u00E4n.
2022=Korvattavan asiakirjan avain on m\u00E4\u00E4ritett\u00E4v\u00E4 key()-menetelm\u00E4ll\u00E4.
2023=Argumentin {0} on oltava ei-negatiivinen.
2024=Virheellinen indeksin luonnin m\u00E4\u00E4ritys.
2025=Virheellinen indeksin poiston m\u00E4\u00E4ritys.
2026=Ker\u00E4ilyn metatietoasiakirjassa ei ole sis\u00E4lt\u00F6\u00E4 tai sis\u00E4lt\u00F6 on tyhj\u00E4.
2027=Ker\u00E4ilyn metatietoasiakirja ei ole sallitussa JSON-muodossa.
2028=Ker\u00E4ilyn metatietoasiakirja ei ole sallitussa JSON-muodossa, koodausta ei voitu m\u00E4\u00E4ritt\u00E4\u00E4.
2029=IOException k\u00E4sitelt\u00E4ess\u00E4 ker\u00E4ilyn metatietoasiakirjaa.
2030=Virheellinen arvo kohteelle {0} ker\u00E4ilyn metatiedoissa.
2031=Ker\u00E4ilyn metatietojen on oltava JSON-objekti.
2032=Objektin avain {0} on odottamaton ker\u00E4ilyn metatiedoissa.
2033=Ker\u00E4ily\u00E4 ei ole m\u00E4\u00E4ritetty asiakkaan m\u00E4\u00E4ritt\u00E4mill\u00E4 avaimilla, mutta sy\u00F6teasiakirjassa on avain.
2034=Ker\u00E4ily\u00E4 ei ole m\u00E4\u00E4ritetty asiakkaan m\u00E4\u00E4ritt\u00E4m\u00E4ll\u00E4 avaimella, mutta iteroija {0} palautti asiakirjan, jossa on avain, kun se oli palauttanut {1} asiakirjaa.
2035=Annetussa JDBC-yhteydess\u00E4 kutsuttu getCurrentSchema() palautti tyhj\u00E4n.
2036=Virheellinen projektiom\u00E4\u00E4ritys.
2037=Arvo {0} ei ole sallittu tyypin {1} avain.
2038=Indeksipyynn\u00F6ss\u00E4 on enemm\u00E4n kuin {0} saraketta.
2039=Indeksi\u00E4 ei voi luoda salattuun sis\u00E4lt\u00F6\u00F6n. Indeksointi on sallittu vain, jos sis\u00E4ll\u00F6n sarakkeen salaukseksi on m\u00E4\u00E4ritetty NONE.
2040=next()-funktiota ei voi kutsua suljetussa kohdistimessa.
2041=Virhe yritett\u00E4ess\u00E4 poistaa kokoelmaa. Varmista, ett\u00E4 kokoelman kaikki odottavat kirjoitukset ovat valmiita.
2042=T\u00E4m\u00E4 toiminto vaatii tapahtuman k\u00E4ynnistykseen SODA-liittym\u00E4n, mutta JDBC-yhteyden automaattisen vahvistuksen k\u00E4yt\u00F6st\u00E4poistossa on virhe.
2043=Kohteen {0} m\u00E4\u00E4ritysasiakirjassa ei ole sis\u00E4lt\u00F6\u00E4 tai sis\u00E4lt\u00F6 on tyhj\u00E4.
2045=Projektion m\u00E4\u00E4rityksess\u00E4 ei saa olla sis\u00E4llytys- ja poissulkus\u00E4\u00E4nt\u00F6jen yhdistelm\u00E4\u00E4.
2046=Indeksointi- tai j\u00E4rjestysehdon polussa ei voi olla matriisivaiheita.
2047=Yhteyden on oltava OracleConnection tai OracleConnection-k\u00E4\u00E4re.
2048=Kieliparametria ei tueta 12.1.0.2 Oracle Database -teksti-indeksiss\u00E4.
2049=Funktionaalisen indeksin oletustila tarvitsee json_value-arvon null on empty -lauseen, jota tuetaan 12.2.0.1 Oracle Database -versiosta l\u00E4htien. scalarRequired- ja lax-tiloja tuetaan versiossa 12.1.0.2. Huomautus: esimerkkikyselyt eiv\u00E4t k\u00E4yt\u00E4 lax-indeksej\u00E4, joten scalarRequired on suositeltava valinta.
2050=Kohdetta {0} ei voi m\u00E4\u00E4ritt\u00E4\u00E4 12.1.0.2 Oracle Database -teksti-indeksille.
2051=Toiminto {0} edellytt\u00E4\u00E4 tapahtumien hallintaa, kun yhteys on automaattisen vahvistuksen tilassa, mutta avoidTxnManagement-merkint\u00E4 on m\u00E4\u00E4ritetty todeksi OracleDatabase -instanssissa. Poista automaattisen vahvistuksen tila k\u00E4yt\u00F6st\u00E4, jotta voit suorittaa toiminnon.
2052=keyLike() voidaan m\u00E4\u00E4ritt\u00E4\u00E4 vain kokoelmalle, jolla on ty\u00F6asemalle m\u00E4ritetty avain ja varchar2-avainsaraketyyppi.
2053=Kaavassa on jo indeksi, jolla on m\u00E4\u00E4ritetty nimi.
2054=ohitusta tai rajoitusta ei voi m\u00E4\u00E4ritt\u00E4\u00E4 laskentatoiminnolle.
2055=textIndex121WithLang-parametria, joka on m\u00E4\u00E4ritetty todeksi, ei tueta tietokannoissa, joiden versio on uudempi kuin 12.2.
2056=Projektion m\u00E4\u00E4rityksess\u00E4 ei saa olla taulukkovaiheita.
2057=Projektion m\u00E4\u00E4rityksess\u00E4 poluilla ei saa olla yhteist\u00E4 etuliitett\u00E4.
2058=Menetelm\u00E4\u00E4 {0} ei voi m\u00E4\u00E4ritt\u00E4\u00E4 yhdess\u00E4 menetelm\u00E4n {1} kanssa.
2059=Virhe muunnettaessa l\u00E4hdeasiakirjan JSON-sis\u00E4lt\u00F6\u00E4 binaariseksi. Varmista, ett\u00E4 l\u00E4hdeasiakirjan sis\u00E4lt\u00F6 on sallittua JSON-sis\u00E4lt\u00F6\u00E4.
2060=Virhe muunnettaessa binaarista JSON-sis\u00E4lt\u00F6\u00E4 tekstimuotoiseksi JSON-sis\u00E4ll\u00F6ksi.
2061=Asiakirjan avaimelle m\u00E4\u00E4ritetty polku on virheellinen.
2062=Polkua ei voitu poimia asiakirjasta.
2063=Polkua ei voitu lis\u00E4t\u00E4 asiakirjaan.
2064=Tarkistusta ei saa m\u00E4\u00E4ritt\u00E4\u00E4, kun contentColumn.sqlType on JSON.
2065=Tyyppi\u00E4 ei tueta: {0}
2066=Vihje {0} ei ole Merkkijono-tyyppinen tai sis\u00E4lt\u00E4\u00E4 osan /* tai */.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=Ker\u00E4ilyss\u00E4 {0} ei voi olla binaarisis\u00E4lt\u00F6\u00E4 saraketyypiss\u00E4 {1}.
2501=Ker\u00E4ilyss\u00E4 {0} k\u00E4ytet\u00E4\u00E4n {1} -versiointia, virtakirjoitusta ei sallita.
2502=Asiakirjan tallennus ker\u00E4ilyyn {0} ep\u00E4onnistui.
2503=Asiakirjan lis\u00E4ys ker\u00E4ilyyn {0} ep\u00E4onnistui.
2504=UUID-pohjaista avainta ei voi luoda.
2505=Avainta {0} k\u00E4ytt\u00E4v\u00E4n asiakirjan koko on {1}, joka ylitt\u00E4\u00E4 2 Gt:n rajan.
2506=IDENTITY-avaimen m\u00E4\u00E4ritys vaatii RETURNING-tuen SQL:ss\u00E4.
2507=Virhe haettaessa tietokannan versiota.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Katkaisua ei tueta, ker\u00E4ily {0} ei ole tauluperustainen.
3001=JSON-hakuindeksointia ei ole toteutettu sis\u00E4ll\u00F6n sarakkeille, joiden tyyppi on {0}.
3002=JSON-hakuindeksointia ei ole toteutettu ker\u00E4ilyille, joissa on NVARCHAR2-avaimet.
3003=Java-virtuaalikone (JVM) ei tue MD5-versiointialgoritmia. Vaihda toiseen versiointialgoritmiin.
3004=Java-virtuaalikone (JVM) ei tue SHA256-versiointialgoritmia. Vaihda toiseen versiointialgoritmiin.
3005=Ominaisuutta ei ole toteutettu.
3006=JSON-tilaindeksointia ei tueta moniarvoisille ker\u00E4ilyille.
3007=JSON-hakuindeksointia ei tueta moniarvoisille ker\u00E4ilyille.
3008=JSON-toimintoindeksointia ei tueta moniarvoisille ker\u00E4ilyille.
3009=Kyselyj\u00E4 esimerkin mukaan (QBE, Query-by-example) ei tueta moniarvoisille ker\u00E4ilyille.
