#
# Copyright (c) 2014, 2020, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Colec\u0163ia {0} este read-only; nu se permite {1}.
2001=Colec\u0163ia {0} nu are niciun marcaj temporal ce indic\u0103 data ultimei modific\u0103ri.
2002=Condi\u0163ie de filtrare nevalid\u0103.
2003=Descriptorul nu corespunde cu colec\u0163ia existent\u0103.
2004=Argumentul {0} nu poate fi nul.
2005=Setul {0} este gol.
2006=Argumentele ''since'' \u015Fi ''until'' nu pot fi ambele nule.
2007=Colec\u0163ia {0} nu are nicio versiune.
2008=Argumentul {0} trebuie s\u0103 fie pozitiv.
2009=Nr. total de chei specificat utiliz\u00E2nd metodele key(), keys() sau filter() este {0}, care dep\u0103\u015Fe\u015Fte limita maxim\u0103, de {1}.
2010=Iteratorul {0} a returnat o valoare nul\u0103 dup\u0103 returnarea a {1} documente.
2011=Valoare nevalid\u0103 argument, "{0}".
2012=Nu poate fi setat\u0103 o lungime maxim\u0103 pt. tipurile LOB sau tipul JSON.
2013=Set\u0103rile LOB SecureFile nu pot fi utilizate c\u00E2nd tipul coloanei de con\u0163inut este "{0}"
2014=Indexarea coloanei last-modified poate fi setat\u0103 doar c\u00E2nd este setat numele coloanei last-modified.
2015=Dac\u0103 metoda de asignare este "SEQUENCE", trebuie specificat un nume pt. secven\u0163a de coloane de chei.
2016=A fost specificat\u0103 o metod\u0103 version, dar nu este specificat numele coloanei version.
2017=Tipul specificat de coloan\u0103 de chei nu poate fi utilizat cu o lungime maxim\u0103.
2018=La utilizarea GUID sau UUID pt. asignarea valorilor cheilor pt. tipurile de caractere, lungimea coloanei de chei trebuie s\u0103 aib\u0103 minim 32 bytes.
2019=Colec\u0163ia nu poate avea o coloan\u0103 pt. tipul de media dec\u00E2t dac\u0103 tipul de coloan\u0103 de con\u0163inut este BLOB.
2020=Tipul de media al documentului nu este "application/json". getContentAsString() este acceptat\u0103 doar pt. documente JSON.
2021=Setul {0} con\u0163ine o valoare nul\u0103.
2022=Cheia pt. documentul de \u00EEnlocuit trebuie specificat\u0103 utiliz\u00E2nd metoda key().
2023=Argumentul {0} nu trebuie s\u0103 fie negativ.
2024=Specifica\u0163i nevalid\u0103 de creare a index\u0103rii.
2025=Specifica\u0163i nevalid\u0103 de abandonare a index\u0103rii.
2026=Documentul de metadate ale colec\u0163iei nu are con\u0163inut sau are con\u0163inut gol.
2027=Documentul de metadate ale colec\u0163iei nu este un document JSON valid.
2028=Documentul de metadate ale colec\u0163iei nu este un document JSON valid; nu a putut fi stabilit\u0103 codificarea.
2029=A survenit IOException la procesarea documentului de metadate ale colec\u0163iei.
2030=Valoare nevalid\u0103 pt. "{0}" \u00EEn metadatele colec\u0163iei.
2031=Metadatele colec\u0163iei trebuie s\u0103 fie un obiect JSON.
2032=Nu se a\u015Ftepta cheia de obiect "{0}" \u00EEn metadatele colec\u0163iei.
2033=Colec\u0163ia nu este configurat\u0103 cu chei asignate de client, dar documentul de intrare are o cheie.
2034=Colec\u0163ia nu este configurat\u0103 cu cheie asignat\u0103 de client, dar iteratorul {0} a returnat un document cu o cheie dup\u0103 returnarea a {1} documente.
2035=getCurrentSchema() invocat\u0103 \u00EEn conexiunea JDBC specificat\u0103 a returnat o valoare nul\u0103.
2036=Specifica\u0163ie de proiec\u0163ie nevalid\u0103.
2037=Valoarea {0} nu este o cheie valid\u0103 de tip {1}.
2038=Cererea de indexare are peste {0} coloane.
2039=Indexarea nu a putut fi creat\u0103 pt. con\u0163inutul criptat. Indexarea este permis\u0103 doar c\u00E2nd criptarea coloanei de con\u0163inut este setat\u0103 la NONE.
2040=next() nu poate fi apelat\u0103 pe un cursor \u00EEnchis.
2041=Eroare la \u00EEncercarea de a elimina colec\u0163ia. Asigura\u0163i-v\u0103 c\u0103 toate scrierile restante sunt confirmate \u00EEn colec\u0163ie.
2042=Aceast\u0103 opera\u0163ie necesit\u0103 SODA pt. \u00EEnceperea unei tranzac\u0163ii, dar a survenit o eroare la dezactivarea confirm\u0103rii automate a conexiunii JDBC.
2043=Documentul de specifica\u0163ii {0} nu are con\u0163inut sau are con\u0163inut gol.
2045=Specifica\u0163iile proiec\u0163iei nu trebuie s\u0103 con\u0163in\u0103 un amestec de reguli de includere \u015Fi excludere.
2046=Calea pt. o condi\u0163ie index sau order by nu trebuie s\u0103 con\u0163in\u0103 pa\u015Fii matricii.
2047=Conexiunea trebuie s\u0103 fie o OracleConnection sau o func\u0163ie wrapper pt. o OracleConnection.
2048=Parametrul de limb\u0103 nu este acceptat cu un index de text \u00EEn Oracle Database 12.1.0.2.
2049=Modul pt. indexul func\u0163ional prestabilit se bazeaz\u0103 pe clauza json_value "null on empty", care este permis\u0103 \u00EEn baza de date Oracle Database \u00EEncep\u00E2nd cu versiunea 12.2.0.1. Modurile  "scalarRequired" \u015Fi "lax"sunt permise \u00EEn 12.1.0.2. Not\u0103: indec\u015Fii "lax" nu sunt utiliza\u0163i \u00EEn QBE, deci se recomand\u0103 "scalarRequired".
2050="{0}" nu poate fi specificat pt. un index de text \u00EEn baza de date Oracle Database 12.1.0.2.
2051=Opera\u0163ia "{0}" necesit\u0103 managementul tranzac\u0163iilor dac\u0103 conexiunea este \u00EEn modul de salvare automat\u0103, dar marcajul "avoidTxnManagement" este setat la True \u00EEn instan\u0163a OracleDatabase. Dezactiva\u0163i modul de salvare automat\u0103 pt. a executa opera\u0163ia.
2052=keyLike() se poate specifica dor pt. o colec\u0163ie cu chei asignate de client \u015Fi cu tipul de coloan\u0103 de cheie varchar2.
2053=Exist\u0103 deja un index cu numele specificat \u00EEn schem\u0103.
2054=Pentru o opera\u0163ie de num\u0103rare, nu pute\u0163i seta omitere sau limitare (skip/limit).
2055=Parametrul textIndex121WithLang nu poate fi setat la True (Adev\u0103rat) \u00EEn versiuni ale bazei de date mai noi dec\u00E2t 12.2.
2056=Specifica\u0163ia proiec\u0163iei nu trebuie s\u0103 con\u0163in\u0103 pa\u015Fi de matrice.
2057=\u00CEntr-o specifica\u0163ie de proiec\u0163ie, c\u0103ile nu pot avea un prefix comun.
2058=Metoda{0} nu poate fi specificat\u0103 \u00EEmpreun\u0103 cu metoda {1}.
2059=A avut loc o eroare la conversia \u00EEn binar a con\u0163inutului JSON din documentul de intrare. Asigura\u0163i-v\u0103 c\u0103 este valid con\u0163inutul JSON din documentul de \u00EEntrare.
2060=A avut loc o eroare la conversia JSON-ului binar \u00EEn JSON text.
2061=Calea specificat\u0103 pt. cheia documentului nu este valid\u0103.
2062=Nu s-a putut extrage calea din document.
2063=Nu s-a putut insera calea \u00EEn document.
2064=Validarea nu ar trebui specificat\u0103 atunci c\u00E2nd contentColumn.sqlType este JSON.
2065=Tip neacceptat: {0}
2066=Sugestia {0} nu este de tip String sau con\u0163ine /* sau */.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=Colec\u0163ia {0} nu poate avea con\u0163inut binar \u00EEn tipul de coloan\u0103 {1}.
2501=Colec\u0163ia {0} utilizeaz\u0103 crearea de versiuni {1}; transmiterea \u00EEn flux a scrierilor nu este permis\u0103.
2502=Salvarea documentului \u00EEn colec\u0163ia {0} a e\u015Fuat.
2503=Inserarea documentului \u00EEn colec\u0163ia {0} a e\u015Fuat.
2504=Nu s-a putut genera cheia bazat\u0103 pe UUID.
2505=Documentul cu cheia {0} are dimensiunea {1}, care dep\u0103\u015Fe\u015Fte limita de 2 GB.
2506=Asignarea cheii IDENTITY necesit\u0103 suport pt. RETURNING \u00EEn SQL.
2507=Eroare la ob\u0163inerea versiunii bazei de date.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Trunchierea nu este acceptat\u0103; colec\u0163ia {0} nu este bazat\u0103 pe tabel.
3001=Indexarea de c\u0103utare JSON nu este implementat\u0103 pt. coloanele de con\u0163inut cu tipul {0}.
3002=Indexarea de c\u0103utare JSON nu este implementat\u0103 pt. colec\u0163iile cu chei NVARCHAR2.
3003=Java Virtual Machine (JVM) nu accept\u0103 algoritmul MD5 de creare a versiunilor. \u00CEncerca\u0163i cu alt algoritm pt. versiuni.
3004=Java Virtual Machine (JVM) nu accept\u0103 algoritmul SHA256 de creare a versiunilor. \u00CEncerca\u0163i cu alt algoritm pt. versiuni.
3005=Caracteristica nu este implementat\u0103.
3006=Indexarea spa\u0163ial\u0103 JSON nu este acceptat\u0103 \u00EEn colec\u0163iile eterogene.
3007=Indexarea de c\u0103utare JSON nu este acceptat\u0103 \u00EEn colec\u0163iile eterogene.
3008=Indexarea func\u0163ional\u0103 JSON nu este acceptat\u0103 \u00EEn colec\u0163iile eterogene.
3009=Interogarea cu exemple (QBE) nu este acceptat\u0103 \u00EEn colec\u0163iile eterogene.
