#
# Copyright (c) 2014, 2019, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3{0}\u306F\u8AAD\u53D6\u308A\u5C02\u7528\u3067\u3059\u3002{1}\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
2001=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3{0}\u306B\u3001\u6700\u7D42\u5909\u66F4\u304C\u3044\u3064\u304B\u3092\u793A\u3059\u30BF\u30A4\u30E0\u30FB\u30B9\u30BF\u30F3\u30D7\u304C\u3042\u308A\u307E\u305B\u3093\u3002
2002=\u30D5\u30A3\u30EB\u30BF\u6761\u4EF6\u304C\u7121\u52B9\u3067\u3059\u3002
2003=\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u304C\u65E2\u5B58\u306E\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3068\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
2004={0}\u5F15\u6570\u306Fnull\u306B\u3067\u304D\u307E\u305B\u3093\u3002
2005={0}\u30BB\u30C3\u30C8\u306F\u7A7A\u3067\u3059\u3002
2006=\u5F15\u6570''since''\u3068''until''\u3092\u4E21\u65B9\u3068\u3082null\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
2007=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3{0}\u306B\u30D0\u30FC\u30B8\u30E7\u30F3\u304C\u3042\u308A\u307E\u305B\u3093\u3002
2008={0}\u5F15\u6570\u306F\u3001\u6B63\u306E\u5024\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
2009=key()\u3001keys()\u307E\u305F\u306Ffilter()\u30E1\u30BD\u30C3\u30C9\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3057\u305F\u30AD\u30FC\u306E\u5408\u8A08\u6570\u304C{0}\u3067\u3059\u3002\u3053\u308C\u306F\u4E0A\u9650{1}\u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002
2010={0}\u30A4\u30C6\u30EC\u30FC\u30BF\u304C{1}\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3092\u8FD4\u3057\u305F\u5F8C\u3001null\u3092\u8FD4\u3057\u307E\u3057\u305F\u3002
2011=\u5F15\u6570\u5024"{0}"\u306F\u7121\u52B9\u3067\u3059\u3002
2012=LOB\u30BF\u30A4\u30D7\u307E\u305F\u306FJSON\u30BF\u30A4\u30D7\u306E\u6700\u5927\u9577\u3092\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
2013=\u30B3\u30F3\u30C6\u30F3\u30C4\u5217\u30BF\u30A4\u30D7\u304C"{0}"\u306E\u5834\u5408\u3001SecureFile LOB\u8A2D\u5B9A\u306F\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093
2014=last-modified\u5217\u306E\u7D22\u5F15\u306F\u3001last-modified\u5217\u306E\u540D\u524D\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306B\u306E\u307F\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u3002
2015=\u5272\u5F53\u3066\u30E1\u30BD\u30C3\u30C9\u304C"SEQUENCE"\u306E\u5834\u5408\u3001\u30AD\u30FC\u5217\u306E\u9806\u5E8F\u540D\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
2016=\u30D0\u30FC\u30B8\u30E7\u30F3\u30FB\u30E1\u30BD\u30C3\u30C9\u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u30D0\u30FC\u30B8\u30E7\u30F3\u5217\u540D\u304C\u672A\u6307\u5B9A\u3067\u3059\u3002
2017=\u6307\u5B9A\u3057\u305F\u30AD\u30FC\u5217\u30BF\u30A4\u30D7\u306F\u3001\u6700\u5927\u9577\u3067\u306F\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002
2018=GUID\u307E\u305F\u306FUUID\u3092\u4F7F\u7528\u3057\u3066\u6587\u5B57\u30BF\u30A4\u30D7\u306E\u30AD\u30FC\u5024\u3092\u5272\u308A\u5F53\u3066\u308B\u5834\u5408\u3001\u30AD\u30FC\u5217\u306E\u9577\u3055\u309232\u30D0\u30A4\u30C8\u4EE5\u4E0A\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
2019=\u30B3\u30F3\u30C6\u30F3\u30C4\u5217\u30BF\u30A4\u30D7\u304CBLOB\u3067\u306A\u3044\u304B\u304E\u308A\u3001\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u30E1\u30C7\u30A3\u30A2\u30FB\u30BF\u30A4\u30D7\u5217\u3092\u542B\u3081\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
2020=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u30E1\u30C7\u30A3\u30A2\u30FB\u30BF\u30A4\u30D7\u304C"application/json"\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002getContentAsString()\u306FJSON\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306B\u5BFE\u3057\u3066\u306E\u307F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002
2021={0}\u30BB\u30C3\u30C8\u306Bnull\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
2022=\u7F6E\u304D\u63DB\u3048\u308B\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u30AD\u30FC\u304C\u3001key()\u30E1\u30BD\u30C3\u30C9\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
2023={0}\u5F15\u6570\u306F\u3001\u8CA0\u3067\u306F\u306A\u3044\u5024\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
2024=\u7D22\u5F15\u4F5C\u6210\u306E\u6307\u5B9A\u304C\u7121\u52B9\u3067\u3059\u3002
2025=\u7D22\u5F15\u524A\u9664\u306E\u6307\u5B9A\u304C\u7121\u52B9\u3067\u3059\u3002
2026=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u30FB\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306B\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u306A\u3044\u304B\u3001\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u30FB\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u7A7A\u3067\u3059\u3002
2027=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u30FB\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u304C\u6709\u52B9\u306AJSON\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
2028=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u30FB\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u304C\u6709\u52B9\u306AJSON\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0\u3092\u5224\u5225\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
2029=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u30FB\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u51E6\u7406\u4E2D\u306BIOException\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
2030=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u306E"{0}"\u306E\u5024\u304C\u7121\u52B9\u3067\u3059\u3002
2031=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u306FJSON\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
2032=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30AD\u30FC"{0}"\u306F\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u3067\u4E88\u671F\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
2033=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5272\u5F53\u3066\u30AD\u30FC\u3067\u69CB\u6210\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u304C\u3001\u5165\u529B\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306B\u30AD\u30FC\u304C\u3042\u308A\u307E\u3059\u3002
2034=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5272\u5F53\u3066\u30AD\u30FC\u3067\u69CB\u6210\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u304C\u3001{0}\u30A4\u30C6\u30EC\u30FC\u30BF\u304C{1}\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3092\u8FD4\u3057\u305F\u5F8C\u3001\u30AD\u30FC\u3092\u542B\u3080\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3092\u8FD4\u3057\u307E\u3057\u305F\u3002
2035=\u6307\u5B9A\u3057\u305FJDBC\u63A5\u7D9A\u3067\u8D77\u52D5\u3055\u308C\u305FgetCurrentSchema()\u304B\u3089null\u304C\u8FD4\u3055\u308C\u307E\u3057\u305F\u3002
2036=\u30D7\u30ED\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306E\u6307\u5B9A\u304C\u7121\u52B9\u3067\u3059\u3002
2037=\u5024{0}\u306F\u30BF\u30A4\u30D7{1}\u306E\u6709\u52B9\u306A\u30AD\u30FC\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
2038=\u7D22\u5F15\u30EA\u30AF\u30A8\u30B9\u30C8\u306B{0}\u500B\u3092\u8D85\u3048\u308B\u5217\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
2039=\u6697\u53F7\u5316\u3055\u308C\u305F\u30B3\u30F3\u30C6\u30F3\u30C4\u306B\u306F\u7D22\u5F15\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002\u7D22\u5F15\u4ED8\u3051\u304C\u53EF\u80FD\u306A\u306E\u306F\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u5217\u6697\u53F7\u5316\u304CNONE\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u3067\u3059\u3002
2040=next()\u306F\u3001\u30AF\u30ED\u30FC\u30BA\u3055\u308C\u305F\u30AB\u30FC\u30BD\u30EB\u3067\u306F\u30B3\u30FC\u30EB\u3067\u304D\u307E\u305B\u3093\u3002
2041=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u524A\u9664\u3092\u8A66\u884C\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3078\u306E\u3059\u3079\u3066\u306E\u672A\u51E6\u7406\u66F8\u8FBC\u307F\u304C\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
2042=\u3053\u306E\u64CD\u4F5C\u306B\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u8D77\u52D5\u3059\u308BSODA\u304C\u5FC5\u8981\u3067\u3059\u304C\u3001JDBC\u63A5\u7D9A\u306E\u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u3092\u7121\u52B9\u5316\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
2043={0}\u6307\u5B9A\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306B\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u306A\u3044\u304B\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u7A7A\u3067\u3059\u3002
2045=\u30D7\u30ED\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u6307\u5B9A\u306B\u5305\u542B\u30EB\u30FC\u30EB\u307E\u305F\u306F\u9664\u5916\u30EB\u30FC\u30EB\u3092\u6DF7\u5728\u3057\u3066\u542B\u3081\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002
2046=\u7D22\u5F15\u307E\u305F\u306F\u6761\u4EF6\u306B\u3088\u308B\u9806\u5E8F\u4ED8\u3051\u306E\u30D1\u30B9\u306B\u914D\u5217\u30B9\u30C6\u30C3\u30D7\u3092\u542B\u3081\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
2047=\u63A5\u7D9A\u306FOracleConnection\u307E\u305F\u306FOracleConnection\u306E\u30E9\u30C3\u30D1\u30FC\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
2048=\u8A00\u8A9E\u30D1\u30E9\u30E1\u30FC\u30BF\u306F\u300112.1.0.2 Oracle Database\u30C6\u30AD\u30B9\u30C8\u7D22\u5F15\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
2049=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D5\u30A1\u30F3\u30AF\u30B7\u30E7\u30F3\u7D22\u5F15\u30E2\u30FC\u30C9\u306F\u300112.2.0.1 Oracle Database\u30EA\u30EA\u30FC\u30B9\u4EE5\u964D\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308Bjson_value "null on empty"\u53E5\u306B\u4F9D\u5B58\u3057\u307E\u3059\u3002"scalarRequired"\u304A\u3088\u3073"lax"\u30E2\u30FC\u30C9\u306F12.1.0.2\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002\u6CE8\u610F: "lax"\u7D22\u5F15\u306FQBE\u3067\u4F7F\u7528\u3055\u308C\u306A\u3044\u305F\u3081\u3001"scalarRequired"\u304C\u63A8\u5968\u3055\u308C\u307E\u3059\u3002
2050="{0}"\u306F\u300112.1.0.2 Oracle Database\u30C6\u30AD\u30B9\u30C8\u7D22\u5F15\u306B\u5BFE\u3057\u3066\u6307\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
2051=\u63A5\u7D9A\u304C\u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u30FB\u30E2\u30FC\u30C9\u306E\u5834\u5408\u3001\u64CD\u4F5C"{0}"\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u7BA1\u7406\u3092\u5FC5\u8981\u3068\u3057\u307E\u3059\u304C\u3001OracleDatabase\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067"avoidTxnManagement"\u30D5\u30E9\u30B0\u304Ctrue\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u64CD\u4F5C\u3092\u5B9F\u884C\u3059\u308B\u306B\u306F\u81EA\u52D5\u30B3\u30DF\u30C3\u30C8\u30FB\u30E2\u30FC\u30C9\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
2052=keyLike()\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5272\u5F53\u3066\u30AD\u30FC\u3068varchar2\u30AD\u30FC\u5217\u30BF\u30A4\u30D7\u3092\u6301\u3064\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u5BFE\u3057\u3066\u306E\u307F\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002
2053=\u6307\u5B9A\u3055\u308C\u305F\u540D\u524D\u306E\u7D22\u5F15\u304C\u30B9\u30AD\u30FC\u30DE\u306B\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
2054=\u30AB\u30A6\u30F3\u30C8\u64CD\u4F5C\u306B\u306Fskip\u307E\u305F\u306Flimit\u3092\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
2055=true\u306B\u8A2D\u5B9A\u3055\u308C\u305FtextIndex121WithLang\u30D1\u30E9\u30E1\u30FC\u30BF\u306F\u300112.2\u3088\u308A\u5F8C\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30EA\u30EA\u30FC\u30B9\u3067\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
2056=\u30D7\u30ED\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u6307\u5B9A\u306B\u306F\u914D\u5217\u30B9\u30C6\u30C3\u30D7\u3092\u542B\u3081\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002
2057=\u30D7\u30ED\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u6307\u5B9A\u3067\u306F\u3001\u30D1\u30B9\u306F\u5171\u901A\u63A5\u982D\u8F9E\u3092\u5171\u6709\u3067\u304D\u307E\u305B\u3093\u3002
2058=\u30E1\u30BD\u30C3\u30C9{0}\u306F\u3001\u30E1\u30BD\u30C3\u30C9{1}\u3068\u3068\u3082\u306B\u6307\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
2059=\u5165\u529B\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306EJSON\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30D0\u30A4\u30CA\u30EA\u306B\u5909\u63DB\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u5165\u529B\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u6709\u52B9\u306AJSON\u3067\u3042\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
2060=\u30D0\u30A4\u30CA\u30EAJSON\u3092\u30C6\u30AD\u30B9\u30C8JSON\u306B\u5909\u63DB\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
2061=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u30FB\u30AD\u30FC\u306B\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u304C\u7121\u52B9\u3067\u3059\u3002
2062=\u30D1\u30B9\u3092\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u304B\u3089\u62BD\u51FA\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
2063=\u30D1\u30B9\u3092\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306B\u633F\u5165\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
2064=contentColumn.sqlType\u304CJSON\u306E\u5834\u5408\u3001\u691C\u8A3C\u3092\u6307\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002

#
# Internal errors  (2500 to 2999 error code range)
#
2500=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3{0}\u306B\u5217\u30BF\u30A4\u30D7{1}\u306E\u30D0\u30A4\u30CA\u30EA\u30FB\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u542B\u3081\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
2501=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3{0}\u3067\u306F{1}\u30D0\u30FC\u30B8\u30E7\u30CB\u30F3\u30B0\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u30B9\u30C8\u30EA\u30FC\u30DF\u30F3\u30B0\u66F8\u8FBC\u307F\u306F\u884C\u3048\u307E\u305B\u3093\u3002
2502=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3{0}\u3078\u306E\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u4FDD\u5B58\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
2503=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3{0}\u3078\u306E\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u633F\u5165\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
2504=UUID\u30D9\u30FC\u30B9\u306E\u30AD\u30FC\u3092\u751F\u6210\u3067\u304D\u307E\u305B\u3093\u3002
2505=\u30AD\u30FC{0}\u3092\u542B\u3080\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u306E\u30B5\u30A4\u30BA\u306F{1}\u3067\u30012GB\u306E\u5236\u9650\u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002
2506=IDENTITY\u30AD\u30FC\u306E\u5272\u5F53\u3066\u306B\u306FSQL\u3067\u306ERETURNING\u30B5\u30DD\u30FC\u30C8\u304C\u5FC5\u8981\u3067\u3059\u3002
2507=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30D0\u30FC\u30B8\u30E7\u30F3\u306E\u53D6\u5F97\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=\u5207\u6368\u3066\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3{0}\u306F\u8868\u30D9\u30FC\u30B9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
3001=JSON\u691C\u7D22\u7D22\u5F15\u306F\u30BF\u30A4\u30D7{0}\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u5217\u306B\u5BFE\u3057\u3066\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
3002=JSON\u691C\u7D22\u7D22\u5F15\u306FNVARCHAR2\u30AD\u30FC\u3092\u542B\u3080\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u5BFE\u3057\u3066\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
3003=Java\u4EEE\u60F3\u30DE\u30B7\u30F3(JVM)\u306FMD5\u30D0\u30FC\u30B8\u30E7\u30CB\u30F3\u30B0\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u305B\u3093\u3002\u5225\u306E\u30D0\u30FC\u30B8\u30E7\u30CB\u30F3\u30B0\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306B\u5207\u308A\u63DB\u3048\u307E\u3059\u3002
3004=Java\u4EEE\u60F3\u30DE\u30B7\u30F3(JVM)\u306FSHA256\u30D0\u30FC\u30B8\u30E7\u30CB\u30F3\u30B0\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u305B\u3093\u3002\u5225\u306E\u30D0\u30FC\u30B8\u30E7\u30CB\u30F3\u30B0\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306B\u5207\u308A\u63DB\u3048\u307E\u3059\u3002
3005=\u6A5F\u80FD\u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
3006=JSON\u7A7A\u9593\u7D22\u5F15\u4ED8\u3051\u306F\u7570\u6A5F\u7A2E\u9593\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3067\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002
3007=JSON\u691C\u7D22\u7D22\u5F15\u4ED8\u3051\u306F\u7570\u6A5F\u7A2E\u9593\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3067\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002
3008=JSON\u30D5\u30A1\u30F3\u30AF\u30B7\u30E7\u30F3\u7D22\u5F15\u4ED8\u3051\u306F\u7570\u6A5F\u7A2E\u9593\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3067\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002
3009=\u4F8B\u306B\u3088\u308B\u554F\u5408\u305B(QBE)\u306F\u7570\u6A5F\u7A2E\u9593\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3067\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002
