#
# Copyright (c) 2014, 2016, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Kolekcja {0} jest tylko do odczytu; {1} nie jest dozwolone.
2001=Kolekcja {0} nie ma znacznika czasu, sygnalizuj\u0105cego dat\u0119 i godzin\u0119 ostatniej modyfikacji.
2002=Niepoprawny warunek filtrowania.
2003=Deskryptor nie odpowiada istniej\u0105cej kolekcji.
2004=Argument "{0}" nie mo\u017Ce mie\u0107 warto\u015Bci Null.
2005=Zbi\u00F3r "{0}" jest pusty.
2006=Argumenty "since" i "until" nie mog\u0105 mie\u0107 jednocze\u015Bnie warto\u015Bci Null.
2007=Kolekcja {0} nie ma wersji.
2008=Argument "{0}" musi by\u0107 liczb\u0105 dodatni\u0105.
2009=\u0141\u0105czna liczba kluczy podanych za pomoc\u0105 metod key(), keys() lub filter() wynosi {0}, co przekracza maksymalny limit r\u00F3wny {1}.
2010=Iterator {0} zwr\u00F3ci\u0142 warto\u015B\u0107 Null po zwr\u00F3ceniu {1} dokument\u00F3w.
2011=Niepoprawna warto\u015B\u0107 argumentu: {0}.
2012=Nie mo\u017Cna ustawi\u0107 maksymalnej d\u0142ugo\u015Bci dla typ\u00F3w LOB.
2013=Nie mo\u017Cna u\u017Cy\u0107 ustawie\u0144 SecureFile LOB, gdy typem kolumny zawarto\u015Bci jest "{0}"
2014=Indeks kolumny ostatniej modyfikacji mo\u017Cna ustawi\u0107 tylko wtedy, gdy zosta\u0142a ustawiona nazwa kolumny ostatniej modyfikacji
2015=Je\u015Bli metod\u0105 przypisywania jest "SEQUENCE", trzeba okre\u015Bli\u0107 nazw\u0119 sekwencji kolumn klucza.
2016=Podano metod\u0119 obs\u0142ugi wersji, lecz nie okre\u015Blono nazwy kolumny wersji.
2017=Podanego typu kolumny klucza nie mo\u017Cna u\u017Cy\u0107 wraz z maksymaln\u0105 d\u0142ugo\u015Bci\u0105.
2018=Je\u015Bli do przypisywania warto\u015Bci kluczy typu znakowego jest u\u017Cywany identyfikator GUID lub UUID, d\u0142ugo\u015B\u0107 kolumny klucza musi wynosi\u0107 przynajmniej 32 bajty.
2019=Kolekcja nie mo\u017Ce mie\u0107 kolumny typu "media", chyba \u017Ce typem kolumny jest BLOB.
2020=Typem "media" dokumentu nie jest "application/json". Metoda getContentAsString() jest obs\u0142ugiwana wy\u0142\u0105cznie dla dokument\u00F3w JSON.
2021=Zbi\u00F3r "{0}" zawiera warto\u015Bci Null.
2022=Gdy jest u\u017Cywana metoda key(), trzeba okre\u015Bli\u0107 klucz dla zast\u0119powanego dokumentu.
2023=Argument "{0}" musi by\u0107 liczb\u0105 nieujemn\u0105.
2024=Niepoprawna specyfikacja tworzenia indeksu.
2025=Niepoprawna specyfikacja usuwania indeksu.
2026=Dokument metadanych kolekcji nie ma zawarto\u015Bci albo ma zawarto\u015B\u0107 pust\u0105.
2027=Dokument metadanych kolekcji nie jest poprawnym dokumentem JSON.
2028=Dokument metadanych kolekcji nie jest poprawnym dokumentem JSON; nie mo\u017Cna by\u0142o ustali\u0107 kodowania.
2029=Wyst\u0105pi\u0142 wyj\u0105tek IOException podczas przetwarzania dokumentu metadanych kolekcji.
2030=Niepoprawna warto\u015B\u0107 dla "{0}" w metadanych kolekcji.
2031=Metadane kolekcji musz\u0105 by\u0107 obiektem JSON.
2032=Klucz obiektu "{0}" jest kluczem nieoczekiwanym w metadanych kolekcji.
2033=Kolekcja nie zosta\u0142a skonfigurowana jako kolekcja z kluczami przypisywanymi przez klienta, lecz dokument zawiera klucz.
2034=Kolekcja nie zosta\u0142a skonfigurowana jako kolekcja z kluczem przypisywanym przez klienta, lecz iterator {0} zwr\u00F3ci\u0142 - po zwr\u00F3ceniu {1} dokument\u00F3w - dokument zawieraj\u0105cy klucz.
2035=Metoda getCurrentSchema(), wywo\u0142ana dla podanego po\u0142\u0105czenia JDBC, zwr\u00F3ci\u0142a warto\u015B\u0107 Null.
2036=Niepoprawna specyfikacja rzutowania.
2037=Warto\u015B\u0107 {0} nie jest poprawnym kluczem typu {1}.
2038=\u017B\u0105danie indeksowania ma wi\u0119cej ni\u017C {0} kolumn(y).
2039=Nie mo\u017Cna utworzy\u0107 indeksu szyfrowanej zawarto\u015Bci. Indeksowanie jest dozwolone tylko wtedy, gdy szyfrowanie kolumny zawarto\u015Bci jest ustawione na NONE.
2040=Nie mo\u017Cna wywo\u0142a\u0107 next() w odniesieniu do zamkni\u0119tego kursora.
2041=B\u0142\u0105d podczas pr\u00F3by usuni\u0119cia kolekcji. Prosz\u0119 si\u0119 upewni\u0107, \u017Ce wszystkie zaleg\u0142e operacje zapisu w kolekcji zosta\u0142y zatwierdzone.
2042=Ta operacja wymaga - do uruchomienia transakcji - interfejsu SODA, lecz wyst\u0105pi\u0142 b\u0142\u0105d podczas wy\u0142\u0105czania automatycznego zatwierdzania po\u0142\u0105czenia JDBC.
2043=Dokument specyfikacji rzutowania nie ma zawarto\u015Bci albo ma zawarto\u015B\u0107 pust\u0105.
2044=Dokument specyfikacji poprawek nie ma zawarto\u015Bci albo ma zawarto\u015B\u0107 pust\u0105.
2045=Specyfikacja projektu nie mo\u017Ce zawiera\u0107 mieszaniny regu\u0142 uwzgl\u0119dniania (include) i wykluczania (exclude).
#
# Internal errors  (2500 to 2999 error code range)
#
2500=Kolekcja {0} nie mo\u017Ce mie\u0107 zawarto\u015Bci binarnej w kolumnie typu {1}.
2501=Kolekcja {0} korzysta z obs\u0142ugi wersji {1}; zapisy strumieniowe nie s\u0105 dozwolone.
2502=Nie uda\u0142o si\u0119 zapisa\u0107 dokumentu w kolekcji {0}.
2503=Nie uda\u0142o si\u0119 wstawi\u0107 dokumentu do kolekcji {0}.
2504=Nie mo\u017Cna wygenerowa\u0107 klucza opartego na UUID.
2505=Dokument o kluczu {0} ma rozmiar {1} przekraczaj\u0105cy limit 2 GB.
2506=Przypisanie klucza IDENTITY wymaga obs\u0142ugi RETURNING w SQL.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Przycinanie nie jest obs\u0142ugiwane; kolekcja {0} nie jest oparta na tabeli.
3001=indexAll nie jest zaimplementowane dla kolumn zawarto\u015Bci o typie {0}.
3002=indexAll nie jest zaimplementowane dla kolekcji z kluczami NVARCHAR2.
3003=Wirtualna maszyna Javy (JVM) nie obs\u0142uguje algorytmu tworzenia wersji MD5. Prosz\u0119 prze\u0142\u0105czy\u0107 na inny algorytm tworzenia wersji.
3004=Wirtualna maszyna Javy (JVM) nie obs\u0142uguje algorytmu tworzenia wersji SHA256. Prosz\u0119 prze\u0142\u0105czy\u0107 na inny algorytm tworzenia wersji.
3005=Funkcja nie jest zaimplementowana.
