#
# Copyright (c) 2014, 2020, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=La collecte {0} est en lecture seule, {1} non autoris\u00E9.
2001=La collecte {0} ne comporte aucun horodatage indiquant la derni\u00E8re modification.
2002=Condition de filtre non valide.
2003=Le descripteur ne correspond pas \u00E0 la collecte existante.
2004=L''argument {0} ne peut pas \u00EAtre NULL.
2005=L''ensemble {0} est vide.
2006=Les arguments ''since'' et ''until'' ne peuvent pas \u00EAtre tous les deux NULL.
2007=La collecte {0} ne poss\u00E8de aucune version.
2008=L''argument {0} doit \u00EAtre positif.
2009=Le nombre total de cl\u00E9s indiqu\u00E9es \u00E0 l''aide de la m\u00E9thode key(), keys() ou filter() est de {0}, ce qui d\u00E9passe la limite maximale de {1}.
2010=L''it\u00E9rateur {0} a renvoy\u00E9 la valeur NULL, apr\u00E8s avoir renvoy\u00E9 {1} documents.
2011=valeur d''argument non valide "{0}".
2012=Aucune longueur maximale ne peut \u00EAtre d\u00E9finie pour les types LOB ou le type JSON.
2013=Les param\u00E8tres LOB SecureFile ne peuvent pas \u00EAtre utilis\u00E9s lorsque le type de colonne de contenu est "{0}"
2014=L'index de colonne de derni\u00E8re modification ne peut \u00EAtre d\u00E9fini que lorsque le nom de cette colonne est d\u00E9fini.
2015=Si la m\u00E9thode d'affectation est "SEQUENCE", un nom de s\u00E9quence de colonnes de cl\u00E9 doit \u00EAtre indiqu\u00E9.
2016=Une m\u00E9thode de version a \u00E9t\u00E9 indiqu\u00E9e mais le nom de colonne de version ne l'est pas.
2017=Le type de colonne de cl\u00E9 indiqu\u00E9 ne peut pas \u00EAtre utilis\u00E9 avec une longueur maximale.
2018=Si vous utilisez le GUID ou l'UUID pour affecter des valeurs de cl\u00E9 de type caract\u00E8re, la longueur de colonne de cl\u00E9 doit \u00EAtre d'au moins 32 octets.
2019=La collecte peut ne pas comporter de colonne de type de support, sauf si le type de colonne de contenu est BLOB.
2020=Le type de support du document n'est pas "application/json". getContentAsString() est uniquement pris en charge pour les documents JSON.
2021=L''ensemble {0} contient une valeur NULL.
2022=La cl\u00E9 que le document doit remplacer doit \u00EAtre indiqu\u00E9e \u00E0 l'aide de la m\u00E9thode key().
2023=L''argument {0} ne doit pas \u00EAtre n\u00E9gatif.
2024=Sp\u00E9cification de cr\u00E9ation d'index non valide.
2025=Sp\u00E9cification de suppression d'index non valide.
2026=Le document de m\u00E9tadonn\u00E9es de collecte n'a pas de contenu ou son contenu est vide.
2027=Le document de m\u00E9tadonn\u00E9es de collecte n'est pas un document JSON valide.
2028=Le document de m\u00E9tadonn\u00E9es de collecte n'est pas un document JSON valide, impossible de d\u00E9terminer l'encodage.
2029=Une exception IOException s'est produite lors du traitement du document de m\u00E9tadonn\u00E9es de collecte.
2030=Valeur non valide pour "{0}" dans les m\u00E9tadonn\u00E9es de collecte.
2031=Les m\u00E9tadonn\u00E9es de collecte doivent \u00EAtre un objet JSON.
2032=La cl\u00E9 d''objet "{0}" est inattendue dans les m\u00E9tadonn\u00E9es de collecte.
2033=La collecte n'est pas configur\u00E9e avec des cl\u00E9s affect\u00E9es par le client, mais le document d'entr\u00E9e comporte une cl\u00E9.
2034=La collecte n''est pas configur\u00E9e avec une cl\u00E9 affect\u00E9e par le client, mais l''it\u00E9rateur {0} a renvoy\u00E9 un document avec une cl\u00E9, apr\u00E8s avoir renvoy\u00E9 {1} documents.
2035=getCurrentSchema() appel\u00E9 sur la connexion JDBC fournie a renvoy\u00E9 la valeur NULL.
2036=Sp\u00E9cification de projection non valide.
2037=La valeur {0} n''est pas une cl\u00E9 valide de type {1}.
2038=La demande d''index contient plus de {0} colonnes.
2039=Impossible de cr\u00E9er l'index sur un contenu crypt\u00E9. L'indexation n'est autoris\u00E9e que si le cryptage de colonne de contenu est d\u00E9fini sur NONE.
2040=Impossible d'appeler next() sur un curseur ferm\u00E9.
2041=Erreur lors de la tentative de suppression de la collecte. Assurez-vous que toutes les \u00E9critures en attente dans la collecte sont valid\u00E9es (commit).
2042=Cette op\u00E9ration requiert SODA pour d\u00E9marrer une transaction, mais une erreur est survenue lors de la d\u00E9sactivation de la validation (commit) automatique de la connexion JDBC.
2043=Le document de sp\u00E9cification {0} n''a pas de contenu ou son contenu est vide.
2045=La sp\u00E9cification de projection ne doit pas contenir un m\u00E9lange de r\u00E8gles d'inclusion et d'exclusion.
2046=Le chemin d'un index ou d'une condition de tri ne doit pas contenir d'\u00E9tapes de tableau.
2047=La connexion doit \u00EAtre OracleConnection ou un wrapper pour OracleConnection.
2048=Le param\u00E8tre de langage n'est pas pris en charge avec un index de texte Oracle Database 12.1.0.2.
2049=Le mode d'index fonctionnel par d\u00E9faut d\u00E9pend de la clause json_value "null on empty" prise en charge \u00E0 partir de la version 12.2.0.1. d'Oracle Database. Les modes "scalarRequired" et "lax" sont pris en charge avec la version 12.1.0.2. Remarque : les index "lax" ne sont pas utilis\u00E9s par les requ\u00EAtes par l'exemple, "scalarRequired" est donc recommand\u00E9.
2050=Impossible d''indiquer "{0}" pour un index de texte Oracle Database 12.1.0.2.
2051=L''op\u00E9ration "{0}" requiert la gestion des transactions lorsque la connexion est en mode de validation (commit) automatique, mais que l''indicateur "avoidTxnManagement" est d\u00E9fini sur la valeur True sur l''instance OracleDatabase. D\u00E9sactivez le mode de validation (commit) automatique pour ex\u00E9cuter l''op\u00E9ration.
2052=keyLike() peut uniquement \u00EAtre indiqu\u00E9 pour une collecte avec des cl\u00E9s affect\u00E9es par le client et un type de colonne de cl\u00E9 varchar2.
2053=Un index avec le nom sp\u00E9cifi\u00E9 existe d\u00E9j\u00E0 dans le sch\u00E9ma.
2054=Impossible de d\u00E9finir skip ou limit pour une op\u00E9ration de d\u00E9compte.
2055=Le param\u00E8tre textIndex121WithLang d\u00E9fini sur la valeur True n'est pas pris en charge sur les versions de base de donn\u00E9es sup\u00E9rieures \u00E0 12.2.
2056=La sp\u00E9cification de projection ne doit pas contenir d'\u00E9tapes de tableau.
2057=Dans une sp\u00E9cification de projection, les chemins ne doivent pas partager de pr\u00E9fixe commun.
2058=Impossible d''indiquer la m\u00E9thode {0} en m\u00EAme temps que la m\u00E9thode {1}.
2059=Une erreur est survenue lors de la conversion du contenu JSON du document d'entr\u00E9e en contenu binaire. Assurez-vous que le contenu du document d'entr\u00E9e correspond \u00E0 du contenu JSON valide.
2060=Une erreur est survenue lors de la conversion du fichier JSON binaire en fichier JSON textuel.
2061=Le chemin indiqu\u00E9 pour la cl\u00E9 de document n'est pas valide.
2062=Impossible d'extraire le chemin du document.
2063=Impossible d'ins\u00E9rer le chemin dans le document.
2064=La validation ne doit pas \u00EAtre indiqu\u00E9e quand contentColumn.sqlType a la valeur JSON.
2065=Type non pris en charge : {0}
2066=Le conseil {0} n''est pas de type Cha\u00EEne, ou contient /* ou */.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=La collecte {0} ne peut poss\u00E9der un contenu binaire dans le type de colonne {1}.
2501=La collecte {0} utilise la gestion des versions {1}, \u00E9critures de transmission en continu non autoris\u00E9es.
2502=Echec de l''enregistrement du document dans la collecte {0}.
2503=Echec de l''insertion du document dans la collecte {0}.
2504=Impossible de g\u00E9n\u00E9rer la cl\u00E9 bas\u00E9e sur l'UUID.
2505=La taille du document avec la cl\u00E9 {0} est de {1}, ce qui d\u00E9passe la limite de 2 Go.
2506=L'affectation de cl\u00E9 IDENTITY requiert la prise en charge de RETURNING dans SQL.
2507=Erreur lors de l'obtention de la version de la base de donn\u00E9es.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Troncature non prise en charge, la collecte {0} n''est pas bas\u00E9e sur une table.
3001=L''index de recherche JSON n''est pas impl\u00E9ment\u00E9 pour les colonnes de contenu avec le type {0}.
3002=L'index de recherche JSON n'est pas impl\u00E9ment\u00E9 pour les collectes avec des cl\u00E9s NVARCHAR2.
3003=Java Virtual Machine (JVM) ne prend pas en charge l'algorithme de gestion des versions MD5. Utilisez un autre algorithme.
3004=Java Virtual Machine (JVM) ne prend pas en charge l'algorithme de gestion des versions SHA256. Utilisez un autre algorithme.
3005=La fonctionnalit\u00E9 n'est pas impl\u00E9ment\u00E9e.
3006=L'indexation spatiale JSON n'est pas prise en charge sur des collectes h\u00E9t\u00E9rog\u00E8nes.
3007=L'indexation de recherche JSON n'est pas prise en charge sur des collectes h\u00E9t\u00E9rog\u00E8nes.
3008=L'indexation fonctionnelle JSON n'est pas prise en charge sur des collectes h\u00E9t\u00E9rog\u00E8nes.
3009=La requ\u00EAte par l'exemple n'est pas prise en charge sur des collectes h\u00E9t\u00E9rog\u00E8nes.
