#
# Copyright (c) 2014, 2019, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=\u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 {0} \u0644\u0644\u0642\u0631\u0627\u0621\u0629 \u0641\u0642\u0637\u060C \u063A\u064A\u0631 \u0645\u0633\u0645\u0648\u062D \u0628\u0640 {1}.
2001=\u0644\u0627 \u062A\u0634\u062A\u0645\u0644 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 {0} \u0639\u0644\u0649 \u0637\u0627\u0628\u0639 \u0632\u0645\u0646\u064A \u064A\u0634\u064A\u0631 \u0625\u0644\u0649 \u0622\u062E\u0631 \u062A\u0648\u0642\u064A\u062A \u062A\u0645 \u062A\u063A\u064A\u064A\u0631\u0647\u0627 \u0641\u064A\u0647.
2002=\u0634\u0631\u0637 \u0627\u0644\u0645\u0631\u0634\u062D \u063A\u064A\u0631 \u0635\u0627\u0644\u062D.
2003=\u0644\u0627 \u064A\u0637\u0627\u0628\u0642 \u0627\u0644\u0648\u0627\u0635\u0650\u0641 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u0627\u0644\u0645\u0648\u062C\u0648\u062F\u0629.
2004=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u062A\u0643\u0648\u0646 \u0648\u0633\u064A\u0637\u0629 {0} \u062E\u0627\u0644\u064A\u0629.
2005=\u0645\u062C\u0645\u0648\u0639\u0629 {0} \u0641\u0627\u0631\u063A\u0629.
2006=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u062A\u0643\u0648\u0646 \u0627\u0644\u0648\u0633\u064A\u0637\u062A\u0627\u0646 ''since'' \u0648''until'' \u062E\u0627\u0644\u064A\u062A\u064A\u0646.
2007=\u0644\u0627 \u062A\u0634\u062A\u0645\u0644 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 {0} \u0639\u0644\u0649 \u0625\u0635\u062F\u0627\u0631.
2008=\u064A\u062C\u0628 \u0623\u0646 \u062A\u0643\u0648\u0646 \u0648\u0633\u064A\u0637\u0629 {0} \u0645\u0648\u062C\u0628\u0629.
2009=\u0625\u062C\u0645\u0627\u0644\u064A \u0639\u062F\u062F \u0627\u0644\u0645\u0641\u0627\u062A\u064A\u062D \u0627\u0644\u0645\u062D\u062F\u062F\u0629 \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 key() \u0623\u0648 keys() \u0623\u0648 filter() \u0647\u0648 {0}\u060C \u0648\u0647\u0648 \u064A\u0632\u064A\u062F \u0639\u0646 \u0627\u0644\u062D\u062F \u0627\u0644\u0623\u0642\u0635\u0649 \u0627\u0644\u0628\u0627\u0644\u063A {1}.
2010=\u0623\u0631\u062C\u0639 \u0645\u0643\u0631\u0651\u0650\u0631 {0} \u0642\u064A\u0645\u0629 \u062E\u0627\u0644\u064A\u0629\u060C \u0628\u0639\u062F \u0625\u0631\u062C\u0627\u0639 {1} \u0645\u0646 \u0627\u0644\u0645\u0633\u062A\u0646\u062F\u0627\u062A.
2011=\u0642\u064A\u0645\u0629 \u0648\u0633\u064A\u0637\u0629 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629 "{0}".
2012=\u064A\u062A\u0639\u0630\u0631 \u062A\u0639\u064A\u064A\u0646 \u0627\u0644\u062D\u062F \u0627\u0644\u0623\u0642\u0635\u0649 \u0644\u0644\u0637\u0648\u0644 \u0644\u0623\u0646\u0648\u0627\u0639 LOB \u0623\u0648 \u0646\u0648\u0639 JSON.
2013=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0625\u0639\u062F\u0627\u062F\u0627\u062A LOB \u0645\u0646 \u0646\u0648\u0639 SecureFile \u0639\u0646\u062F\u0645\u0627 \u064A\u0643\u0648\u0646 \u0646\u0648\u0639 \u0639\u0645\u0648\u062F \u0627\u0644\u0645\u062D\u062A\u0648\u0649 "{0}"
2014=\u064A\u0645\u0643\u0646 \u062A\u0639\u064A\u064A\u0646 \u0622\u062E\u0631 \u0641\u0647\u0631\u0633 \u0639\u0645\u0648\u062F \u062A\u0645 \u062A\u0639\u062F\u064A\u0644\u0647 \u0639\u0646\u062F \u062A\u0639\u064A\u064A\u0646 \u0622\u062E\u0631 \u0627\u0633\u0645 \u0639\u0645\u0648\u062F \u062A\u0645 \u062A\u062D\u0631\u064A\u0631\u0647.
2015=\u0625\u0630\u0627 \u0643\u0627\u0646 \u0623\u0633\u0644\u0648\u0628 \u0627\u0644\u062A\u0639\u064A\u064A\u0646 "SEQUENCE"\u060C \u064A\u062C\u0628 \u062A\u062D\u062F\u064A\u062F \u0627\u0633\u0645 \u0644\u062A\u0633\u0644\u0633\u0644 \u0623\u0639\u0645\u062F\u0629 \u0627\u0644\u0645\u0641\u0627\u062A\u064A\u062D.
2016=\u062A\u0645 \u062A\u0639\u064A\u064A\u0646 \u0623\u0633\u0644\u0648\u0628 \u0625\u0635\u062F\u0627\u0631 \u0644\u0643\u0646 \u0644\u0645 \u064A\u062A\u0645 \u062A\u062D\u062F\u064A\u062F \u0627\u0633\u0645 \u0639\u0645\u0648\u062F \u0627\u0644\u0625\u0635\u062F\u0627\u0631.
2017=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0646\u0648\u0639 \u0639\u0645\u0648\u062F \u0627\u0644\u0645\u0641\u062A\u0627\u062D \u0627\u0644\u0645\u062D\u062F\u062F \u0645\u0639 \u062D\u062F \u0623\u0642\u0635\u0649 \u0644\u0644\u0637\u0648\u0644.
2018=\u0639\u0646\u062F \u0627\u0633\u062A\u062E\u062F\u0627\u0645 GUID \u0623\u0648 UUID \u0644\u062A\u0639\u064A\u064A\u0646 \u0642\u064A\u0645 \u0645\u0641\u0627\u062A\u064A\u062D \u0645\u0646 \u0646\u0648\u0639 \u0623\u062D\u0631\u0641\u060C \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0637\u0648\u0644 \u0639\u0645\u0648\u062F \u0627\u0644\u0645\u0641\u062A\u0627\u062D 32 \u0628\u0627\u064A\u062A \u0623\u0648 \u0623\u0643\u062B\u0631.
2019=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u062A\u0634\u062A\u0645\u0644 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u0639\u0644\u0649 \u0639\u0645\u0648\u062F \u0646\u0648\u0639 \u0648\u0633\u0627\u0626\u0637 \u0645\u0627 \u0644\u0645 \u064A\u0643\u0646 \u0646\u0648\u0639 \u0639\u0645\u0648\u062F \u0627\u0644\u0645\u062D\u062A\u0648\u0649 BLOB (\u0643\u0627\u0626\u0646\u0627\u062A \u0643\u0628\u064A\u0631\u0629 \u062B\u0646\u0627\u0626\u064A\u0629).
2020=\u0646\u0648\u0639 \u0627\u0644\u0648\u0633\u0627\u0626\u0637 \u0644\u0644\u0645\u0633\u062A\u0646\u062F \u0644\u064A\u0633 "application/json". getContentAsString() \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u0642\u0637 \u0644\u0645\u0633\u062A\u0646\u062F\u0627\u062A JSON.
2021=\u062A\u0634\u062A\u0645\u0644 \u0645\u062C\u0645\u0648\u0639\u0629 {0} \u0639\u0644\u0649 \u0642\u064A\u0645\u0629 \u062E\u0627\u0644\u064A\u0629.
2022=\u064A\u062C\u0628 \u062A\u062D\u062F\u064A\u062F \u0645\u0641\u062A\u0627\u062D \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0627\u0644\u0645\u0637\u0644\u0648\u0628 \u0627\u0633\u062A\u0628\u062F\u0627\u0644\u0647 \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 key().
2023=\u064A\u062C\u0628 \u0623\u0646 \u062A\u0643\u0648\u0646 \u0648\u0633\u064A\u0637\u0629 {0} \u063A\u064A\u0631 \u0633\u0627\u0644\u0628\u0629.
2024=\u0645\u0648\u0627\u0635\u0641\u0627\u062A \u062A\u0643\u0648\u064A\u0646 \u0627\u0644\u0641\u0647\u0631\u0633 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629.
2025=\u0645\u0648\u0627\u0635\u0641\u0627\u062A \u0625\u0633\u0642\u0627\u0637 \u0627\u0644\u0641\u0647\u0631\u0633 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629.
2026=\u0644\u0627 \u064A\u0634\u062A\u0645\u0644 \u0645\u0633\u062A\u0646\u062F \u0645\u064A\u062A\u0627\u062F\u064A\u062A\u0627 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u0639\u0644\u0649 \u0623\u064A \u0645\u062D\u062A\u0648\u0649 \u0623\u0648 \u0628\u0647 \u0645\u062D\u062A\u0648\u0649 \u0641\u0627\u0631\u063A.
2027=\u0645\u0633\u062A\u0646\u062F \u0645\u064A\u062A\u0627\u062F\u064A\u062A\u0627 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u0644\u064A\u0633 \u0628\u0635\u064A\u063A\u0629 JSON \u0635\u0627\u0644\u062D\u0629.
2028=\u0645\u0633\u062A\u0646\u062F \u0645\u064A\u062A\u0627\u062F\u064A\u062A\u0627 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u0644\u064A\u0633 \u0628\u0635\u064A\u063A\u0629 JSON \u0635\u0627\u0644\u062D\u0629\u061B \u062A\u0639\u0630\u0631 \u062A\u062D\u062F\u064A\u062F \u0627\u0644\u062A\u0631\u0645\u064A\u0632.
2029=\u062D\u062F\u062B IOException \u0623\u062B\u0646\u0627\u0621 \u0645\u0639\u0627\u0644\u062C\u0629 \u0645\u0633\u062A\u0646\u062F \u0645\u064A\u062A\u0627\u062F\u064A\u062A\u0627 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629.
2030=\u0642\u064A\u0645\u0629 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629 \u0644\u0640 "{0}" \u0641\u064A \u0645\u064A\u062A\u0627\u062F\u064A\u062A\u0627 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629.
2031=\u064A\u062C\u0628 \u0623\u0646 \u062A\u0643\u0648\u0646 \u0645\u064A\u062A\u0627\u062F\u064A\u062A\u0627 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u0643\u0627\u0626\u0646\u064B\u0627 \u0628\u0635\u064A\u063A\u0629 JSON.
2032=\u0645\u0641\u062A\u0627\u062D \u0627\u0644\u0643\u0627\u0626\u0646 "{0}" \u063A\u064A\u0631 \u0645\u062A\u0648\u0642\u0639 \u0641\u064A \u0645\u064A\u062A\u0627\u062F\u064A\u062A\u0627 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629.
2033=\u0644\u0645 \u064A\u062A\u0645 \u062A\u0643\u0648\u064A\u0646 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0645\u0641\u0627\u062A\u064A\u062D \u0645\u0639\u064A\u0646\u0629 \u0644\u0644\u0639\u0645\u064A\u0644\u060C \u0644\u0643\u0646 \u0645\u0633\u062A\u0646\u062F \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A \u064A\u0634\u062A\u0645\u0644 \u0639\u0644\u0649 \u0645\u0641\u062A\u0627\u062D.
2034=\u0644\u0645 \u064A\u062A\u0645 \u062A\u0643\u0648\u064A\u0646 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0645\u0641\u062A\u0627\u062D \u0645\u0639\u064A\u0646 \u0644\u0644\u0639\u0645\u064A\u0644\u060C \u0648\u0644\u0643\u0646 \u0645\u0643\u0631\u0651\u0650\u0631 {0} \u0623\u0631\u062C\u0639 \u0645\u0633\u062A\u0646\u062F\u064B\u0627 \u0628\u0645\u0641\u062A\u0627\u062D\u060C \u0628\u0639\u062F \u0625\u0631\u062C\u0627\u0639 {1} \u0645\u0646 \u0627\u0644\u0645\u0633\u062A\u0646\u062F\u0627\u062A.
2035=\u062A\u0645 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 getCurrentSchema() \u0639\u0646\u062F \u0625\u0631\u062C\u0627\u0639 \u0645\u062C\u0645\u0648\u0639\u0629 JDBC \u0627\u0644\u0645\u0642\u062F\u0645\u0629 \u0642\u064A\u0645\u0629 \u062E\u0627\u0644\u064A\u0629.
2036=\u0645\u0648\u0627\u0635\u0641\u0627\u062A \u0627\u0644\u0625\u0633\u0642\u0627\u0637 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629.
2037=\u0627\u0644\u0642\u064A\u0645\u0629 {0} \u0644\u064A\u0633\u062A \u0645\u0641\u062A\u0627\u062D\u064B\u0627 \u0635\u0627\u0644\u062D\u064B\u0627 \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 {1}.
2038=\u064A\u0634\u062A\u0645\u0644 \u0637\u0644\u0628 \u0627\u0644\u0641\u0647\u0631\u0633 \u0639\u0644\u0649 \u0623\u0643\u062B\u0631 \u0645\u0646 {0} \u0645\u0646 \u0627\u0644\u0623\u0639\u0645\u062F\u0629.
2039=\u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u0643\u0648\u064A\u0646 \u0627\u0644\u0641\u0647\u0631\u0633 \u0641\u064A \u0645\u062D\u062A\u0648\u0649 \u0645\u0634\u0641\u0631. \u0644\u0627 \u064A\u064F\u0633\u0645\u062D \u0628\u0627\u0644\u0641\u0647\u0631\u0633\u0629 \u0625\u0644\u0627 \u0625\u0630\u0627 \u0643\u0627\u0646 \u062A\u0634\u0641\u064A\u0631 \u0639\u0645\u0648\u062F \u0627\u0644\u0645\u062D\u062A\u0648\u0649 \u0645\u0639\u064A\u0646\u064B\u0627 \u0639\u0644\u0649 NONE (\u0628\u0644\u0627).
2040=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 next() \u0641\u064A \u0645\u0624\u0634\u0631 \u0645\u063A\u0644\u0642.
2041=\u062D\u062F\u062B \u062E\u0637\u0623 \u0623\u062B\u0646\u0627\u0621 \u0645\u062D\u0627\u0648\u0644\u0629 \u0625\u0633\u0642\u0627\u0637 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629. \u062A\u0623\u0643\u062F \u0645\u0646 \u062A\u0646\u0641\u064A\u0630 \u0643\u0644 \u0639\u0645\u0644\u064A\u0627\u062A \u0627\u0644\u0643\u062A\u0627\u0628\u0629 \u0627\u0644\u0639\u0627\u0644\u0642\u0629 \u0641\u064A \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629.
2042=\u062A\u062A\u0637\u0644\u0628 \u0647\u0630\u0647 \u0627\u0644\u0639\u0645\u0644\u064A\u0629 \u0623\u0646 \u064A\u0628\u062F\u0623 SODA \u0639\u0645\u0644\u064A\u0629\u060C \u0648\u0644\u0643\u0646 \u062D\u062F\u062B \u062E\u0637\u0623 \u064A\u0639\u0637\u0644 \u0627\u0644\u062A\u062B\u0628\u064A\u062A \u0627\u0644\u062A\u0644\u0642\u0627\u0626\u064A \u0644\u0627\u062A\u0635\u0627\u0644 JDBC.
2043=\u0645\u0633\u062A\u0646\u062F \u0627\u0644\u0645\u0648\u0627\u0635\u0641\u0627\u062A {0} \u0644\u0627 \u064A\u0634\u062A\u0645\u0644 \u0639\u0644\u0649 \u0645\u062D\u062A\u0648\u064A\u0627\u062A \u0623\u0648 \u064A\u062A\u0636\u0645\u0646 \u0645\u062D\u062A\u0648\u0649 \u0641\u0627\u0631\u063A\u064B\u0627.
2045=\u064A\u062C\u0628 \u0623\u0644\u0627 \u062A\u0634\u062A\u0645\u0644 \u0645\u0648\u0627\u0635\u0641\u0629 \u0627\u0644\u0625\u0633\u0642\u0627\u0637 \u0639\u0644\u0649 \u0645\u0632\u064A\u062C \u0645\u0646 \u0642\u0648\u0627\u0639\u062F \u0627\u0644\u062A\u0636\u0645\u064A\u0646 \u0648\u0627\u0644\u0627\u0633\u062A\u0628\u0639\u0627\u062F.
2046=\u064A\u062C\u0628 \u0623\u0644\u0627 \u064A\u0634\u062A\u0645\u0644 \u0645\u0633\u0627\u0631 \u0641\u0647\u0631\u0633 \u0623\u0648 \u0634\u0631\u0637 \u062A\u0631\u062A\u064A\u0628 \u0639\u0644\u0649 \u062E\u0637\u0648\u0627\u062A \u0645\u0635\u0641\u0648\u0641\u0629.
2047=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u0627\u062A\u0635\u0627\u0644 OracleConnection \u0623\u0648 \u0628\u0631\u0646\u0627\u0645\u062C \u0639\u0632\u0644 \u0644\u0640 OracleConnection.
2048=\u0645\u0639\u0644\u0645\u0629 \u0627\u0644\u0644\u063A\u0629 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A \u0641\u0647\u0631\u0633 \u0646\u0635 12.1.0.2 Oracle Database.
2049=\u064A\u0639\u062A\u0645\u062F \u0627\u0644\u0648\u0636\u0639 \u0627\u0644\u0627\u0641\u062A\u0631\u0627\u0636\u064A \u0644\u0644\u0641\u0647\u0631\u0633 \u0627\u0644\u0648\u0638\u064A\u0641\u064A \u0639\u0644\u0649 \u0639\u0628\u0627\u0631\u0629 "null on empty" \u0644\u0640 json_value \u0627\u0644\u0645\u062F\u0639\u0648\u0645\u0629 \u0627\u0639\u062A\u0628\u0627\u0631\u064B\u0627 \u0645\u0646 \u0627\u0644\u0625\u0635\u062F\u0627\u0631 1.0.2.12 \u0645\u0646 Oracle Database. \u0648\u064A\u062A\u0645 \u062F\u0639\u0645 \u0627\u0644\u0648\u0636\u0639\u064A\u0646 "scalarRequired" \u0648"lax" \u0641\u064A \u0627\u0644\u0625\u0635\u062F\u0627\u0631 2.0.1.12. \u0645\u0644\u0627\u062D\u0638\u0629: \u0644\u0627 \u064A\u062A\u0645 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0641\u0647\u0627\u0631\u0633 "lax" \u0628\u0648\u0627\u0633\u0637\u0629 QBEs\u060C \u0648\u0645\u0646 \u062B\u0645 \u064A\u064F\u0646\u0635\u062D \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 "scalarRequired".
2050=\u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u062D\u062F\u064A\u062F "{0}" \u0644\u0641\u0647\u0631\u0633 2.0.1.12 Oracle Database \u0627\u0644\u0646\u0635\u064A.
2051=\u062A\u062A\u0637\u0644\u0628 \u0627\u0644\u0639\u0645\u0644\u064A\u0629 "{0}" \u0625\u062F\u0627\u0631\u0629 \u0627\u0644\u062D\u0631\u0643\u0627\u062A \u0639\u0646\u062F\u0645\u0627 \u064A\u0643\u0648\u0646 \u0627\u0644\u0627\u062A\u0635\u0627\u0644 \u0641\u064A \u0648\u0636\u0639 \u0627\u0644\u062A\u062B\u0628\u064A\u062A \u0627\u0644\u062A\u0644\u0642\u0627\u0626\u064A\u060C \u0648\u0644\u0643\u0646 \u0639\u0644\u0627\u0645\u0629 "avoidTxnManagement" \u0645\u0639\u064A\u0646\u0629 \u0625\u0644\u0649 true \u0641\u064A \u0637\u0628\u0639\u0629 OracleDatabase. \u064A\u062A\u0645 \u062A\u0639\u0637\u064A\u0644 \u0648\u0636\u0639 \u0627\u0644\u062A\u062B\u0628\u064A\u062A \u0627\u0644\u062A\u0644\u0642\u0627\u0626\u064A \u0644\u0644\u062A\u0645\u0643\u0646 \u0645\u0646 \u062A\u0646\u0641\u064A\u0630 \u0627\u0644\u0639\u0645\u0644\u064A\u0629.
2052=\u064A\u0645\u0643\u0646 \u062A\u062D\u062F\u064A\u062F keyLike() \u0641\u0642\u0637 \u0644\u0645\u062C\u0645\u0648\u0639\u0629 \u062A\u0634\u062A\u0645\u0644 \u0639\u0644\u0649 \u0645\u0641\u0627\u062A\u064A\u062D \u0645\u0639\u064A\u0646\u0629 \u0645\u0646 \u062C\u0627\u0646\u0628 \u0627\u0644\u0639\u0645\u064A\u0644 \u0648\u0639\u0644\u0649 \u0646\u0648\u0639 \u0639\u0645\u0648\u062F \u0645\u0641\u062A\u0627\u062D varchar2.
2053=\u064A\u0648\u062C\u062F \u0641\u0647\u0631\u0633 \u064A\u062D\u0645\u0644 \u0627\u0644\u0627\u0633\u0645 \u0627\u0644\u0645\u062D\u062F\u062F \u0627\u0644\u0645\u0648\u062C\u0648\u062F \u0641\u064A \u0627\u0644\u0645\u062E\u0637\u0637 \u0628\u0627\u0644\u0641\u0639\u0644.
2054=\u0627\u0644\u062A\u062E\u0637\u064A \u0623\u0648 \u0627\u0644\u062D\u062F \u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u0639\u064A\u064A\u0646\u0647 \u0644\u0639\u0645\u0644\u064A\u0629 \u062A\u0639\u062F\u0627\u062F.
2055=\u0627\u0644\u0645\u0639\u0644\u0645\u0629 textIndex121WithLang \u0627\u0644\u0645\u0639\u064A\u0646\u0629 \u0625\u0644\u0649 true \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A \u0625\u0635\u062F\u0627\u0631 \u0642\u0627\u0639\u062F\u0629 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0623\u062D\u062F\u062B \u0645\u0646 2.12.
2056=\u064A\u062C\u0628 \u0623\u0644\u0627 \u062A\u0634\u062A\u0645\u0644 \u0645\u0648\u0627\u0635\u0641\u0629 \u0627\u0644\u0625\u0633\u0642\u0627\u0637 \u0639\u0644\u0649 \u062E\u0637\u0648\u0627\u062A \u0645\u0635\u0641\u0648\u0641\u0629.
2057=\u0641\u064A \u0645\u0648\u0627\u0635\u0641\u0629 \u0625\u0633\u0642\u0627\u0637\u060C \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u062A\u062A\u0634\u0627\u0631\u0643 \u0627\u0644\u0645\u0633\u0627\u0631\u0627\u062A \u0641\u064A \u0628\u0627\u062F\u0626\u0629 \u0639\u0627\u0645\u0629.
2058=\u064A\u062A\u0639\u0630\u0631 \u062A\u062D\u062F\u064A\u062F \u0627\u0644\u0623\u0633\u0644\u0648\u0628 {0} \u0628\u0627\u0644\u062A\u0632\u0627\u0645\u0646 \u0645\u0639 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 {1}.
2059=\u062D\u062F\u062B \u062E\u0637\u0623 \u0623\u062B\u0646\u0627\u0621 \u062A\u062D\u0648\u064A\u0644 \u0645\u062D\u062A\u0648\u0649 JSON \u0641\u064A \u0645\u0633\u062A\u0646\u062F \u0627\u0644\u0625\u062F\u062E\u0627\u0644 \u0625\u0644\u0649 \u062B\u0646\u0627\u0626\u064A. \u062A\u0623\u0643\u0651\u062F \u0645\u0646 \u0623\u0646\u0651\u064E \u0645\u062D\u062A\u0648\u0649 \u0645\u0633\u062A\u0646\u062F \u0627\u0644\u0625\u062F\u062E\u0627\u0644 \u0647\u0648 JSON \u0635\u0627\u0644\u062D.
2060=\u062D\u062F\u062B \u062E\u0637\u0623 \u0623\u062B\u0646\u0627\u0621 \u062A\u062D\u0648\u064A\u0644 JSON \u0627\u0644\u062B\u0646\u0627\u0626\u064A \u0625\u0644\u0649 JSON \u0646\u0635\u064A.
2061=\u0627\u0644\u0645\u0633\u0627\u0631 \u0627\u0644\u0645\u062D\u062F\u062F \u0644\u0645\u0641\u062A\u0627\u062D \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u063A\u064A\u0631 \u0635\u0627\u0644\u062D.
2062=\u062A\u0639\u0630\u0631 \u0627\u0633\u062A\u062E\u0631\u0627\u062C \u0627\u0644\u0645\u0633\u0627\u0631 \u0645\u0646 \u0627\u0644\u0645\u0633\u062A\u0646\u062F.
2063=\u062A\u0639\u0630\u0631 \u0625\u062F\u0631\u0627\u062C \u0627\u0644\u0645\u0633\u0627\u0631 \u0641\u064A \u0627\u0644\u0645\u0633\u062A\u0646\u062F.
2064=\u064A\u0646\u0628\u063A\u064A \u0639\u062F\u0645 \u062A\u062D\u062F\u064A\u062F \u0627\u0644\u062A\u062D\u0642\u0642 \u0645\u0646 \u0627\u0644\u0635\u062D\u0629 \u0639\u0646\u062F\u0645\u0627 \u064A\u0643\u0648\u0646 contentColumn.sqlType \u0639\u0628\u0627\u0631\u0629 \u0639\u0646 JSON.

#
# Internal errors  (2500 to 2999 error code range)
#
2500=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u062A\u0634\u062A\u0645\u0644 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 {0} \u0639\u0644\u0649 \u0645\u062D\u062A\u0648\u0649 \u062B\u0646\u0627\u0626\u064A \u0628\u0646\u0648\u0639 \u0627\u0644\u0639\u0645\u0648\u062F {1}.
2501=\u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 {0} \u062A\u0633\u062A\u062E\u062F\u0645 \u062A\u0639\u064A\u064A\u0646 \u0627\u0644\u0625\u0635\u062F\u0627\u0631 {1}\u060C \u063A\u064A\u0631 \u0645\u0633\u0645\u0648\u062D \u0628\u0643\u062A\u0627\u0628\u0627\u062A \u0627\u0644\u062A\u062F\u0641\u0642.
2502=\u0641\u0634\u0644 \u062D\u0641\u0638 \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0641\u064A \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 {0}.
2503=\u0641\u0634\u0644 \u0625\u062F\u0631\u0627\u062C \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0641\u064A \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 {0}.
2504=\u064A\u062A\u0639\u0630\u0631 \u0625\u0646\u0634\u0627\u0621 \u0645\u0641\u062A\u0627\u062D \u064A\u0633\u062A\u0646\u062F \u0625\u0644\u0649 UUID.
2505=\u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0630\u0648 \u0627\u0644\u0645\u0641\u062A\u0627\u062D {0} \u062D\u062C\u0645\u0647 {1}\u060C \u0648\u0647\u0648 \u064A\u062A\u062C\u0627\u0648\u0632 \u062D\u062F 2 \u062C\u064A\u062C\u0627\u0628\u0627\u064A\u062A.
2506=\u062A\u0639\u064A\u064A\u0646 \u0645\u0641\u062A\u0627\u062D IDENTITY \u064A\u062A\u0637\u0644\u0628 \u062F\u0639\u0645 RETURNING \u0641\u064A SQL.
2507=\u062D\u062F\u062B \u062E\u0637\u0623 \u0623\u064B\u062B\u0646\u0627\u0621 \u0627\u0644\u062D\u0635\u0648\u0644 \u0639\u0644\u0649 \u0625\u0635\u062F\u0627\u0631 \u0642\u0627\u0639\u062F\u0629 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=\u0627\u0644\u0642\u0637\u0639 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u060C \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0629 {0} \u063A\u064A\u0631 \u0645\u0633\u062A\u0646\u062F\u0629 \u0625\u0644\u0649 \u0627\u0644\u062C\u062F\u0648\u0644.
3001=\u0644\u0645 \u064A\u062A\u0645 \u062A\u0637\u0628\u064A\u0642 \u0641\u0647\u0631\u0633 \u0628\u062D\u062B JSON \u0639\u0644\u0649 \u0623\u0639\u0645\u062F\u0629 \u0627\u0644\u0645\u062D\u062A\u0648\u0649 \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 {0}.
3002=\u0644\u0645 \u064A\u062A\u0645 \u062A\u0637\u0628\u064A\u0642 \u0641\u0647\u0631\u0633 \u0628\u062D\u062B JSON \u0639\u0644\u0649 \u0643\u0644 \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0627\u062A \u0630\u0627\u062A \u0645\u0641\u0627\u062A\u064A\u062D NVARCHAR2.
3003=\u062C\u0647\u0627\u0632 \u062C\u0627\u0641\u0627 \u0627\u0644\u0638\u0627\u0647\u0631\u064A (JVM) \u0644\u0627 \u064A\u062F\u0639\u0645 \u0645\u0646\u0648\u0627\u0644 \u062A\u0639\u064A\u064A\u0646 \u0625\u0635\u062F\u0627\u0631 MD5. \u0642\u0645 \u0628\u0627\u0644\u062A\u0628\u062F\u064A\u0644 \u0625\u0644\u0649 \u0645\u0646\u0648\u0627\u0644 \u062A\u0639\u064A\u064A\u0646 \u0625\u0635\u062F\u0627\u0631 \u0622\u062E\u0631.
3004=\u062C\u0647\u0627\u0632 \u062C\u0627\u0641\u0627 \u0627\u0644\u0638\u0627\u0647\u0631\u064A (JVM) \u0644\u0627 \u064A\u062F\u0639\u0645 \u0645\u0646\u0648\u0627\u0644 \u062A\u0639\u064A\u064A\u0646 \u0625\u0635\u062F\u0627\u0631 SHA256. \u0642\u0645 \u0628\u0627\u0644\u062A\u0628\u062F\u064A\u0644 \u0625\u0644\u0649 \u0645\u0646\u0648\u0627\u0644 \u062A\u0639\u064A\u064A\u0646 \u0625\u0635\u062F\u0627\u0631 \u0622\u062E\u0631.
3005=\u0627\u0644\u0633\u0645\u0629 \u063A\u064A\u0631 \u0645\u0646\u0641\u0630\u0629.
3006=\u0641\u0647\u0631\u0633\u0629 JSON \u0627\u0644\u0645\u0643\u0627\u0646\u064A\u0629 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0627\u062A \u063A\u064A\u0631 \u0627\u0644\u0645\u062A\u062C\u0627\u0646\u0633\u0629.
3007=\u0641\u0647\u0631\u0633\u0629 JSON \u0644\u0644\u0628\u062D\u062B \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0627\u062A \u063A\u064A\u0631 \u0627\u0644\u0645\u062A\u062C\u0627\u0646\u0633\u0629.
3008=\u0641\u0647\u0631\u0633\u0629 JSON \u0627\u0644\u0648\u0638\u064A\u0641\u064A\u0629 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0627\u062A \u063A\u064A\u0631 \u0627\u0644\u0645\u062A\u062C\u0627\u0646\u0633\u0629.
3009=\u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645 \u062D\u0633\u0628 \u0627\u0644\u0645\u062B\u0627\u0644 (QBE) \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0641\u064A \u0627\u0644\u0645\u062C\u0645\u0648\u0639\u0627\u062A \u063A\u064A\u0631 \u0627\u0644\u0645\u062A\u062C\u0627\u0646\u0633\u0629.
