#
# Copyright (c) 2014, 2018, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=A recolha {0} \u00E9 s\u00F3 de leitura; {1} n\u00E3o permitido.
2001=A recolha {0} n\u00E3o tem indica\u00E7\u00E3o de data/hora da \u00FAltima modifica\u00E7\u00E3o.
2002=A condi\u00E7\u00E3o de filtragem \u00E9 inv\u00E1lida.
2003=O descritor n\u00E3o corresponde \u00E0 recolha existente.
2004=N\u00E3o \u00E9 poss\u00EDvel que o argumento {0} seja nulo.
2005={0} definido est\u00E1 vazio.
2006=N\u00E3o \u00E9 poss\u00EDvel que os argumentos ''since'' e ''until'' sejam ambos nulos.
2007=A recolha {0} n\u00E3o tem nenhuma vers\u00E3o.
2008=\u00C9 necess\u00E1rio que o argumento {0} seja positivo.
2009=O n\u00FAmero total de chaves especificadas com os m\u00E9todos key(), keys() ou filter() \u00E9 {0}, o que excede o limite m\u00E1ximo de {1}.
2010=O iterador {0} devolveu um valor nulo, depois de devolver {1} documentos.
2011=Valor do argumento inv\u00E1lido "{0}".
2012=N\u00E3o \u00E9 poss\u00EDvel definir um comprimento m\u00E1ximo para os tipos de LOB.
2013=N\u00E3o \u00E9 poss\u00EDvel utilizar as defini\u00E7\u00F5es de LOB de SecureFile quando o tipo de coluna de conte\u00FAdo \u00E9 "{0}"
2014=S\u00F3 \u00E9 poss\u00EDvel definir o \u00EDndice de \u00FAltimas colunas modificadas quando o nome da \u00FAltima coluna modificada for definido.
2015=Se o m\u00E9todo de atribui\u00E7\u00E3o for "SEQUENCE", \u00E9 necess\u00E1rio especificar um nome de sequ\u00EAncia de colunas chave.
2016=Foi especificado um m\u00E9todo de vers\u00E3o, mas o nome da coluna da vers\u00E3o n\u00E3o foi especificado.
2017=N\u00E3o \u00E9 poss\u00EDvel utilizar o tipo de coluna chave especificado com um comprimento m\u00E1ximo.
2018=Quando for utilizada a GUID ou UUID para atribuir valores de chaves do tipo car\u00E1cter, \u00E9 necess\u00E1rio que o comprimento da coluna chave seja de 32 bytes ou superior.
2019=N\u00E3o \u00E9 poss\u00EDvel que a recolha tenha uma coluna do tipo de suporte, a menos que o tipo de coluna de conte\u00FAdo seja BLOB.
2020=O tipo de suporte do documento n\u00E3o \u00E9 "application/json". getContentAsString() s\u00F3 \u00E9 suportado para documentos JSON.
2021={0} definido cont\u00E9m um valor nulo.
2022=\u00C9 necess\u00E1rio especificar a chave do documento para substitui\u00E7\u00E3o atrav\u00E9s da utiliza\u00E7\u00E3o do m\u00E9todo key().
2023=\u00C9 necess\u00E1rio que o argumento {0} seja n\u00E3o negativo.
2024=Especifica\u00E7\u00E3o de cria\u00E7\u00E3o do \u00EDndice inv\u00E1lida.
2025=Especifica\u00E7\u00E3o de supress\u00E3o do \u00EDndice inv\u00E1lida.
2026=O documento de metadados da recolha n\u00E3o tem conte\u00FAdo ou tem conte\u00FAdo vazio.
2027=O documento de metadados da recolha n\u00E3o \u00E9 JSON v\u00E1lido.
2028=O documento de metadados da recolha n\u00E3o \u00E9 JSON v\u00E1lido; n\u00E3o foi poss\u00EDvel determinar a codifica\u00E7\u00E3o.
2029=Ocorr\u00EAncia de IOException no processamento do documento de metadados da recolha.
2030=Valor inv\u00E1lido para "{0}" nos metadados da recolha.
2031=\u00C9 necess\u00E1rio que os metadados da recolha sejam um objeto de JSON.
2032=A chave do objeto "{0}" \u00E9 inesperada nos metadados da recolha.
2033=A recolha n\u00E3o est\u00E1 configurada com chaves atribu\u00EDdas pelo cliente, mas o documento de entrada de dados tem uma chave.
2034=A recolha n\u00E3o est\u00E1 configurada com uma chave atribu\u00EDda pelo cliente, mas o iterador {0} devolveu um documento com uma chave, depois de devolver {1} documentos.
2035=getCurrentSchema() invocado na liga\u00E7\u00E3o de JDBC fornecida devolveu um valor nulo.
2036=Especifica\u00E7\u00E3o da proje\u00E7\u00E3o inv\u00E1lida.
2037=O valor {0} n\u00E3o \u00E9 uma chave v\u00E1lida do tipo {1}.
2038=O pedido de \u00EDndice tem mais de {0} colunas.
2039=N\u00E3o \u00E9 poss\u00EDvel criar o \u00EDndice em conte\u00FAdo codificado. A indexa\u00E7\u00E3o s\u00F3 \u00E9 permitida se a codifica\u00E7\u00E3o das colunas de conte\u00FAdo estiver definida como NONE.
2040=next() n\u00E3o pode ser chamado num cursor fechado.
2041=Erro ao tentar suprimir a recolha. Certifique-se de que todas as escritas pendentes na recolha foram confirmadas.
2042=Esta opera\u00E7\u00E3o requer que SODA inicie uma transa\u00E7\u00E3o, mas ocorre um erro ao desativar a confirma\u00E7\u00E3o autom\u00E1tica da liga\u00E7\u00E3o de JDBC.
2043=O documento de especifica\u00E7\u00E3o {0} n\u00E3o tem conte\u00FAdo ou tem conte\u00FAdo vazio.
2045=A especifica\u00E7\u00E3o da proje\u00E7\u00E3o n\u00E3o deve conter uma mistura de regras de inclus\u00E3o e exclus\u00E3o.
2046=O percurso para um \u00EDndice ou condi\u00E7\u00E3o Ordenar por n\u00E3o deve conter passos da matriz.
2047=A liga\u00E7\u00E3o deve ser uma OracleConnection ou um wrapper para uma OracleConnection.
2048=O par\u00E2metro de l\u00EDngua n\u00E3o \u00E9 suportado com um \u00EDndice de texto do Oracle Database 12.1.0.2.
2049=O modo de \u00EDndice funcional por omiss\u00E3o depende da cl\u00E1usula "null on empty" de json_value suportada a partir da release 12.2.0.1 do Oracle Database. Os modos "scalarRequired" e "lax" s\u00E3o suportados na 12.1.0.2. Nota: os \u00EDndices "lax" n\u00E3o s\u00E3o utilizados por QBEs, pelo que \u00E9 recomendado "scalarRequired".
2050="{0}" n\u00E3o pode ser especificado para um \u00EDndice de texto do Oracle Database 12.1.0.2.
2051=A opera\u00E7\u00E3o "{0}" requer a gest\u00E3o de transa\u00E7\u00F5es quando a liga\u00E7\u00E3o est\u00E1 no modo de confirma\u00E7\u00E3o autom\u00E1tica, mas o indicador "avoidTxnManagement" est\u00E1 definido como true na inst\u00E2ncia OracleDatabase. Desative o modo de confirma\u00E7\u00E3o autom\u00E1tica para executar a opera\u00E7\u00E3o.
2052=keyLike() s\u00F3 pode ser especificado para uma recolha com chaves atribu\u00EDdas pelo cliente e um tipo de coluna de chave varchar2.
2053=J\u00E1 existe um \u00EDndice com o nome especificado no schema.
2054=skip ou limit n\u00E3o podem ser definidos para uma opera\u00E7\u00E3o de contagem.
2055=O par\u00E2metro textIndex121WithLang definido como true n\u00E3o \u00E9 suportado nas releases da base de dados superiores \u00E0 12.2.
2056=A especifica\u00E7\u00E3o da proje\u00E7\u00E3o n\u00E3o deve conter passos da matriz.
2057=Numa especifica\u00E7\u00E3o da proje\u00E7\u00E3o, os percursos n\u00E3o podem partilhar um prefixo comum.

#
# Internal errors  (2500 to 2999 error code range)
#
2500=N\u00E3o \u00E9 poss\u00EDvel que a recolha {0} tenha conte\u00FAdo bin\u00E1rio no tipo de coluna {1}.
2501=A recolha {0} utiliza a cria\u00E7\u00E3o de vers\u00F5es {1}; a transmiss\u00E3o em fluxo de escritas n\u00E3o \u00E9 permitida.
2502=Falha na grava\u00E7\u00E3o do documento na recolha {0}.
2503=Falha na inser\u00E7\u00E3o do documento na recolha {0}.
2504=Incapaz de gerar a chave baseada na UUID.
2505=O documento com a chave {0} tem o tamanho {1}, o que excede o limite de 2 GB.
2506=A atribui\u00E7\u00E3o da chave IDENTITY requer suporte de RETURNING no SQL.
2507=Erro ao obter a vers\u00E3o da base de dados.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Truncamento n\u00E3o suportado; a recolha {0} n\u00E3o \u00E9 baseada na tabela.
3001=O \u00EDndice de pesquisa de JSON n\u00E3o est\u00E1 implementado para colunas de conte\u00FAdo com o tipo {0}.
3002=O \u00EDndice de pesquisa de JSON n\u00E3o est\u00E1 implementado para recolhas com chaves NVARCHAR2.
3003=O Java Virtual Machine (JVM) n\u00E3o suporta o algoritmo de cria\u00E7\u00E3o de vers\u00F5es MD5. Mude para outro algoritmo de cria\u00E7\u00E3o de vers\u00F5es.
3004=O Java Virtual Machine (JVM) n\u00E3o suporta o algoritmo de cria\u00E7\u00E3o de vers\u00F5es SHA256. Mude para outro algoritmo de cria\u00E7\u00E3o de vers\u00F5es.
3005=A funcionalidade n\u00E3o est\u00E1 implementada.
3006=A indexa\u00E7\u00E3o espacial de JSON n\u00E3o \u00E9 suportada em recolhas heterog\u00E9neas.
3007=A indexa\u00E7\u00E3o de pesquisa de JSON n\u00E3o \u00E9 suportada em recolhas heterog\u00E9neas.
3008=A indexa\u00E7\u00E3o funcional de JSON n\u00E3o \u00E9 suportada em recolhas heterog\u00E9neas.
3009=A Consulta por exemplo (QBE) n\u00E3o \u00E9 suportada em recolhas heterog\u00E9neas.
