#
# Copyright (c) 2014, 2020, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Samlingen {0} er skrivebeskyttet. {1} er ikke tillatt.
2001=Samlingen {0} har ikke noe tidsstempel som angir n\u00E5r den sist ble endret.
2002=Ugyldig filterbetingelse.
2003=Deskriptoren samsvarer ikke med den eksisterende samlingen.
2004=Argumentet {0} kan ikke v\u00E6re null.
2005=Settet {0} er tomt.
2006=Begge argumentene SINCE og UNTIL kan ikke v\u00E6re null.
2007=Samlingen {0} har ikke noen versjon.
2008=Argumentet {0} m\u00E5 v\u00E6re positivt.
2009=Totalt antall n\u00F8kler angitt ved hjelp av metodene key(), keys() eller filter(), er {0}, som overskrider maksimumsgrensen p\u00E5 {1}.
2010=Iteratoren {0} returnerte null etter \u00E5 ha returnert {1} dokumenter.
2011=Ugyldig argumentverdi {0}.
2012=Kan ikke angi en maksimumslengde for LOB-typer eller JSON-typen.
2013=Kan ikke bruke LOB-innstillinger for SecureFile n\u00E5r innholdskolonnetypen er {0}
2014=Kan bare angi indeksen for sist endret-kolonnen n\u00E5r navnet p\u00E5 sist endret-kolonnen er angitt.
2015=Hvis tilordningsmetoden er SEQUENCE, m\u00E5 du angi et navn p\u00E5 n\u00F8kkelkolonnesekvensen.
2016=Det ble angitt en versjonsmetode, men versjonskolonnenavnet er uspesifisert.
2017=Kan ikke bruke den angitte n\u00F8kkelkolonnetypen med en maksimumslengde.
2018=N\u00E5r du bruker GUID eller UUID n\u00E5r du skal tilordne n\u00F8kkelverdier for tegntyper, m\u00E5 n\u00F8kkelkolonnelengden v\u00E6re 32 byte eller mer.
2019=Samlingen kan ikke ha en medietypekolonne med mindre innholdskolonnetypen er BLOB.
2020=Medietypen for dokumentet er ikke application/json. getContentAsString() st\u00F8ttes bare for JSON-dokumenter.
2021=Settet {0} inneholder null.
2022=N\u00F8kkelen for dokumentet som skal erstattes, m\u00E5 angis med metoden key().
2023=Argumentet {0} m\u00E5 v\u00E6re ikke-negativt.
2024=Ugyldig angivelse for indeksopprettelse.
2025=Ugyldig angivelse for indeksutelatelse.
2026=Metadatadokumentet for samlingen har ikke noe innhold eller har tomt innhold.
2027=Metadatadokumentet for samlingen er ikke gyldig JSON.
2028=Metadatadokumentet for samlingen er ikke gyldig JSON. Kan ikke fastsl\u00E5 kodingen.
2029=IOException oppstod under behandlingen av metadatadokumentet for samlingen.
2030=Ugyldig verdi for {0} i metadataene for samlingen.
2031=Metadataene for samlingen m\u00E5 v\u00E6re et JSON-objekt.
2032=Objektn\u00F8kkelen {0} er uventet i metadataene for samlingen.
2033=Samlingen er ikke konfigurert med klienttilordnede n\u00F8kler, men inndatadokumentet har en n\u00F8kkel.
2034=Samlingen er ikke konfigurert med en klienttilordnet n\u00F8kkel, men {0} iterator returnerte et dokument med en n\u00F8kkel etter \u00E5 ha returnert {1} dokumenter.
2035=getCurrentSchema() startet p\u00E5 den angitte JDBC-tilkoblingen, returnerte null.
2036=Ugyldig projiseringsangivelse.
2037=Verdien {0} er ikke en gyldig n\u00F8kkel av typen {1}.
2038=Indeksforesp\u00F8rselen har flere enn {0} kolonner.
2039=Kan ikke opprette indeks for kryptert innhold. Indeksering er bare tillatt hvis innholdskolonnekryptering er angitt som NONE.
2040=next() kan ikke kalles i en lukket mark\u00F8r.
2041=Det oppstod en feil under fors\u00F8ket p\u00E5 \u00E5 fjerne samlingen. Kontroller at alle utest\u00E5ende skrivinger til samlingen er lagret.
2042=For denne operasjonen er det n\u00F8dvendig at SODA starter en transaksjon, men det finnes en feil som deaktiverer automatisk lagring for JDBC-tilkoblingen.
2043=Dokumentet med spesifikasjon av {0} har ikke noe innhold eller har tomt innhold.
2045=Projiseringsangivelse kan ikke inneholde en blanding av inkluderings- og utelatelsesregler.
2046=Banen for en indeks- eller sorteringsbetingelse kan ikke inneholde matrisetrinn.
2047=Tilkoblingen m\u00E5 v\u00E6re en OracleConnection eller en innpakker for en OracleConnection.
2048=Spr\u00E5kparameteren st\u00F8ttes ikke med en tekstindeks for 12.1.0.2 Oracle Database.
2049=Standard funksjonell indeksmodus er avhengig av null on empty-leddet json_value som st\u00F8ttes fra og med versjon 12.2.0.1 Oracle Database. scalarRequired- og lax-moduser st\u00F8ttes p\u00E5 12.1.0.2. Merk: lax-indekser brukes ikke av QBE-er, s\u00E5 scalarRequired anbefales.
2050={0} kan ikke angis for en tekstindeks for 12.1.0.2 Oracle Database.
2051=Operasjonen {0} krever transaksjonsadministrasjon n\u00E5r tilkoblingen er i autobekreftelsesmodus, men flagget avoidTxnManagement er satt til sann p\u00E5 OracleDatabase-forekomsten. Deaktiver autobekreftelsesmodus for \u00E5 utf\u00F8re operasjonen.
2052=keyLike() kan bare angis for en samling med klienttilordnede n\u00F8kler og en n\u00F8kkelkolonne av typen varchar2.
2053=Det finnes allerede en indeks med det angitte navnet i skjemaet.
2054=overhopping eller begrensning kan ikke angis for en telleoperasjon.
2055=Parameteren textIndex121WithLang satt til sann st\u00F8ttes ikke p\u00E5 databaseversjoner over 12.2.
2056=Projiseringsangivelse kan ikke inneholde matrisetrinn.
2057=Baner kan ikke dele et felles prefiks i en projiseringsangivelse.
2058=Metoden {0} kan ikke angis sammen med metoden {1}.
2059=Det oppstod en feil ved konvertering av inndatadokumentets JSON-innhold til bin\u00E6r. Kontroller at innholdet i inndatadokumentet er gyldig JSON.
2060=Det oppstod en feil ved konvertering av bin\u00E6r JSON til tekst-JSON.
2061=Banen som er angitt for dokumentn\u00F8kkelen, er ugyldig.
2062=Kan ikke trekke ut banen fra dokumentet.
2063=Kan ikke sette inn banen i dokumentet.
2064=Validering skal ikke angis n\u00E5r contentColumn.sqlType er JSON.
2065=Typen st\u00F8ttes ikke: {0}
2066=Tipset {0} er ikke av typen Streng, eller det inneholder /* eller */.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=Samlingen {0} kan ikke ha bin\u00E6rt innhold i kolonnetypen {1}.
2501=Samlingen {0} bruker {1}-versjonskontroll. Det er ikke tillatt \u00E5 str\u00F8mme skrivinger.
2502=Lagringen av dokumentet i samlingen {0} mislyktes.
2503=Innsettingen av dokumentet i samlingen {0} mislyktes.
2504=Kan ikke generere UUID-basert n\u00F8kkel.
2505=Dokumentet med n\u00F8kkelen {0} har st\u00F8rrelsen {1}, som overskrider grensen p\u00E5 2 GB.
2506=N\u00F8kkeltilordningen IDENTITY m\u00E5 ha st\u00F8tte for RETURNING i SQL.
2507=Feil ved henting av databaseversjon.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Avkorting st\u00F8ttes ikke. Samlingen {0} er ikke tabellbasert.
3001=JSON-s\u00F8keindeks er ikke implementert for innholdskolonner med typen {0}.
3002=JSON-s\u00F8keindeks er ikke implementert for samlinger med NVARCHAR2-n\u00F8kler.
3003=Java Virtual Machine (JVM) st\u00F8tter ikke versjonskontrollalgoritmen MD5. Bytt til en annen versjonskontrollalgoritme.
3004=Java Virtual Machine (JVM) st\u00F8tter ikke versjonskontrollalgoritmen SHA256. Bytt til en annen versjonskontrollalgoritme.
3005=Funksjonen er ikke implementert.
3006=Flerdimensjonal JSON-indeksering st\u00F8ttes ikke for heterogene samlinger.
3007=JSON-s\u00F8keindeksering st\u00F8ttes ikke for heterogene samlinger.
3008=Funksjonell JSON-indeksering st\u00F8ttes ikke for heterogene samlinger.
3009=Eksempelsp\u00F8rring (QBE) st\u00F8ttes ikke for heterogene samlinger.
