#
# Copyright (c) 2014, 2016, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Samlingen {0} \u00E4r skrivskyddad. {1} till\u00E5ts inte.
2001=Samlingen {0} har ingen tidsst\u00E4mpel som indikerar n\u00E4r den senast \u00E4ndrades.
2002=Ogiltigt filtervillkor.
2003=Deskriptorn matchar inte befintlig samling.
2004=Argumentet {0} kan inte vara null.
2005=Upps\u00E4ttningen {0} \u00E4r tom.
2006=Argumentet "since" och argumentet "until" kan inte b\u00E5da vara null.
2007=Samlingen {0} har ingen version.
2008=Argumentet {0} m\u00E5ste vara positivt.
2009=Det totala antalet nycklar som angetts med n\u00E5gon av metoderna key(), keys() och filter() \u00E4r {0}, vilket \u00F6verskrider den st\u00F6rsta gr\u00E4nsen p\u00E5 {1}.
2010=Iteratorn {0} returnerade null efter att ha returnerat {1} dokument.
2011=Ogiltigt argumentv\u00E4rde, "{0}".
2012=Det g\u00E5r inte att konfigurera en maximal l\u00E4ngd f\u00F6r LOB-typer.
2013=LOB-inst\u00E4llningar f\u00F6r SecureFile kan inte anv\u00E4ndas n\u00E4r inneh\u00E5llskolumntypen \u00E4r "{0}"
2014=Indexet f\u00F6r den senast-\u00E4ndrade kolumnen kan bara konfigureras n\u00E4r namnet p\u00E5 den senast \u00E4ndrade kolumnen har angetts.
2015=Om tilldelningsmetoden \u00E4r "SEQUENCE" m\u00E5ste ett nyckelkolumnssekvensnamn anges.
2016=En versionsmetod angavs men versionskolumnnamnet har inte angetts.
2017=Den angivna nyckelkolumntypen kan inte anv\u00E4ndas med en st\u00F6rsta l\u00E4ngd.
2018=Om du anv\u00E4nder GUID eller UUID f\u00F6r att tilldela nyckelv\u00E4rden f\u00F6r teckentyper m\u00E5ste nyckelkolumnens l\u00E4ngd vara 32 byte eller st\u00F6rre.
2019=Samlingen kan inte ha en medietypkolumn om inte inneh\u00E5llskolumntypen \u00E4r BLOB.
2020=Dokumentets medietyp \u00E4r inte "application/json". getContentAsString() st\u00F6ds bara f\u00F6r JSON-dokument.
2021=Upps\u00E4ttningen {0} inneh\u00E5ller null.
2022=Nyckeln f\u00F6r dokumentet som ska ers\u00E4ttas m\u00E5ste anges med key()-metoden.
2023=Argumentet {0} m\u00E5ste vara icke-negativt.
2024=Ogiltig specifikation f\u00F6r skapande av index.
2025=Ogiltig specifikation f\u00F6r borttagning av index.
2026=Samlingsmetadatadokumentet har inget eller tomt inneh\u00E5ll.
2027=Samlingsmetadatadokumentet \u00E4r inte i ett giltigt JSON-format.
2028=Samlingsmetadatadokumentet \u00E4r inte i ett giltigt JSON-format. Kodningen kunde inte fastst\u00E4llas.
2029=Ett IOException intr\u00E4ffade under bearbetning av samlingsmetadatadokumentet.
2030=Ogiltigt v\u00E4rde f\u00F6r "{0}" i samlingsmetadata.
2031=Samlingsmetadata m\u00E5ste vara ett JSON-objekt.
2032=Objektnyckeln "{0}" f\u00F6rv\u00E4ntades inte i samlingsmetadata.
2033=Samlingen \u00E4r inte konfigurerad med klienttilldelade nycklar men indatadokumentet har en nyckel.
2034=Samlingen \u00E4r inte konfigurerad med en klienttilldelad nyckel men iteratorn {0} returnerade ett dokument med en nyckel efter att ha returnerat {1} dokument.
2035=getCurrentSchema() som anropades p\u00E5 den tillhandah\u00E5llna JDBC-anslutningen returnerade null.
2036=Ogiltig projektionsspecifikation.
2037=V\u00E4rdet {0} \u00E4r inte en giltig nyckel av typen {1}.
2038=Indexbeg\u00E4ran har fler \u00E4n {0} kolumner.
2039=Index kan inte skapas p\u00E5 krypterat inneh\u00E5ll. Indexering \u00E4r endast till\u00E5ten om inneh\u00E5llskolumnkrypteringen har v\u00E4rdet NONE.
2040=next() kan inte anropas f\u00F6r en st\u00E4ngd mark\u00F6r.
2041=Fel vid f\u00F6rs\u00F6k att ta bort samlingen. Kontrollera att alla utest\u00E5ende skrivningar till samlingen har bekr\u00E4ftats.
2042=Den h\u00E4r \u00E5tg\u00E4rden kr\u00E4ver SODA f\u00F6r att starta en transaktion men ett fel intr\u00E4ffade vid avaktivering av automatisk bekr\u00E4ftelse f\u00F6r JDBC-anslutningen.
2043=Prognosspecifikationsdokumentet har inget eller tomt inneh\u00E5ll.
2044=Dokumentet med programfixspecifikationen har inget eller tomt inneh\u00E5ll.
2045=Projektspecifikationen ska inte inneh\u00E5lla en blandning av inkluderings- och exkluderingsregler.
#
# Internal errors  (2500 to 2999 error code range)
#
2500=Samlingen {0} kan inte ha bin\u00E4rt inneh\u00E5ll i kolumntypen {1}.
2501=Samlingen {0} anv\u00E4nder {1}-versionshantering. Str\u00F6mmande skrivningar \u00E4r inte till\u00E5tna.
2502=Kunde inte spara dokument i samlingen {0}.
2503=Kunde inte infoga dokument i samlingen {0}.
2504=Kan inte generera UUID-baserad nyckel.
2505=Dokumentet med nyckeln {0} har storleken {1}, vilket \u00F6verskrider gr\u00E4nsen p\u00E5 2 Gbyte.
2506=IDENTITY-nyckeltilldelning kr\u00E4ver RETURNING-st\u00F6d i SQL.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Kapning st\u00F6ds inte. Samlingen {0} \u00E4r inte tabellbaserad.
3001=indexAll \u00E4r inte implementerat f\u00F6r inneh\u00E5llskolumner av typen {0}.
3002=indexAll \u00E4r inte implementerat f\u00F6r samlingar med NVARCHAR2-nycklar.
3003=Java Virtual Machine (JVM) st\u00F6der inte MD5-versionshanteringsalgoritm. V\u00E4xla till en annan versionshanteringsalgoritm.
3004=Java Virtual Machine (JVM) st\u00F6der inte SHA256-versionshanteringsalgoritm. V\u00E4xla till en annan versionshanteringsalgoritm.
3005=Funktionen \u00E4r inte implementerad.
