#
# Copyright (c) 2014, 2016, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Kolekce {0} je pouze pro \u010Dten\u00ED, {1} nepovoleno.
2001=Kolekce {0} nem\u00E1 \u017E\u00E1dnou \u010Dasovou zna\u010Dku s informac\u00ED o posledn\u00ED \u00FAprav\u011B.
2002=Neplatn\u00E1 podm\u00EDnka filtru.
2003=Deskriptor neodpov\u00EDd\u00E1 existuj\u00EDc\u00ED kolekci.
2004=Argument {0} nesm\u00ED m\u00EDt hodnotu null.
2005=Sada {0} je pr\u00E1zdn\u00E1.
2006=Argumenty "od" a "do" nesm\u00ED m\u00EDt oba hodnotu null.
2007=Kolekce {0} nem\u00E1 \u017E\u00E1dnou verzi.
2008=Argument {0} mus\u00ED b\u00FDt kladn\u00FD.
2009=Celkov\u00FD po\u010Det kl\u00ED\u010D\u016F zadan\u00FDch pomoc\u00ED metod key(), keys() nebo filter() je {0}, co\u017E p\u0159esahuje maxim\u00E1ln\u00ED limit {1}.
2010=Iter\u00E1tor {0} vr\u00E1til hodnotu null po vr\u00E1cen\u00ED {1} dokument\u016F.
2011=Neplatn\u00E1 hodnota argumentu "{0}".
2012=Pro typy LOB nelze nastavit maxim\u00E1ln\u00ED d\u00E9lku.
2013=Nastaven\u00ED objekt\u016F SecureFile LOB nelze pou\u017E\u00EDt, pokud je typ obsahu sloupce "{0}"
2014=Index naposledy zm\u011Bn\u011Bn\u00E9ho sloupce lze nastavit, pouze pokud je nastaven n\u00E1zev naposledy zm\u011Bn\u011Bn\u00E9ho sloupce.
2015=Pokud je metoda p\u0159i\u0159azen\u00ED "SEQUENCE", mus\u00ED b\u00FDt zad\u00E1n n\u00E1zev po\u0159ad\u00ED kl\u00ED\u010Dov\u00E9ho sloupce.
2016=Byla zad\u00E1na metoda verze, ale nen\u00ED zad\u00E1n n\u00E1zev sloupce verze.
2017=Pro zadan\u00FD typ kl\u00ED\u010Dov\u00E9ho sloupce nelze pou\u017E\u00EDt maxim\u00E1ln\u00ED d\u00E9lku.
2018=P\u0159i pou\u017Eit\u00ED identifik\u00E1tor\u016F GUID nebo UUID pro p\u0159i\u0159azen\u00ED kl\u00ED\u010Dov\u00E9 hodnoty typu znaku mus\u00ED b\u00FDt d\u00E9lka kl\u00ED\u010Dov\u00E9ho sloupce 32 bajt\u016F nebo vy\u0161\u0161\u00ED.
2019=Kolekce nemus\u00ED obsahovat sloupec typu m\u00E9dia, pokud je typ sloupce obsahu BLOB.
2020=Typ m\u00E9dia dokumentu nen\u00ED "application/json". Funkce getContentAsString() je podporov\u00E1na pouze pro dokumenty JSON.
2021=Sada {0} obsahuje hodnotu null.
2022=Kl\u00ED\u010D pro dokument, kter\u00FD se m\u00E1 nahradit, mus\u00ED b\u00FDt zad\u00E1n pomoc\u00ED metody key().
2023=Argument {0} mus\u00ED b\u00FDt nez\u00E1porn\u00FD.
2024=Neplatn\u00E1 specifikace vytvo\u0159en\u00ED indexu.
2025=Neplatn\u00E1 specifikace zru\u0161en\u00ED indexu.
2026=Dokument metadat kolekce nem\u00E1 \u017E\u00E1dn\u00FD, nebo m\u00E1 pr\u00E1zdn\u00FD obsah.
2027=Dokument metadat kolekce nen\u00ED platn\u00FD dokument JSON.
2028=Dokument metadat kolekce nen\u00ED platn\u00FD dokument JSON. K\u00F3dov\u00E1n\u00ED nebylo mo\u017En\u00E9 ur\u010Dit.
2029=P\u0159i zpracov\u00E1v\u00E1n\u00ED dokumentu metadat kolekce do\u0161lo k v\u00FDjimce IOException.
2030=Neplatn\u00E1 hodnota pro "{0}" v metadatech kolekce.
2031=Metadata kolekce mus\u00ED b\u00FDt objekt JSON.
2032=V metadatech kolekce je neo\u010Dek\u00E1van\u00FD kl\u00ED\u010D objektu "{0}".
2033=Kolekce nen\u00ED konfigurov\u00E1na kl\u00ED\u010Di p\u0159i\u0159azen\u00FDmi klientu, ale vstupn\u00ED dokument obsahuje kl\u00ED\u010D.
2034=Kolekce nen\u00ED konfigurov\u00E1na kl\u00ED\u010Dem p\u0159i\u0159azen\u00FDm klientu, ale iter\u00E1tor {0} vr\u00E1til dokument s kl\u00ED\u010Dem po vr\u00E1cen\u00ED {1} dokument\u016F.
2035=Funkce getCurrentSchema() vyvolan\u00E1 pro poskytnut\u00E9 p\u0159ipojen\u00ED JDBC vr\u00E1tila hodnotu null.
2036=Neplatn\u00E1 specifikace projekce.
2037=Hodnota {0} nen\u00ED platn\u00FDm kl\u00ED\u010Dem typu {1}.
2038=Po\u017Eadavek na index obsahuje v\u00EDce ne\u017E {0} sloupc\u016F.
2039=Pro za\u0161ifrovan\u00FD obsah nelze vytvo\u0159it index. Indexov\u00E1n\u00ED je povoleno, pouze pokud je \u0161ifrov\u00E1n\u00ED sloupce obsahu nastaveno na NONE.
2040=v zav\u0159en\u00E9m kurzoru nelze volat funkci next()
2041=Chyba p\u0159i pokusu o odstran\u011Bn\u00ED kolekce. Ov\u011B\u0159te, zda jsou v\u0161echny nedokon\u010Den\u00E9 z\u00E1pisy do kolekce potvrzen\u00E9.
2042=Tato operace vy\u017Eaduje po SODA zah\u00E1jen\u00ED transakce, ale vyskytla se chyba deaktivuj\u00EDc\u00ED automatick\u00E9 potvrzen\u00ED p\u0159ipojen\u00ED JDBC.
2043=Dokument specifikac\u00ED projekce nem\u00E1 \u017E\u00E1dn\u00FD, nebo m\u00E1 pr\u00E1zdn\u00FD obsah.
2044=Dokument specifikace opravy nem\u00E1 \u017E\u00E1dn\u00FD, nebo m\u00E1 pr\u00E1zdn\u00FD obsah.
2045=Specifikace projekce by nem\u011Bla obsahovat sm\u00ED\u0161en\u00E1 pravidla pro za\u010Dlen\u011Bn\u00ED a vy\u010Dlen\u011Bn\u00ED.
#
# Internal errors  (2500 to 2999 error code range)
#
2500=Kolekce {0} nem\u016F\u017Ee obsahovat bin\u00E1rn\u00ED obsah v typu sloupce {1}.
2501=Kolekce {0} pou\u017E\u00EDv\u00E1 tvorbu verz\u00ED {1}. Proudov\u00FD z\u00E1pis nen\u00ED povolen.
2502=Selhalo ulo\u017Een\u00ED dokumentu do kolekce {0}.
2503=Selhalo vlo\u017Een\u00ED dokumentu do kolekce {0}.
2504=Nelze generovat kl\u00ED\u010D na b\u00E1zi UUID.
2505=Dokument s kl\u00ED\u010Dem {0} m\u00E1 velikost {1}, co\u017E p\u0159esahuje limit 2 GB.
2506=P\u0159i\u0159azen\u00ED kl\u00ED\u010De IDENTITY vy\u017Eaduje v SQL podporu RETURNING.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Zkr\u00E1cen\u00ED nen\u00ED podporov\u00E1no, kolekce {0} nen\u00ED zalo\u017Eena na tabulce.
3001=Volba indexAll nen\u00ED implementov\u00E1na pro sloupce obsahu s typem {0}.
3002=Volba indexAll nen\u00ED implementov\u00E1na pro kolekce s kl\u00ED\u010Di NVARCHAR2.
3003=Java Virtual Machine (JVM) nepodporuje algoritmus pro tvorbu verz\u00ED MD5. P\u0159epn\u011Bte na jin\u00FD algoritmus pro tvorbu verz\u00ED.
3004=Java Virtual Machine (JVM) nepodporuje algoritmus pro tvorbu verz\u00ED SHA256. P\u0159epn\u011Bte na jin\u00FD algoritmus pro tvorbu verz\u00ED.
3005=Funkce nebyla implementov\u00E1na.
