#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E40\u0E1B\u0E47\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E48\u0E32\u0E19\u0E2D\u0E22\u0E48\u0E32\u0E07\u0E40\u0E14\u0E35\u0E22\u0E27 \u0E44\u0E21\u0E48\u0E2D\u0E19\u0E38\u0E0D\u0E32\u0E15 {1}
2001=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E27\u0E25\u0E32\u0E23\u0E30\u0E1A\u0E1A\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E27\u0E48\u0E32\u0E41\u0E01\u0E49\u0E44\u0E02\u0E04\u0E23\u0E31\u0E49\u0E07\u0E25\u0E48\u0E32\u0E2A\u0E38\u0E14\u0E40\u0E21\u0E37\u0E48\u0E2D\u0E43\u0E14
2002=\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02\u0E02\u0E2D\u0E07\u0E1F\u0E34\u0E25\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
2003=Descriptor \u0E44\u0E21\u0E48\u0E15\u0E23\u0E07\u0E01\u0E31\u0E1A\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E17\u0E35\u0E48\u0E21\u0E35\u0E2D\u0E22\u0E39\u0E48
2004=\u0E2D\u0E32\u0E23\u0E4C\u0E01\u0E34\u0E27\u0E40\u0E21\u0E19\u0E15\u0E4C {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E19\u0E31\u0E25
2005=\u0E0A\u0E38\u0E14 {0} \u0E27\u0E48\u0E32\u0E07\u0E40\u0E1B\u0E25\u0E48\u0E32
2006=\u0E2D\u0E32\u0E23\u0E4C\u0E01\u0E34\u0E27\u0E40\u0E21\u0E19\u0E15\u0E4C "\u0E15\u0E31\u0E49\u0E07\u0E41\u0E15\u0E48'' \u0E41\u0E25\u0E30\u0E2D\u0E32\u0E23\u0E4C\u0E01\u0E34\u0E27\u0E40\u0E21\u0E19\u0E15\u0E4C ''\u0E08\u0E19\u0E16\u0E36\u0E07'' \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E19\u0E31\u0E25\u0E17\u0E31\u0E49\u0E07\u0E04\u0E39\u0E48
2007=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19
2008=\u0E2D\u0E32\u0E23\u0E4C\u0E01\u0E34\u0E27\u0E40\u0E21\u0E19\u0E15\u0E4C {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E04\u0E48\u0E32\u0E1A\u0E27\u0E01
2009=\u0E08\u0E33\u0E19\u0E27\u0E19\u0E23\u0E27\u0E21\u0E02\u0E2D\u0E07\u0E04\u0E35\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E42\u0E14\u0E22\u0E43\u0E0A\u0E49\u0E40\u0E21\u0E17\u0E18\u0E2D\u0E14 key(), keys() \u0E2B\u0E23\u0E37\u0E2D filter() \u0E04\u0E37\u0E2D {0} \u0E0B\u0E36\u0E48\u0E07\u0E40\u0E01\u0E34\u0E19\u0E02\u0E35\u0E14\u0E08\u0E33\u0E01\u0E31\u0E14\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14 {1}
2010=\u0E15\u0E31\u0E27\u0E27\u0E19\u0E0B\u0E49\u0E33 {0} \u0E41\u0E2A\u0E14\u0E07\u0E04\u0E48\u0E32\u0E40\u0E1B\u0E47\u0E19\u0E19\u0E31\u0E25 \u0E2B\u0E25\u0E31\u0E07\u0E08\u0E32\u0E01\u0E41\u0E2A\u0E14\u0E07\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23 {1} \u0E23\u0E32\u0E22\u0E01\u0E32\u0E23
2011=\u0E04\u0E48\u0E32\u0E02\u0E2D\u0E07\u0E2D\u0E32\u0E23\u0E4C\u0E01\u0E34\u0E27\u0E40\u0E21\u0E19\u0E15\u0E4C "{0}" \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
2012=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32\u0E04\u0E27\u0E32\u0E21\u0E22\u0E32\u0E27\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17 LOB
2013=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E01\u0E32\u0E23\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32 SecureFile LOB \u0E40\u0E21\u0E37\u0E48\u0E2D\u0E21\u0E35\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E40\u0E1B\u0E47\u0E19 "{0}"
2014=\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E17\u0E35\u0E48\u0E41\u0E01\u0E49\u0E44\u0E02\u0E04\u0E23\u0E31\u0E49\u0E07\u0E25\u0E48\u0E32\u0E2A\u0E38\u0E14\u0E44\u0E14\u0E49\u0E01\u0E47\u0E15\u0E48\u0E2D\u0E40\u0E21\u0E37\u0E48\u0E2D\u0E15\u0E31\u0E49\u0E07\u0E0A\u0E37\u0E48\u0E2D\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E17\u0E35\u0E48\u0E41\u0E01\u0E49\u0E44\u0E02\u0E04\u0E23\u0E31\u0E49\u0E07\u0E25\u0E48\u0E32\u0E2A\u0E38\u0E14\u0E41\u0E25\u0E49\u0E27\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19
2015=\u0E16\u0E49\u0E32\u0E40\u0E21\u0E17\u0E18\u0E2D\u0E14\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E04\u0E37\u0E2D "SEQUENCE" \u0E08\u0E30\u0E15\u0E49\u0E2D\u0E07\u0E23\u0E30\u0E1A\u0E38\u0E0A\u0E37\u0E48\u0E2D\u0E25\u0E33\u0E14\u0E31\u0E1A\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E02\u0E2D\u0E07\u0E04\u0E35\u0E22\u0E4C
2016=\u0E21\u0E35\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E40\u0E21\u0E17\u0E18\u0E2D\u0E14\u0E02\u0E2D\u0E07\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19 \u0E41\u0E15\u0E48\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E23\u0E30\u0E1A\u0E38\u0E0A\u0E37\u0E48\u0E2D\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E02\u0E2D\u0E07\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19
2017=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E04\u0E35\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E14\u0E49\u0E27\u0E22\u0E04\u0E27\u0E32\u0E21\u0E22\u0E32\u0E27\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14\u0E44\u0E14\u0E49
2018=\u0E40\u0E21\u0E37\u0E48\u0E2D\u0E43\u0E0A\u0E49 GUID \u0E2B\u0E23\u0E37\u0E2D UUID \u0E43\u0E19\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E04\u0E48\u0E32\u0E04\u0E35\u0E22\u0E4C\u0E02\u0E2D\u0E07\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30 \u0E04\u0E27\u0E32\u0E21\u0E22\u0E32\u0E27\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E04\u0E35\u0E22\u0E4C\u0E15\u0E49\u0E2D\u0E07\u0E40\u0E17\u0E48\u0E32\u0E01\u0E31\u0E1A 32 \u0E44\u0E1A\u0E15\u0E4C\u0E02\u0E36\u0E49\u0E19\u0E44\u0E1B
2019=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E2D\u0E32\u0E08\u0E44\u0E21\u0E48\u0E21\u0E35\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E2A\u0E37\u0E48\u0E2D \u0E40\u0E27\u0E49\u0E19\u0E41\u0E15\u0E48\u0E08\u0E30\u0E21\u0E35\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E40\u0E1B\u0E47\u0E19 BLOB
2020=\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E2A\u0E37\u0E48\u0E2D\u0E02\u0E2D\u0E07\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48 "application/json" \u0E23\u0E30\u0E1A\u0E1A\u0E08\u0E30\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A getContentAsString() \u0E40\u0E09\u0E1E\u0E32\u0E30\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23 JSON \u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19
2021=\u0E0A\u0E38\u0E14 {0} \u0E21\u0E35\u0E04\u0E48\u0E32\u0E40\u0E1B\u0E47\u0E19\u0E19\u0E31\u0E25
2022=\u0E04\u0E35\u0E22\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E17\u0E35\u0E48\u0E08\u0E30\u0E41\u0E17\u0E19\u0E17\u0E35\u0E48\u0E15\u0E49\u0E2D\u0E07\u0E23\u0E30\u0E1A\u0E38\u0E14\u0E49\u0E27\u0E22\u0E01\u0E32\u0E23\u0E43\u0E0A\u0E49\u0E40\u0E21\u0E17\u0E18\u0E2D\u0E14 key()
2023=\u0E2D\u0E32\u0E23\u0E4C\u0E01\u0E34\u0E27\u0E40\u0E21\u0E19\u0E15\u0E4C {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E25\u0E1A
2024=\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E2A\u0E23\u0E49\u0E32\u0E07\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
2025=\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E25\u0E1A\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
2026=\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E40\u0E21\u0E15\u0E30\u0E14\u0E32\u0E15\u0E49\u0E32\u0E02\u0E2D\u0E07\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E2B\u0E23\u0E37\u0E2D\u0E21\u0E35\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E17\u0E35\u0E48\u0E27\u0E48\u0E32\u0E07\u0E40\u0E1B\u0E25\u0E48\u0E32
2027=\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E40\u0E21\u0E15\u0E30\u0E14\u0E32\u0E15\u0E49\u0E32\u0E02\u0E2D\u0E07\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48 JSON \u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
2028=\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E40\u0E21\u0E15\u0E30\u0E14\u0E32\u0E15\u0E49\u0E32\u0E02\u0E2D\u0E07\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48 JSON \u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E01\u0E33\u0E2B\u0E19\u0E14\u0E01\u0E32\u0E23\u0E40\u0E02\u0E49\u0E32\u0E23\u0E2B\u0E31\u0E2A\u0E44\u0E14\u0E49
2029=\u0E40\u0E01\u0E34\u0E14\u0E02\u0E49\u0E2D\u0E1C\u0E34\u0E14\u0E1E\u0E25\u0E32\u0E14 IOException \u0E02\u0E13\u0E30\u0E1B\u0E23\u0E30\u0E21\u0E27\u0E25\u0E1C\u0E25\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E40\u0E21\u0E15\u0E30\u0E14\u0E32\u0E15\u0E49\u0E32\u0E02\u0E2D\u0E07\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19
2030=\u0E04\u0E48\u0E32\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A "{0}" \u0E43\u0E19\u0E40\u0E21\u0E15\u0E30\u0E14\u0E32\u0E15\u0E49\u0E32\u0E02\u0E2D\u0E07\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19
2031=\u0E40\u0E21\u0E15\u0E30\u0E14\u0E32\u0E15\u0E49\u0E32\u0E02\u0E2D\u0E07\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C JSON
2032=\u0E04\u0E35\u0E22\u0E4C\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C "{0}" \u0E40\u0E1B\u0E47\u0E19\u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E04\u0E32\u0E14\u0E2B\u0E21\u0E32\u0E22\u0E43\u0E19\u0E40\u0E21\u0E15\u0E30\u0E14\u0E32\u0E15\u0E49\u0E32\u0E02\u0E2D\u0E07\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19
2033=\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E04\u0E2D\u0E19\u0E1F\u0E34\u0E40\u0E01\u0E2D\u0E23\u0E4C\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E14\u0E49\u0E27\u0E22\u0E04\u0E35\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E42\u0E14\u0E22\u0E44\u0E04\u0E25\u0E40\u0E2D\u0E19\u0E15\u0E4C \u0E41\u0E15\u0E48\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E2D\u0E34\u0E19\u0E1E\u0E38\u0E15\u0E21\u0E35\u0E04\u0E35\u0E22\u0E4C
2034=\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E04\u0E2D\u0E19\u0E1F\u0E34\u0E40\u0E01\u0E2D\u0E23\u0E4C\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E14\u0E49\u0E27\u0E22\u0E04\u0E35\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E42\u0E14\u0E22\u0E44\u0E04\u0E25\u0E40\u0E2D\u0E19\u0E15\u0E4C \u0E41\u0E15\u0E48\u0E15\u0E31\u0E27\u0E27\u0E19\u0E0B\u0E49\u0E33 {0} \u0E41\u0E2A\u0E14\u0E07\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E17\u0E35\u0E48\u0E21\u0E35\u0E04\u0E35\u0E22\u0E4C\u0E2B\u0E25\u0E31\u0E07\u0E08\u0E32\u0E01\u0E41\u0E2A\u0E14\u0E07\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23 {1} \u0E23\u0E32\u0E22\u0E01\u0E32\u0E23
2035=getCurrentSchema() \u0E17\u0E35\u0E48\u0E40\u0E23\u0E35\u0E22\u0E01\u0E43\u0E0A\u0E49\u0E43\u0E19\u0E01\u0E32\u0E23\u0E40\u0E0A\u0E37\u0E48\u0E2D\u0E21\u0E15\u0E48\u0E2D JDBC \u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E41\u0E2A\u0E14\u0E07\u0E04\u0E48\u0E32\u0E40\u0E1B\u0E47\u0E19\u0E19\u0E31\u0E25
2036=\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E01\u0E32\u0E23\u0E1B\u0E23\u0E30\u0E21\u0E32\u0E13\u0E01\u0E32\u0E23\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
2037=\u0E04\u0E48\u0E32 {0} \u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E04\u0E35\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17 {1}
2038=\u0E04\u0E33\u0E02\u0E2D\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E21\u0E35\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E21\u0E32\u0E01\u0E01\u0E27\u0E48\u0E32 {0} \u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C
2039=\u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E2A\u0E23\u0E49\u0E32\u0E07\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E1A\u0E19\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E17\u0E35\u0E48\u0E40\u0E02\u0E49\u0E32\u0E23\u0E2B\u0E31\u0E2A \u0E2D\u0E19\u0E38\u0E0D\u0E32\u0E15\u0E43\u0E2B\u0E49\u0E2A\u0E23\u0E49\u0E32\u0E07\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E44\u0E14\u0E49\u0E43\u0E19\u0E01\u0E23\u0E13\u0E35\u0E17\u0E35\u0E48\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32\u0E01\u0E32\u0E23\u0E40\u0E02\u0E49\u0E32\u0E23\u0E2B\u0E31\u0E2A\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E40\u0E1B\u0E47\u0E19 NONE \u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19
2040=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E40\u0E23\u0E35\u0E22\u0E01 next() \u0E43\u0E19\u0E40\u0E04\u0E2D\u0E23\u0E4C\u0E40\u0E0B\u0E2D\u0E23\u0E4C\u0E17\u0E35\u0E48\u0E1B\u0E34\u0E14
2041=\u0E40\u0E01\u0E34\u0E14\u0E02\u0E49\u0E2D\u0E1C\u0E34\u0E14\u0E1E\u0E25\u0E32\u0E14\u0E02\u0E13\u0E30\u0E1E\u0E22\u0E32\u0E22\u0E32\u0E21\u0E25\u0E1A\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 \u0E42\u0E1B\u0E23\u0E14\u0E15\u0E23\u0E27\u0E08\u0E2A\u0E2D\u0E1A\u0E27\u0E48\u0E32\u0E44\u0E14\u0E49\u0E04\u0E2D\u0E21\u0E21\u0E34\u0E15\u0E01\u0E32\u0E23\u0E40\u0E02\u0E35\u0E22\u0E19\u0E44\u0E1B\u0E22\u0E31\u0E07\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E17\u0E35\u0E48\u0E23\u0E2D\u0E2D\u0E22\u0E39\u0E48\u0E17\u0E31\u0E49\u0E07\u0E2B\u0E21\u0E14\u0E41\u0E25\u0E49\u0E27
2042=\u0E01\u0E32\u0E23\u0E14\u0E33\u0E40\u0E19\u0E34\u0E19\u0E01\u0E32\u0E23\u0E19\u0E35\u0E49\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E0A\u0E49 SODA \u0E40\u0E1E\u0E37\u0E48\u0E2D\u0E40\u0E23\u0E34\u0E48\u0E21\u0E15\u0E49\u0E19\u0E01\u0E32\u0E23\u0E17\u0E33\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23 \u0E41\u0E15\u0E48\u0E21\u0E35\u0E02\u0E49\u0E2D\u0E1C\u0E34\u0E14\u0E1E\u0E25\u0E32\u0E14\u0E02\u0E13\u0E30\u0E40\u0E25\u0E34\u0E01\u0E43\u0E0A\u0E49\u0E01\u0E32\u0E23\u0E04\u0E2D\u0E21\u0E21\u0E34\u0E15\u0E2D\u0E31\u0E15\u0E42\u0E19\u0E21\u0E31\u0E15\u0E34\u0E02\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E40\u0E0A\u0E37\u0E48\u0E2D\u0E21\u0E15\u0E48\u0E2D JDBC
2043=\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38 {0} \u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E2B\u0E23\u0E37\u0E2D\u0E21\u0E35\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E17\u0E35\u0E48\u0E27\u0E48\u0E32\u0E07\u0E40\u0E1B\u0E25\u0E48\u0E32
2045=\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E01\u0E32\u0E23\u0E1B\u0E23\u0E30\u0E21\u0E32\u0E13\u0E01\u0E32\u0E23\u0E04\u0E27\u0E23\u0E21\u0E35\u0E04\u0E48\u0E32\u0E1C\u0E2A\u0E21\u0E02\u0E2D\u0E07\u0E01\u0E0E\u0E01\u0E32\u0E23\u0E23\u0E27\u0E21\u0E41\u0E25\u0E30\u0E01\u0E32\u0E23\u0E41\u0E22\u0E01
2046=\u0E1E\u0E32\u0E18\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E2B\u0E23\u0E37\u0E2D\u0E25\u0E33\u0E14\u0E31\u0E1A\u0E15\u0E32\u0E21\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02\u0E08\u0E30\u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E21\u0E35\u0E02\u0E31\u0E49\u0E19\u0E15\u0E2D\u0E19\u0E02\u0E2D\u0E07\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C
2047=\u0E01\u0E32\u0E23\u0E40\u0E0A\u0E37\u0E48\u0E2D\u0E21\u0E15\u0E48\u0E2D\u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19 OracleConnection \u0E2B\u0E23\u0E37\u0E2D\u0E41\u0E23\u0E1B\u0E40\u0E1B\u0E2D\u0E23\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A OracleConnection

#
# Internal errors  (2500 to 2999 error code range)
#
2500=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E44\u0E1A\u0E19\u0E32\u0E23\u0E35\u0E43\u0E19\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C {1}
2501=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E43\u0E0A\u0E49\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19 {1} \u0E44\u0E21\u0E48\u0E2D\u0E19\u0E38\u0E0D\u0E32\u0E15\u0E43\u0E2B\u0E49\u0E43\u0E0A\u0E49\u0E01\u0E32\u0E23\u0E40\u0E02\u0E35\u0E22\u0E19\u0E41\u0E1A\u0E1A\u0E2A\u0E15\u0E23\u0E35\u0E21
2502=\u0E01\u0E32\u0E23\u0E1A\u0E31\u0E19\u0E17\u0E36\u0E01\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E25\u0E49\u0E21\u0E40\u0E2B\u0E25\u0E27
2503=\u0E01\u0E32\u0E23\u0E41\u0E17\u0E23\u0E01\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E25\u0E49\u0E21\u0E40\u0E2B\u0E25\u0E27
2504=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E2A\u0E23\u0E49\u0E32\u0E07\u0E04\u0E35\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07 UUID
2505=\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E17\u0E35\u0E48\u0E21\u0E35\u0E04\u0E35\u0E22\u0E4C {0} \u0E21\u0E35\u0E02\u0E19\u0E32\u0E14 {1} \u0E0B\u0E36\u0E48\u0E07\u0E40\u0E01\u0E34\u0E19\u0E02\u0E35\u0E14\u0E08\u0E33\u0E01\u0E31\u0E14 2 \u0E01\u0E34\u0E01\u0E30\u0E44\u0E1A\u0E15\u0E4C
2506=\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E04\u0E35\u0E22\u0E4C IDENTITY \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E01\u0E32\u0E23\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A RETURNING \u0E43\u0E19 SQL

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E15\u0E31\u0E14\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25 \u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E41\u0E1A\u0E1A\u0E17\u0E35\u0E48\u0E43\u0E0A\u0E49\u0E15\u0E32\u0E23\u0E32\u0E07
3001=\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E43\u0E0A\u0E49\u0E07\u0E32\u0E19\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E01\u0E32\u0E23\u0E04\u0E49\u0E19\u0E2B\u0E32 JSON \u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E17\u0E35\u0E48\u0E21\u0E35\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17 {0}
3002=\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E43\u0E0A\u0E49\u0E07\u0E32\u0E19\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E01\u0E32\u0E23\u0E04\u0E49\u0E19\u0E2B\u0E32 JSON \u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E17\u0E35\u0E48\u0E21\u0E35\u0E04\u0E35\u0E22\u0E4C NVARCHAR2
3003=Java Virtual Machine (JVM) \u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E2D\u0E31\u0E25\u0E01\u0E2D\u0E23\u0E34\u0E17\u0E36\u0E21\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19 MD5 \u0E40\u0E1B\u0E25\u0E35\u0E48\u0E22\u0E19\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E31\u0E25\u0E01\u0E2D\u0E23\u0E34\u0E17\u0E36\u0E21\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19\u0E2D\u0E37\u0E48\u0E19
3004=Java Virtual Machine (JVM) \u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E2D\u0E31\u0E25\u0E01\u0E2D\u0E23\u0E34\u0E17\u0E36\u0E21\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19 SHA256 \u0E40\u0E1B\u0E25\u0E35\u0E48\u0E22\u0E19\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E31\u0E25\u0E01\u0E2D\u0E23\u0E34\u0E17\u0E36\u0E21\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19\u0E2D\u0E37\u0E48\u0E19
3005=\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E43\u0E0A\u0E49\u0E07\u0E32\u0E19\u0E04\u0E38\u0E13\u0E2A\u0E21\u0E1A\u0E31\u0E15\u0E34
3006=\u0E23\u0E30\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E2A\u0E23\u0E49\u0E32\u0E07\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E1E\u0E37\u0E49\u0E19\u0E17\u0E35\u0E48 JSON \u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E2A\u0E2D\u0E14\u0E04\u0E25\u0E49\u0E2D\u0E07\u0E01\u0E31\u0E19
3007=\u0E23\u0E30\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E2A\u0E23\u0E49\u0E32\u0E07\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E01\u0E32\u0E23\u0E04\u0E49\u0E19\u0E2B\u0E32 JSON \u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E2A\u0E2D\u0E14\u0E04\u0E25\u0E49\u0E2D\u0E07\u0E01\u0E31\u0E19
3008=\u0E23\u0E30\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E2A\u0E23\u0E49\u0E32\u0E07\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E1F\u0E31\u0E07\u0E01\u0E4C\u0E0A\u0E31\u0E19 JSON \u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E2A\u0E2D\u0E14\u0E04\u0E25\u0E49\u0E2D\u0E07\u0E01\u0E31\u0E19
3009=\u0E23\u0E30\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A Query-by-example (QBE) \u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E2A\u0E2D\u0E14\u0E04\u0E25\u0E49\u0E2D\u0E07\u0E01\u0E31\u0E19
