#
# Copyright (c) 2014, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=\u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F {0} \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0430 \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0447\u0442\u0435\u043D\u0438\u044F, {1} \u043D\u0435 \u0434\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F.
2001=\u0423 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438 {0} \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043C\u0435\u0442\u043A\u0430 \u0432\u0440\u0435\u043C\u0435\u043D\u0438, \u0443\u043A\u0430\u0437\u044B\u0432\u0430\u044E\u0449\u0430\u044F \u0434\u0430\u0442\u0443 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0433\u043E \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F.
2002=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0443\u0441\u043B\u043E\u0432\u0438\u0435 \u0444\u0438\u043B\u044C\u0442\u0440\u0430.
2003=\u0414\u0435\u0441\u043A\u0440\u0438\u043F\u0442\u043E\u0440 \u043D\u0435 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0439 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438.
2004=\u0410\u0440\u0433\u0443\u043C\u0435\u043D\u0442 {0} \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0438\u043C\u0435\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 null.
2005=\u041D\u0430\u0431\u043E\u0440 {0} \u043F\u0443\u0441\u0442.
2006=\u0410\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u044B ''since'' \u0438 ''until'' \u043D\u0435 \u043C\u043E\u0433\u0443\u0442 \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E \u0438\u043C\u0435\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 null.
2007=\u0423 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438 {0} \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0432\u0435\u0440\u0441\u0438\u044F.
2008=\u0410\u0440\u0433\u0443\u043C\u0435\u043D\u0442 {0} \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C \u043F\u043E\u043B\u043E\u0436\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u043C.
2009=\u041E\u0431\u0449\u0435\u0435 \u0447\u0438\u0441\u043B\u043E \u043A\u043B\u044E\u0447\u0435\u0439, \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0435 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043C\u0435\u0442\u043E\u0434\u043E\u0432 key(), keys() \u0438\u043B\u0438 filter(), \u0440\u0430\u0432\u043D\u043E {0}, \u0447\u0442\u043E \u043F\u0440\u0435\u0432\u044B\u0448\u0430\u0435\u0442 \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u2014 {1}.
2010=\u0418\u0442\u0435\u0440\u0430\u0442\u043E\u0440 {0} \u0432\u0435\u0440\u043D\u0443\u043B \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 null \u043F\u043E\u0441\u043B\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0430 {1} \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u043E\u0432.
2011=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430 "{0}".
2012=\u0414\u043B\u044F \u0442\u0438\u043F\u043E\u0432 LOB \u043D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0437\u0430\u0434\u0430\u0442\u044C \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u0443\u044E \u0434\u043B\u0438\u043D\u0443.
2013=\u041F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B SecureFile LOB \u043D\u0435\u043B\u044C\u0437\u044F \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0441 \u0442\u0438\u043F\u043E\u043C \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0433\u043E "{0}"
2014=\u0418\u043D\u0434\u0435\u043A\u0441 \u0441\u0442\u043E\u043B\u0431\u0446\u0430 last-modified \u043C\u043E\u0436\u043D\u043E \u043D\u0430\u0441\u0442\u0440\u043E\u0438\u0442\u044C, \u0442\u043E\u043B\u044C\u043A\u043E \u0435\u0441\u043B\u0438 \u0443\u043A\u0430\u0437\u0430\u043D\u043E \u0438\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 last-modified.
2015=\u0415\u0441\u043B\u0438 \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u043C\u0435\u0442\u043E\u0434\u0430 \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F "SEQUENCE", \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0443\u043A\u0430\u0437\u0430\u0442\u044C \u0438\u043C\u044F \u043F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438 \u043A\u043B\u044E\u0447\u0435\u0432\u044B\u0445 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432.
2016=\u0423\u043A\u0430\u0437\u0430\u043D \u043C\u0435\u0442\u043E\u0434 \u0432\u0435\u0440\u0441\u0438\u0438, \u043D\u043E \u043D\u0435 \u0443\u043A\u0430\u0437\u0430\u043D\u043E \u0438\u043C\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0432\u0435\u0440\u0441\u0438\u0438.
2017=\u0423\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0439 \u0442\u0438\u043F \u043A\u043B\u044E\u0447\u0435\u0432\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u043D\u0435\u043B\u044C\u0437\u044F \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0441 \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u0439 \u0434\u043B\u0438\u043D\u043E\u0439.
2018=\u041F\u0440\u0438 \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0438 \u043A\u043B\u044E\u0447\u0435\u0432\u044B\u0445 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u0434\u043B\u044F \u0442\u0438\u043F\u043E\u0432 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E GUID \u0438\u043B\u0438 UUID \u0434\u043B\u0438\u043D\u0430 \u043A\u043B\u044E\u0447\u0435\u0432\u043E\u0433\u043E \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0434\u043E\u043B\u0436\u043D\u0430 \u0441\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C 32 \u0431\u0430\u0439\u0442\u0430 \u0438 \u0431\u043E\u043B\u0435\u0435.
2019=\u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0441\u0442\u043E\u043B\u0431\u0435\u0446 \u0442\u0438\u043F\u0430 \u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044F, \u0435\u0441\u043B\u0438 \u0442\u0438\u043F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0433\u043E \u043E\u0442\u043B\u0438\u0447\u0430\u0435\u0442\u0441\u044F \u043E\u0442 BLOB.
2020=\u0422\u0438\u043F \u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044F \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430 \u043E\u0442\u043B\u0438\u0447\u0430\u0435\u0442\u0441\u044F \u043E\u0442 "application/json". getContentAsString() \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u043E\u0432 JSON.
2021=\u041D\u0430\u0431\u043E\u0440 {0} \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 null.
2022=\u041A\u043B\u044E\u0447 \u0437\u0430\u043C\u0435\u043D\u044F\u0435\u043C\u043E\u0433\u043E \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430 \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C \u0443\u043A\u0430\u0437\u0430\u043D \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043C\u0435\u0442\u043E\u0434\u0430 key().
2023=\u0410\u0440\u0433\u0443\u043C\u0435\u043D\u0442 {0} \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C \u043D\u0435\u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u044B\u043C.
2024=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0430\u044F \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u044F \u0438\u043D\u0434\u0435\u043A\u0441\u0430.
2025=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0430\u044F \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F \u0443\u0434\u0430\u043B\u0435\u043D\u0438\u044F \u0438\u043D\u0434\u0435\u043A\u0441\u0430.
2026=\u0412 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0435 \u043C\u0435\u0442\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438 \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0435 \u0438\u043B\u0438 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u0441\u044F \u043F\u0443\u0441\u0442\u044B\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F.
2027=\u0414\u043E\u043A\u0443\u043C\u0435\u043D\u0442 \u043C\u0435\u0442\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u043E\u043C JSON.
2028=\u0414\u043E\u043A\u0443\u043C\u0435\u043D\u0442 \u043C\u0435\u0442\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438 \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u043E\u043C JSON. \u041A\u043E\u0434\u0438\u0440\u043E\u0432\u043A\u0430 \u043D\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0430.
2029=\u041F\u0440\u0438 \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0435 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430 \u043C\u0435\u0442\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438 \u0432\u043E\u0437\u043D\u0438\u043A\u043B\u043E \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435 IOException.
2030=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0434\u043B\u044F "{0}" \u0432 \u043C\u0435\u0442\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438.
2031=\u041C\u0435\u0442\u0430\u0434\u0430\u043D\u043D\u044B\u0435 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438 \u0434\u043E\u043B\u0436\u043D\u044B \u0431\u044B\u0442\u044C \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u043C JSON.
2032=\u041D\u0435\u043F\u0440\u0435\u0434\u0432\u0438\u0434\u0435\u043D\u043D\u044B\u0439 \u043A\u043B\u044E\u0447 \u043E\u0431\u044A\u0435\u043A\u0442\u0430 "{0}" \u0432 \u043C\u0435\u0442\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0438.
2033=\u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F \u043D\u0435 \u043D\u0430\u0441\u0442\u0440\u043E\u0435\u043D\u0430 \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u043D\u0430\u0437\u043D\u0430\u0447\u0430\u0435\u043C\u044B\u0445 \u043A\u043B\u0438\u0435\u043D\u0442\u043E\u043C \u043A\u043B\u044E\u0447\u0435\u0439, \u043D\u043E \u0432\u0445\u043E\u0434\u043D\u043E\u0439 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u043A\u043B\u044E\u0447.
2034=\u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F \u043D\u0435 \u043D\u0430\u0441\u0442\u0440\u043E\u0435\u043D\u0430 \u0441 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u043D\u0430\u0437\u043D\u0430\u0447\u0430\u0435\u043C\u043E\u0433\u043E \u043A\u043B\u0438\u0435\u043D\u0442\u043E\u043C \u043A\u043B\u044E\u0447\u0430, \u043D\u043E \u0438\u0442\u0435\u0440\u0430\u0442\u043E\u0440 {0} \u0432\u0435\u0440\u043D\u0443\u043B \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442 \u0441 \u043A\u043B\u044E\u0447\u043E\u043C \u043F\u043E\u0441\u043B\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0430 {1} \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u043E\u0432.
2035=\u041C\u0435\u0442\u043E\u0434 getCurrentSchema(), \u0438\u043D\u0438\u0446\u0438\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0434\u043B\u044F \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F JDBC, \u0432\u0435\u0440\u043D\u0443\u043B \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 null.
2036=\u041D\u0435\u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0430\u044F \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F \u043F\u0440\u043E\u0435\u043A\u0446\u0438\u0438.
2037=\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 {0} \u043D\u0435 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u044B\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C \u0442\u0438\u043F\u0430 {1}.
2038=\u0417\u0430\u043F\u0440\u043E\u0441 \u0438\u043D\u0434\u0435\u043A\u0441\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0431\u043E\u043B\u0435\u0435 {0} \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432.
2039=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0438\u043D\u0434\u0435\u043A\u0441 \u0434\u043B\u044F \u0437\u0430\u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0433\u043E \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0433\u043E. \u0418\u043D\u0434\u0435\u043A\u0441\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043E, \u0442\u043E\u043B\u044C\u043A\u043E \u0435\u0441\u043B\u0438 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 \u0448\u0438\u0444\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0433\u043E \u0438\u043C\u0435\u0435\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 NONE.

#
# Internal errors  (2500 to 2999 error code range)
#
2500=\u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F {0} \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0434\u0432\u043E\u0438\u0447\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 \u0432 \u0441\u0442\u043E\u043B\u0431\u0446\u0435 \u0442\u0438\u043F\u0430 {1}.
2501=\u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F {0} \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442 \u0441\u0438\u0441\u0442\u0435\u043C\u0443 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u044F \u0432\u0435\u0440\u0441\u0438\u0439 {1}. \u0417\u0430\u043F\u0438\u0441\u044C \u0432 \u043F\u043E\u0442\u043E\u043A\u043E\u0432\u043E\u043C \u0440\u0435\u0436\u0438\u043C\u0435 \u0437\u0430\u043F\u0440\u0435\u0449\u0435\u043D\u0430.
2502=\u041E\u0448\u0438\u0431\u043A\u0430 \u043F\u0440\u0438 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u0438 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430 \u0432 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044E {0}.
2503=\u041E\u0448\u0438\u0431\u043A\u0430 \u043F\u0440\u0438 \u0432\u0441\u0442\u0430\u0432\u043A\u0435 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430 \u0432 \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044E {0}.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=\u0423\u0441\u0435\u0447\u0435\u043D\u0438\u0435 \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F. \u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F {0} \u043D\u0435 \u043E\u0441\u043D\u043E\u0432\u0430\u043D\u0430 \u043D\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0435.
3001=\u041A\u043E\u043C\u0430\u043D\u0434\u0430 indexAll \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u0430 \u0434\u043B\u044F \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0433\u043E \u0441 \u0442\u0438\u043F\u043E\u043C {0}.
3002=\u041A\u043E\u043C\u0430\u043D\u0434\u0430 indexAll \u043D\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u043D\u0430 \u0434\u043B\u044F \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u0439 \u0441 \u043A\u043B\u044E\u0447\u0430\u043C\u0438 NVARCHAR2. 
