#
# Copyright (c) 2014, 2019, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Koleksiyon {0} salt okunur, {1} koleksiyonuna izin verilmiyor.
2001={0} koleksiyonunda son de\u011Fi\u015Fikli\u011Fi g\u00F6steren zaman damgas\u0131 yok.
2002=Ge\u00E7ersiz filtre ko\u015Fulu.
2003=A\u00E7\u0131klay\u0131c\u0131 mevcut koleksiyonla e\u015Fle\u015Fmiyor.
2004={0} ba\u011F\u0131ms\u0131z de\u011Fi\u015Fkeni bo\u015F olamaz.
2005={0} k\u00FCmesi bo\u015F.
2006=''since'' ve ''until'' ba\u011F\u0131ms\u0131z de\u011Fi\u015Fkenlerinin ikisi de bo\u015F olamaz.
2007={0} koleksiyonunun s\u00FCr\u00FCm\u00FC yok.
2008={0} ba\u011F\u0131ms\u0131z de\u011Fi\u015Fkeni pozitif olmal\u0131d\u0131r.
2009=key(), keys() veya filter() y\u00F6ntemlerini kullanan belirtilen toplam anahtar say\u0131s\u0131 {0}; bu say\u0131 {1} maksimum s\u0131n\u0131r\u0131n\u0131 a\u015F\u0131yor.
2010={0} tekrarlay\u0131c\u0131s\u0131, {1} dok\u00FCman d\u00F6nd\u00FCrd\u00FCkten sonra null d\u00F6nd\u00FCrd\u00FC.
2011=Ge\u00E7ersiz ba\u011F\u0131ms\u0131z de\u011Fi\u015Fken de\u011Feri "{0}".
2012=B\u00FCy\u00FCk nesne tipleri veya JSON tipi i\u00E7in maksimum uzunluk ayarlanamaz.
2013=\u0130\u00E7erik s\u00FCtunu t\u00FCr\u00FC "{0}" oldu\u011Funda SecureFile LOB ayarlar\u0131 kullan\u0131lamaz 
2014=Son de\u011Fi\u015Ftirilen s\u00FCtun dizini sadece son de\u011Fi\u015Ftirilen s\u00FCtun ad\u0131 belirlendi\u011Finde ayarlanabilir.
2015=Atama y\u00F6ntemi "SEQUENCE" ise anahtar s\u00FCtun s\u0131ras\u0131 ad\u0131 belirtilmelidir.
2016=S\u00FCr\u00FCm y\u00F6ntemi belirtildi ancak s\u00FCtun s\u00FCtunu ad\u0131 belirtilmedi.
2017=Belirtilen anahtar s\u00FCtunu t\u00FCr\u00FC maksimum uzunlukla kullan\u0131lamaz.
2018=Karakter t\u00FCr\u00FC anahtar de\u011Ferler atamak i\u00E7in GUID veya UUID kullan\u0131rken anahtar s\u00FCtun uzunlu\u011Fu 32 bayt veya daha fazla olmal\u0131d\u0131r.
2019=\u0130\u00E7erik s\u00FCtun t\u00FCr\u00FC BLOB olmad\u0131\u011F\u0131 s\u00FCrece koleksiyon ortam s\u00FCtun t\u00FCr\u00FCne sahip olamaz.
2020=Dok\u00FCman\u0131n ortam t\u00FCr\u00FC "uygulama/json". getContentAsString() sadece JSON dok\u00FCmanlar\u0131nda desteklenir.
2021={0} k\u00FCmesi bo\u015F.
2022=De\u011Fi\u015Ftirilecek dok\u00FCman\u0131n anahtar\u0131 key() y\u00F6ntemi kullan\u0131larak belirtilmelidir.
2023={0} ba\u011F\u0131ms\u0131z de\u011Fi\u015Fkeni negatif olmamal\u0131d\u0131r.
2024=Ge\u00E7ersiz dizin olu\u015Fturma belirtimi.
2025=Ge\u00E7ersiz dizin b\u0131rakma belirtimi.
2026=Koleksiyon meta veri dok\u00FCman\u0131nda i\u00E7erik yok veya bo\u015F i\u00E7erik var.
2027=Koleksiyon meta veri dok\u00FCman\u0131 ge\u00E7erli JSON de\u011Fil.
2028=Koleksiyon meta veri dok\u00FCman\u0131 ge\u00E7erli JSON de\u011Fil, kodlama belirlenemedi.
2029=Koleksiyon meta veri dok\u00FCman\u0131 i\u015Flenirken IOException ortaya \u00E7\u0131kt\u0131.
2030=Koleksiyon meta verilerinde "{0}" de\u011Feri ge\u00E7ersiz.
2031=Koleksiyon meta verileri JSON nesnesi olmal\u0131d\u0131r.
2032=Koleksiyon meta verilerinde beklenmedik nesne anahtar\u0131 "{0}".
2033=Koleksiyon, istemciye atanan anahtarlarla konfig\u00FCre edilmedi ancak girdi dok\u00FCman\u0131nda bir anahtar var.
2034=Koleksiyon, istemciye atanan anahtarla konfig\u00FCre edilmedi ancak {0} tekrarlay\u0131c\u0131s\u0131 {1} dok\u00FCman d\u00F6nd\u00FCrd\u00FCkten sonra anahtar\u0131 i\u00E7eren bir dok\u00FCman d\u00F6nd\u00FCrd\u00FC.
2035=Sa\u011Flanan JDBC ba\u011Flant\u0131s\u0131nda \u00E7a\u011Fr\u0131lan getCurrentSchema() s\u0131f\u0131r d\u00F6nd\u00FCrd\u00FC.
2036=Ge\u00E7ersiz projeksiyon belirtimi.
2037={0} de\u011Feri {1} t\u00FCr\u00FCnde ge\u00E7erli bir anahtar de\u011Fil.
2038=Dizin iste\u011Finde {0} adetten fazla s\u00FCtun var.
2039=Dizin \u015Fifreli i\u00E7erikte yarat\u0131lam\u0131yor. Sadece i\u00E7erik s\u00FCtunu \u015Fifrelemesi YOK olarak ayarland\u0131ysa dizin olu\u015Fturmaya izin verilir.
2040=next() kapal\u0131 imle\u00E7te \u00E7a\u011Fr\u0131lam\u0131yor.
2041=Koleksiyon b\u0131rak\u0131lmaya \u00E7al\u0131\u015F\u0131rken hata olu\u015Ftu. Koleksiyon i\u00E7in t\u00FCm bekleyen yazmalar\u0131n ger\u00E7ekle\u015Fti\u011Finden emin olun.
2042=Bu i\u015Flemin i\u015Flem olarak ba\u015Flamas\u0131 i\u00E7in SODA gerekiyor, ancak JDBC ba\u011Flant\u0131s\u0131n\u0131n otomatik kaydedilmesini devre d\u0131\u015F\u0131 b\u0131rakan bir hata var.
2043={0} belirtim dok\u00FCman\u0131nda i\u00E7erik yok veya bo\u015F i\u00E7erik var.
2045=Projeksiyon belirtimi, dahil etme ve hari\u00E7 tutma kurallar\u0131n\u0131n bir kar\u0131\u015F\u0131m\u0131n\u0131 i\u00E7ermemelidir.
2046=Dizin veya sipari\u015F eden ko\u015Fuluyla ilgili veri yolunda dizi ad\u0131mlar\u0131 olamaz.
2047=Ba\u011Flant\u0131 ya OracleConnection ya da OracleConnection sar\u0131c\u0131s\u0131 olmal\u0131d\u0131r.
2048=Dil parametresi bir 12.1.0.2 Oracle Veritaban\u0131 metin dizini ile desteklenmez.
2049=Fonksiyonel dizin modu \u00F6nde\u011Ferinin json_value "null on empty" yant\u00FCmcesini esas almas\u0131 12.2.0.1 Oracle Veritaban\u0131ndan s\u00FCr\u00FCm\u00FCnden ba\u015Flanarak desteklenmektedir. "scalarRequired" ve "lax" modlar\u0131 12.1.0.2 s\u00FCr\u00FCm\u00FCnde desteklenir. Not: "lax" dizinler QBE'ler taraf\u0131ndan kullan\u0131lmaz bu nedenle "scalarRequired" \u00F6nerilir.
2050="{0}", bir 12.1.0.2 Oracle Veritaban\u0131 metin dizini i\u00E7in belirtilemez.
2051=Ba\u011Flant\u0131 otomatik kay\u0131t modunda oldu\u011Funda "{0}" i\u015Flemi i\u015Flem y\u00F6netimi gerektirir ancak "avoidTxnManagement" i\u015Fareti OracleDatabase an\u0131nda do\u011Fru olarak ayarl\u0131d\u0131r. \u0130\u015Flemi y\u00FCr\u00FCtmek \u00FCzere otomatik kay\u0131t modunu devre d\u0131\u015F\u0131 b\u0131rak\u0131n.
2052=keyLike() sadece istemci atanm\u0131\u015F anahtarlar\u0131 vevarchar2 anahtar s\u00FCtun t\u00FCr\u00FC olan bir koleksiyon i\u00E7in belirtilebilir.
2053=\u015Eemada belirtilen ada sahip bir dizin zaten mevcuttur.
2054=atla veya s\u0131n\u0131rland\u0131r bir sayma i\u015Flemi i\u00E7in ayarlanamaz.
2055=Do\u011Fru olarak ayarlanan textIndex121WithLang parametresi 12.2 \u00FCzeri veritaban\u0131 s\u00FCr\u00FCmlerinde desteklenmez.
2056=Projeksiyon belirtimi dizi ad\u0131mlar\u0131 i\u00E7ermemelidir.
2057=Projeksiyon belirtiminde, dizin yollar\u0131 ortak bir \u00F6n eki payla\u015Famaz.
2058={0} y\u00F6ntemi, {1} y\u00F6ntemiyle birlikte belirtilemez.
2059=Girdi dok\u00FCman\u0131 JSON i\u00E7eri\u011Finin ikiliye d\u00F6n\u00FC\u015F\u00FCm\u00FC s\u0131ras\u0131nda hata olu\u015Ftu. Girdi dok\u00FCman\u0131n\u0131n i\u00E7eri\u011Finin ge\u00E7erli JSON oldu\u011Funa emin olun.
2060=\u0130kili JSON metinsel JSON'a d\u00F6n\u00FC\u015Ft\u00FCr\u00FCl\u00FCrken hata olu\u015Ftu.
2061=Dok\u00FCman anahtar\u0131 i\u00E7in belirtilen yol ge\u00E7ersiz.
2062=Dok\u00FCmandan yol ay\u0131klanamad\u0131.
2063=Yol dok\u00FCmana eklenemedi.
2064=contentColumn.sqlType JSON oldu\u011Funda do\u011Frulama belirtilmemelidir.

#
# Internal errors  (2500 to 2999 error code range)
#
2500={0} koleksiyonunun {1} s\u00FCtun t\u00FCr\u00FCnde ikili i\u00E7eri\u011Fi olamaz.
2501={0} koleksiyonu {1} s\u00FCr\u00FCmlendirme kullan\u0131yor, yazma veri ak\u0131\u015F\u0131na izin verilmiyor.
2502={0} koleksiyonuna dok\u00FCman kaydedilemedi.
2503={0} koleksiyonuna dok\u00FCman eklenemedi.
2504=UUID tabanl\u0131 anahtar olu\u015Fturulam\u0131yor.
2505=Anahtar\u0131 {0} olan dok\u00FCman {1} boyutunda ve 2GB olan limiti a\u015F\u0131yor.
2506=IDENTITY anahtar atamas\u0131 i\u00E7in SQL i\u00E7inde RETURNING deste\u011Fi gerekiyor.
2507=Veritaban\u0131 s\u00FCr\u00FCm\u00FC al\u0131n\u0131rken hata olu\u015Ftu.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Kesilme desteklenmiyor, {0} koleksiyonu tablo tabanl\u0131 de\u011Fil.
3001=JSON arama dizini, {0} t\u00FCr\u00FCndeki i\u00E7erik s\u00FCtunlar\u0131na uygulanmaz.
3002=JSON arama dizini, NVARCHAR2 anahtarlar\u0131n\u0131 i\u00E7eren koleksiyonlarda uygulanmaz.
3003=Java Sanal Makinesi (JVM) MD5 s\u00FCr\u00FCmlendirme algoritmas\u0131n\u0131 desteklemiyor. Ba\u015Fka bir s\u00FCr\u00FCmlendirme algoritmas\u0131na ge\u00E7i\u015F yap\u0131n.
3004=Java Sanal Makinesi (JVM) SHA256 s\u00FCr\u00FCmlendirme algoritmas\u0131n\u0131 desteklemiyor. Ba\u015Fka bir s\u00FCr\u00FCmlendirme algoritmas\u0131na ge\u00E7i\u015F yap\u0131n.
3005=\u00D6zellik uygulanmad\u0131.
3006=JSON uzamsal dizini heterojen koleksiyonlarda desteklenmez.
3007=JSON arama dizini heterojen koleksiyonlarda desteklenmez.
3008=JSON fonksiyon dizini heterojen koleksiyonlarda desteklenmez.
3009=\u00D6rne\u011Fe g\u00F6re sorgu (QBE) heterojen koleksiyonlarda desteklenmez.
