#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=Samlingen {0} er skrivebeskyttet, {1} er ikke tilladt.
2001=Samlingen {0} har ikke et tidsstempel, der angiver, hvorn\u00E5r den sidst blev \u00E6ndret.
2002=Ugyldig filterbetingelse.
2003=Descriptoren matcher ikke eksisterende samling.
2004={0}-argument m\u00E5 ikke v\u00E6re NULL.
2005={0}-s\u00E6t er tomt.
2006=''since''- og ''until''-argumenter m\u00E5 ikke begge v\u00E6re NULL.
2007=Samlingen {0} har ingen version.
2008={0}-argument skal v\u00E6re positivt.
2009=Det totale antal n\u00F8gler, der er angivet ved hj\u00E6lp af metoderne key(), keys(), eller filter(), er {0}, hvilket overskrider den maksimale gr\u00E6nse p\u00E5 {1}.
2010={0}-iterator returnerede NULL efter returnering af {1} dokumenter.
2011=Ugyldig argumentv\u00E6rdi "{0}".
2012=Der kan ikke angives en maksimal l\u00E6ngde for LOB-typer.
2013=SecureFile LOB-indstillinger kan ikke bruges, n\u00E5r indholdskolonnetypen er "{0}"
2014=Indekset for senest \u00E6ndret kolonne kan kun angives, n\u00E5r navnet p\u00E5 den senest \u00E6ndrede kolonne er angivet.
2015=Hvis tildelingsmetoden er "SEQUENCE", skal der angives et n\u00F8glekolonnesekvensnavn.
2016=Der blev angivet en versionsmetode, men versionskolonnenavnet er ikke angivet.
2017=Den angivne n\u00F8glekolonnetype kan ikke bruges med en maksimal l\u00E6ngde.
2018=N\u00E5r GUID eller UUID bruges til at tildele n\u00F8glev\u00E6rdier for tegntype, skal n\u00F8glekolonnens l\u00E6ngde v\u00E6re 32 byte eller st\u00F8rre.
2019=Samlingen m\u00E5 ikke have en medietypekolonne, medmindre indholdskolonnetypen er BLOB.
2020=Dokumentets medietype er ikke "application/json". getContentAsString() underst\u00F8ttes kun for JSON-dokumenter.
2021={0}-s\u00E6t indeholder NULL.
2022=N\u00F8glen for det dokument, der skal erstattes, skal angives ved hj\u00E6lp af metoden key().
2023={0}-argument m\u00E5 ikke v\u00E6re negativt.
2024=Ugyldig specifikation for indeksoprettelse.
2025=Ugyldig specifikation for at droppe indeks.
2026=Samlingens metadatadokument har intet indhold, eller det har tomt indhold.
2027=Samlingens metadatadokument er ikke gyldig JSON.
2028=Samlingens metadatadokument er ikke gyldig JSON, kodning kunne ikke fastsl\u00E5s.
2029=IOException opstod under behandling af samlingens metadatadokument.
2030=Ugyldig v\u00E6rdi for "{0}" i samlingens metadata.
2031=Samlingens metadata skal v\u00E6re et JSON-objekt.
2032=Objektn\u00F8glen "{0}" forventedes ikke i samlingens metadata.
2033=Samlingen er ikke konfigureret med klienttildelte n\u00F8gler, men inputdokumentet har en n\u00F8gle.
2034=Samlingen er ikke konfigureret med klienttildelt n\u00F8gle, men {0}-iterator returnerede et dokument med en n\u00F8gle efter at have returneret {1} dokumenter.
2035=getCurrentSchema(), der blev kaldt p\u00E5 den angivne JDBC-forbindelse, returnerede NULL.
2036=Ugyldig projektionsspecifikation.
2037=V\u00E6rdien {0} er ikke en gyldig n\u00F8gle af typen {1}.
2038=Indeksanmodningen har mere end {0} kolonner.
2039=Indeks kan ikke oprettes p\u00E5 krypteret indhold. Indeksering er kun tilladt, hvis indholdskolonnekryptering er sat til NONE.
2040=next() kan ikke kaldes p\u00E5 en lukket mark\u00F8r.
2041=Fejl under fors\u00F8g p\u00E5 at droppe samlingen. S\u00F8rg for, at alle udest\u00E5ende skrivninger til samlingen er bekr\u00E6ftet.
2042=Denne operation kr\u00E6ver, at SODA starter en transaktion, men der er fejl under deaktivering af JDBC-forbindelsens automatiske bekr\u00E6ftelse.
2043=specifikationsdokument for {0} har intet indhold eller har tomt indhold.
2045=Projektionspecifikation m\u00E5 ikke indeholde en blanding af inklusions- og eksklusionsregler.
2046=Sti til et indeks eller en order by-betingelse m\u00E5 ikke indeholde arraytrin.
2047=Forbindelse skal v\u00E6re en OracleConnection eller en wrapper til en OracleConnection.

#
# Internal errors  (2500 to 2999 error code range)
#
2500=Samlingen {0} m\u00E5 ikke have bin\u00E6rt indhold i kolonnetypen {1}.
2501=Samlingen {0} bruger {1}-versionering, streaming-skrivning er ikke tilladt.
2502=Lagring af dokument til samlingen {0} fejlede.
2503=Inds\u00E6ttelse af dokument til samlingen {0} fejlede.
2504=Kan ikke generere UUID-baseret n\u00F8gle.
2505=Dokument med n\u00F8glen {0} har st\u00F8rrelsen {1}, hvilket overskrider gr\u00E6nsen p\u00E5 2 GB.
2506=IDENTITY-n\u00F8gletildeling kr\u00E6ver RETURNING-underst\u00F8ttelse i SQL.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=Afsk\u00E6ring underst\u00F8ttes ikke, samlingen {0} er ikke tabelbaseret.
3001=JSON-s\u00F8geindeks er ikke implementeret for indholdskolonner med typen {0}.
3002=JSON-s\u00F8geindeks er ikke implementeret for samlinger med NVARCHAR2-n\u00F8gler.
3003=Java Virtual Machine (JVM) underst\u00F8tter ikke MD5-versioneringsalgoritme. Skift til en anden versioneringsalgoritme.
3004=Java Virtual Machine (JVM) underst\u00F8tter ikke SHA256-versioneringsalgoritme. Skift til en anden versioneringsalgoritme.
3005=Funktion er ikke implementeret.
3006=JSON-spatialindeksering underst\u00F8ttes ikke for heterogene samlinger.
3007=JSON-s\u00F8geindeksering underst\u00F8ttes ikke for heterogene samlinger.
3008=JSON-funktionsindeksering underst\u00F8ttes ikke for heterogene samlinger.
3009=QBE (Query-by-example) underst\u00F8ttes ikke for heterogene samlinger.
