#
# Copyright (c) 2014, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=La recopilaci\u00F3n {0} es de solo lectura, {1} no est\u00E1 permitido.
2001=La recopilaci\u00F3n {0} no tiene ning\u00FAn registro de hora que indique la \u00FAltima modificaci\u00F3n.
2002=Condici\u00F3n de filtro no v\u00E1lida.
2003=El descriptor no coincide con la recopilaci\u00F3n existente.
2004=El argumento {0} no puede ser nulo.
2005=El juego {0} est\u00E1 vac\u00EDo.
2006=Los argumentos ''since'' y ''until'' no pueden ser nulos.
2007=La recopilaci\u00F3n {0} no tiene ninguna versi\u00F3n.
2008=El argumento {0} debe ser positivo.
2009=El n\u00FAmero total de claves especificado mediante los m\u00E9todos key(), keys() o filter() es {0}, que excede el l\u00EDmite m\u00E1ximo de {1}.
2010=El iterador {0} ha devuelto un valor nulo despu\u00E9s de devolver {1} documentos.
2011=Valor de argumento no v\u00E1lido "{0}".
2012=No se puede definir la longitud m\u00E1xima para tipos LOB.
2013=La configuraci\u00F3n de SecureFile LOB no se puede utilizar cuando el tipo de columna de contenido es "{0}"
2014=El \u00EDndice de columna last-modified solo se puede definir cuando est\u00E1 definido el nombre de la columna last-modified.
2015=Si el m\u00E9todo de asignaci\u00F3n es "SEQUENCE", se debe especificar un nombre de secuencia de columna de clave.
2016=Se ha especificado un m\u00E9todo de versi\u00F3n, pero no se ha especificado el nombre de la columna de versi\u00F3n.
2017=El tipo de columna de clave especificado no se puede utilizar con una longitud m\u00E1xima.
2018=Al utilizar GUID o UUID para asignar valores de clave de tipo de car\u00E1cter, la longitud de la columna de clave debe tener 32 bytes o m\u00E1s.
2019=Puede que la recopilaci\u00F3n no tenga una columna de tipo de medio a menos que el tipo de columna de contenido sea BLOB.
2020=El tipo de medio del documento no es "application/json". getContentAsString() solo est\u00E1 soportado para documentos JSON.
2021=El juego {0} contiene un valor nulo.
2022=La clave para el documento que se va a sustituir se debe especificar con el m\u00E9todo key().
2023=El argumento {0} no debe tener un valor no negativo.
2024=Especificaci\u00F3n de creaci\u00F3n de \u00EDndice no v\u00E1lida.
2025=Especificaci\u00F3n de borrado de \u00EDndice no v\u00E1lida.
2026=El documento de metadatos de recopilaci\u00F3n no tiene contenido o \u00E9ste est\u00E1 vac\u00EDo.
2027=El documento de metadatos de recopilaci\u00F3n no es un JSON v\u00E1lido.
2028=El documento de metadatos de recopilaci\u00F3n no es un JSON v\u00E1lido, no se ha podido determinar la codificaci\u00F3n.
2029=Se ha producido una excepci\u00F3n de E/S al procesar el documento de metadatos de recopilaci\u00F3n.
2030=Valor no v\u00E1lido para "{0}" en los metadatos de recopilaci\u00F3n.
2031=Los metadatos de recopilaci\u00F3n deben ser un objeto JSON.
2032=La clave de objeto "{0}" es inesperada en los metadatos de recopilaci\u00F3n.
2033=La recopilaci\u00F3n no est\u00E1 configurada con claves asignadas por el cliente, pero el documento de entrada tiene una clave.
2034=La recopilaci\u00F3n no est\u00E1 configurada con una clave asignada por el cliente, pero el iterador {0} ha devuelto un documento con una clave despu\u00E9s de devolver {1} documentos.
2035=La llamada a getCurrentSchema() en la conexi\u00F3n JDBC proporcionada es nula.
2036=Especificaci\u00F3n de proyecci\u00F3n no v\u00E1lida.
2037=El valor {0} no es una clave v\u00E1lida de tipo {1}.
2038=La solicitud de \u00EDndice tiene m\u00E1s de {0} columnas.
2039=No se puede crear el \u00EDndice en el contenido cifrado. La indexaci\u00F3n solo est\u00E1 permitida si el cifrado de la columna de contenido est\u00E1 definido en NONE.

#
# Internal errors  (2500 to 2999 error code range)
#
2500=La recopilaci\u00F3n {0} no puede tener contenido binario en el tipo de columna {1}.
2501=La recopilaci\u00F3n {0} utiliza el control de versiones {1}, las escrituras de flujo no est\u00E1n permitidas.
2502=Fallo al guardar el documento para la recopilaci\u00F3n de {0}.
2503=Fallo al insertar el documento en la recopilaci\u00F3n {0}.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=No est\u00E1 soportado el truncamiento. La recopilaci\u00F3n {0} no est\u00E1 basada en tablas.
3001=indexAll no est\u00E1 implantado para las columnas de contenido con tipo {0}.
3002=indexAll no est\u00E1 implantado para las recopilaciones con claves NVARCHAR2. 
