#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in query-by-example exceptions

#
# Syntax errors (5000 to 5499 error code range)
#
5000=Erreur de syntaxe de requ\u00EAte.
5001=Les \u00E9l\u00E9ments du tableau de valeurs pour {0} doivent \u00EAtre des valeurs scalaires.
5002=Tableau attendu pour l''op\u00E9rateur logique {0}.
5003=La valeur de l'op\u00E9rateur $id doit \u00EAtre une cha\u00EEne scalaire ou un nombre, ou un tableau de cha\u00EEnes scalaires ou de nombres
5004=Op\u00E9rateur {0} non attendu.
5005=Nombre de membres {0} incorrect pour l''op\u00E9rateur {1}.
5006=Valeur non valide pour la propri\u00E9t\u00E9 {0} : valeur attendue {1}, valeur trouv\u00E9e {2}.
5007=Propri\u00E9t\u00E9 manquante {0}.
5008=Le chemin de champ d''index {0} n''est pas un format de chemin valide.
5009=Objet de sp\u00E9cification d'index non valide, incomplet ou \u00E9chec de l'analyse.
5010=Objet de sp\u00E9cification de projection non valide, incomplet ou \u00E9chec de l'analyse.
5011=Type de donn\u00E9es {0} non reconnu ou non acceptable pour une colonne d''index.
5012=Longueur {0} non acceptable pour une colonne d''index.
5013=Le langage {0} n''est pas reconnu.
5014=L''op\u00E9rande pour {0} doit \u00EAtre une cha\u00EEne.
5015=L''op\u00E9rande pour {0} ne peut pas \u00EAtre {1}.
5016=Un conteneur {1} ne peut pas \u00EAtre l''op\u00E9rande pour l''op\u00E9rateur {0}.
5017=Les composants de l''op\u00E9rateur {0} doivent \u00EAtre des objets.
5018=Le nom de champ {0} n''est pas un op\u00E9rateur reconnu.
5019=Caract\u00E8res non valides apr\u00E8s la fin du document JSON.
5020=Le tableau contient la cl\u00E9 non valide {0}.
5021=L''op\u00E9rateur {0} doit poss\u00E9der au moins une cible.
5022=Les chemins avec des \u00E9tapes de tableau ne sont pas pris en charge.
5023=Impossible d''analyser le chemin non valide ({0}).
5024=Chemin NULL ou vide non valide.
5025=Etape vide non autoris\u00E9e dans le chemin ({0}) \u00E0 la position {1}.
5026=Le chemin ({0}) comporte un sous-script de tableau non valide {1}.
5027=Etape entre guillemets non valide dans le chemin ({0}) \u00E0 la position {1}.
5028=El\u00E9ment {0} non ferm\u00E9 \u00E0 la fin du chemin ({1}).
5029=S\u00E9parateur (point) manquant dans le chemin ({0}) \u00E0 la position {1}.
5030=Nom de champ manquant dans le chemin ({0}) \u00E0 la position {1}.
5031=Erreur de syntaxe de chemin \u00E0 la position {1} dans le chemin ({0}).
5032=L''utilisation de plusieurs op\u00E9rateurs {0} n''est pas autoris\u00E9e.
5033=La valeur de l''op\u00E9rateur {0} doit \u00EAtre un objet JSON.
5034=Si $query est utilis\u00E9, les autres op\u00E9rateurs de requ\u00EAte ne peuvent pas figurer au niveau sup\u00E9rieur de la sp\u00E9cification de filtre.
5035=La valeur fournie pour le chemin order-by ({0}) est ({1}), qui ne peut pas \u00EAtre convertie en entier non nul. Assurez-vous que la valeur fournie est un entier non nul, ou une cha\u00EEne qui repr\u00E9sente un entier non nul.
5036=La valeur fournie pour le chemin order-by ({0}) n''est pas valide. Il doit s''agir d''un entier non nul ou d''une cha\u00EEne qui repr\u00E9sente un entier non nul.
5037=L''op\u00E9rateur $not ne peut pas encapsuler l''op\u00E9rateur {0}. 
5038=La cl\u00E9 ({0}) n''est pas autoris\u00E9e \u00E0 cet emplacement. La cl\u00E9 doit \u00EAtre un op\u00E9rateur de comparaison, $exists ou $not.
5039=$id doit uniquement \u00EAtre utilis\u00E9 au niveau sup\u00E9rieur, soit par lui-m\u00EAme soit sous $and.
5040=La valeur "datatype" pour "path" ({0}) n''est pas "string", mais "maxLength" est indiqu\u00E9. "maxLength" peut uniquement \u00EAtre indiqu\u00E9 si la valeur "datatype" est "string".
5041=Le tableau de "fields" dans une sp\u00E9cification d'index ne peut pas \u00EAtre vide.
5042=Dans une sp\u00E9cification d''index, "{0}" ne peut pas \u00EAtre indiqu\u00E9 sans sp\u00E9cifier "fields".
5043="language" doit uniquement \u00EAtre indiqu\u00E9 pour un index de texte JSON ("fields" doit \u00EAtre omis)
5044=La valeur "order" ne peut pas \u00EAtre "{0}". Les valeurs valides sont "asc", "desc", "1", "-1", 1 ou -1.
5045=L''argument pour {0} doit \u00EAtre un tableau de deux valeurs scalaires, l''une des deux ne doit pas \u00EAtre NULL.
5046=Tableau de sp\u00E9cification de patch non valide, incomplet ou \u00E9chec de l'analyse.
5047=L''op\u00E9rande pour {0} doit \u00EAtre un nombre.
5048=Le champ {0} n''est pas valide pour l''op\u00E9rateur {1}.
5049=Le champ {0} pour l''op\u00E9rateur {1} n''est pas reconnu.
5050=L''op\u00E9rateur {0} doit avoir un champ {1}.
5051=Les op\u00E9rateurs spatiaux doivent uniquement \u00EAtre utilis\u00E9s au niveau sup\u00E9rieur.
5052=$contains doit uniquement \u00EAtre utilis\u00E9 au niveau sup\u00E9rieur.
5053=L''op\u00E9rateur {0} ne peut pas encapsuler l''op\u00E9rateur {1}. 
5054=Un champ $orderby doit indiquer un chemin.
5055=Un champ $orderby ne peut pas avoir la propri\u00E9t\u00E9 "{0}".
5056=La valeur de la propri\u00E9t\u00E9 $orderby "{0}" ne peut pas \u00EAtre "{1}".
5057=La propri\u00E9t\u00E9 $orderby "{0}" doit \u00EAtre de type {1}.
5058=Les indicateurs d'index "Scalar required" et "lax" ne peuvent pas \u00EAtre tous les deux d\u00E9finis sur True.
5059="{0}" ne peut pas \u00EAtre d\u00E9fini en m\u00EAme temps que "{1}".
5060="dataguide" ne peut pas \u00EAtre "{0}". Les valeurs valides sont "on" et "off".
5061="search_on" ne peut pas \u00EAtre "{0}". Les valeurs valides sont "none", "text" et "text_value".
5062=Les \u00E9l\u00E9ments du tableau de valeurs pour {0} ne peuvent pas \u00EAtre bool\u00E9ens ou NULL.
5063={0} doit uniquement \u00EAtre utilis\u00E9 au niveau sup\u00E9rieur, soit par lui-m\u00EAme, soit sous $and.
5064=Une clause $id est autoris\u00E9e au maximum.
#
# SQL phase "run-time" errors (5500 to 5999 error code range)
#
5500=Le nombre de valeurs scalaires {0} ne correspond pas au nombre de liaisons de requ\u00EAte {1}.
5501=Op\u00E9rateur non pris en charge.
