#
# Copyright (c) 2014, 2015, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in query-by-example exceptions

#
# Syntax errors (5000 to 5499 error code range)
#
5000=Erro de sintaxe da consulta.
5001=\u00C9 necess\u00E1rio que os itens na matriz de valores para {0} sejam valores flex\u00EDveis.
5002=Era esperada uma matriz para o operador l\u00F3gico {0}.
5003=\u00C9 necess\u00E1rio que o valor para o operador $id seja uma cadeia de caracteres ou n\u00FAmero flex\u00EDvel, ou uma matriz de cadeias de caracteres ou n\u00FAmeros flex\u00EDveis
5004=Operador {0} n\u00E3o esperado.
5005=N\u00FAmero de membros {0} incorreto para o operador {1}.
5006=Valor inv\u00E1lido para a propriedade {0}: era esperado {1}; foi encontrado {2}.
5007=Falta a propriedade {0}.
5008=O percurso do campo de \u00EDndice {0} n\u00E3o \u00E9 um formato de percurso v\u00E1lido.
5009=O objeto de especifica\u00E7\u00E3o do \u00EDndice \u00E9 inv\u00E1lido, est\u00E1 incompleto ou n\u00E3o foi poss\u00EDvel analis\u00E1-lo.
5010=O objeto de especifica\u00E7\u00E3o da proje\u00E7\u00E3o \u00E9 inv\u00E1lido, est\u00E1 incompleto ou n\u00E3o foi poss\u00EDvel analis\u00E1-lo.
5011=Tipo de dados {0} n\u00E3o reconhecido ou aceit\u00E1vel para uma coluna de \u00EDndice.
5012=Comprimento {0} n\u00E3o aceit\u00E1vel para uma coluna de \u00EDndice.
5013=A l\u00EDngua {0} n\u00E3o \u00E9 reconhecida.
5014=\u00C9 necess\u00E1rio que o operando para {0} seja uma cadeia de caracteres.
5015=N\u00E3o \u00E9 poss\u00EDvel que o operando para {0} seja {1}.
5016=N\u00E3o \u00E9 poss\u00EDvel que um contentor {1} seja o operando para o operador {0}.
5017=\u00C9 necess\u00E1rio que os componentes do operador {0} sejam objetos.
5018=O nome do campo {0} n\u00E3o \u00E9 um operador reconhecido.
5019=Caracteres inv\u00E1lidos a seguir ao fim do documento JSON.
5020=A matriz cont\u00E9m a chave inv\u00E1lida {0}.
5021=\u00C9 necess\u00E1rio que o operador {0} tenha, pelo menos, um destino.
5022=N\u00E3o s\u00E3o suportados percursos com passos da matriz.
5023=N\u00E3o foi poss\u00EDvel analisar o percurso inv\u00E1lido ({0}).
5024=Percurso vazio ou nulo inv\u00E1lido.
5025=Passo vazio n\u00E3o permitido no percurso ({0}) na posi\u00E7\u00E3o {1}.
5026=O percurso ({0}) tem um valor subscrito de matriz inv\u00E1lido {1}.
5027=Passo entre aspas inv\u00E1lido no percurso ({0}) na posi\u00E7\u00E3o {1}.
5028={0} n\u00E3o fechado no fim do percurso ({1}).
5029=Falta o ponto separador no percurso ({0}) na posi\u00E7\u00E3o {1}.
5030=Falta o nome do campo no percurso ({0}) na posi\u00E7\u00E3o {1}.
5031=Erro de sintaxe do percurso na posi\u00E7\u00E3o {1} no percurso ({0}).
5032=N\u00E3o s\u00E3o permitidos v\u00E1rios operadores {0}.
5033=O valor do operador {0} tem de ser um objeto de JSON.
5034=Se $query for utilizado, n\u00E3o podem aparecer outros operadores de consulta no n\u00EDvel superior da especifica\u00E7\u00E3o do filtro.

#
# SQL phase "run-time" errors (5500 to 5999 error code range)
#
5500=O n\u00FAmero de valores flex\u00EDveis {0} n\u00E3o corresponde ao n\u00FAmero de associa\u00E7\u00F5es da consulta {1}.
5501=Operador n\u00E3o suportado.
