#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in query-by-example exceptions

#
# Syntax errors (5000 to 5499 error code range)
#
5000=Error de sintaxis de consulta.
5001=Los elementos de la matriz de valor para {0} deben ser escalares.
5002=Matriz esperada para el operador l\u00F3gico {0}.
5003=El valor para el operador $id debe ser una cadena o n\u00FAmero o una matriz de n\u00FAmeros o cadenas escalares
5004=No se esperaba el operador {0}.
5005=El n\u00FAmero de miembros {0} es incorrecto para el operador {1}.
5006=Valor no v\u00E1lido para la propiedad {0}: se esperaba {1}, se ha encontrado {2}.
5007=Falta la propiedad {0}.
5008=La ruta de acceso del campo de \u00EDndice {0} no es un formato de ruta de acceso v\u00E1lida.
5009=El objeto de especificaci\u00F3n de \u00EDndice no es v\u00E1lido, est\u00E1 incompleto o no se ha podido analizar.
5010=El objeto de especificaci\u00F3n de proyecci\u00F3n no es v\u00E1lido, est\u00E1 incompleto o no se ha podido analizar.
5011=El tipo de dato {0} no est\u00E1 reconocido o no es aceptable para una columna de \u00EDndice.
5012=La longitud {0} no es aceptable para una columna de \u00EDndice.
5013=El idioma {0} no est\u00E1 reconocido.
5014=El operando para {0} debe ser una cadena.
5015=El operando para {0} no puede ser {1}.
5016=El contenedor {1} no puede ser el operando para el operador {0}.
5017=Los componentes del operador {0} deben ser objetos.
5018=El nombre de campo {0} no es un operador reconocido.
5019=Existen caracteres no v\u00E1lidos despu\u00E9s del final del documento JSON.
5020=La matriz contiene una cadena no v\u00E1lida {0}.
5021=El operador {0} debe tener al menos un destino.
5022=No est\u00E1n soportadas las rutas de acceso con pasos de matriz.
5023=No se ha podido analizar la ruta de acceso no v\u00E1lida ({0}).
5024=Ruta de acceso nula o vac\u00EDa no v\u00E1lida.
5025=Paso vac\u00EDo no permitido en la ruta de acceso ({0}) en la posici\u00F3n {1}.
5026=La ruta de acceso ({0}) tiene un sub\u00EDndice de matriz no v\u00E1lido {1}.
5027=Paso entrecomillado no v\u00E1lido en la ruta de acceso ({0}) en la posici\u00F3n {1}.
5028={0} abierto al final de la ruta de acceso ({1}).
5029=Falta el separador de punto en la ruta de acceso ({0}) en la posici\u00F3n {1}.
5030=Falta el nombre del campo en la ruta de acceso ({0}) en la posici\u00F3n {1}.
5031=Error de sintaxis de la ruta de acceso en la posici\u00F3n {1} en la ruta de acceso ({0}).
5032=No est\u00E1n permitidos varios operadores {0}.
5033=El valor del operador {0} debe ser un objeto JSON.
5034=Si se utiliza $query, no pueden aparecer otros operadores de consulta en el nivel superior de la especificaci\u00F3n de filtro.
5035=El valor proporcionado para la ruta de acceso order-by ({0}) es ({1}), que no se puede convertir en un entero distinto de cero. Aseg\u00FArese de que el valor proporcionado es un entero distinto de cero o una cadena que representa un entero distinto de cero.
5036=El valor proporcionado para la ruta de acceso order-by ({0}) no es v\u00E1lido. Debe ser un entero distinto de cero o una cadena que representa un entero distinto de cero.
5037=El operador $not no puede encapsular el operador {0}. 
5038=La clave ({0}) no est\u00E1 permitida en esta ubicaci\u00F3n. La clave debe ser un operador de comparaci\u00F3n, $exists o $not.
5039=$id solo se debe utilizar en el nivel superior, por s\u00ED mismo o en $and.
5040=El valor "datatype" para "path" ({0}) no es "string", pero se ha especificado "maxLength". "maxLength" solo se puede especificar si el valor "datatype" es "string".
5041=La matriz de "fields" en una especificaci\u00F3n de \u00EDndice no puede estar vac\u00EDa.
5042=En una especificaci\u00F3n de \u00EDndice, "{0}" no se puede especificar sin especificar "fields".
5043="language" solo se debe especificar para un \u00EDndice de texto JSON ("fields" debe omitirse en ese caso)
5044=El valor "order" no puede ser "{0}". Los valores v\u00E1lidos son "asc", "desc", "1", "-1", 1 o -1.
5045=El argumento para {0} debe ser una matriz de dos escalares, uno de los cuales no debe ser nulo.
5046=La matriz de especificaci\u00F3n de parche no es v\u00E1lida, est\u00E1 incompleta o no se ha podido analizar.
5047=El operando para {0} debe ser un n\u00FAmero.
5048=El campo {0} no es v\u00E1lido para el operador {1}.
5049=No se reconoce el campo {0} para el operador {1}.
5050=El operador {0} debe tener un campo {1}.
5051=Los operadores espaciales solo se deben utilizar en el nivel superior.
5052=$contains solo se debe utilizar en el nivel superior.
5053=El operador {0} no puede encapsular el operador {1}. 
5054=Un campo $orderby debe especificar una ruta de acceso.
5055=Un campo $orderby no puede tener la propiedad "{0}".
5056=La propiedad $orderby "{0}" no puede tener el valor "{1}".
5057=La propiedad $orderby "{0}" debe ser de tipo {1}.
5058=Los indicadores de \u00EDndice "Escalar necesario" y "flexible" no se pueden definir como true.
5059="{0}" no se puede definir junto a "{1}".
5060="dataguide" no puede ser"{0}". Los valores v\u00E1lidos son "on" u "off".
5061="search_on" no puede ser "{0}". Los valores v\u00E1lidos son "none", "text" y "text_value".
5062=Los elementos de la matriz de valor para {0} no pueden ser un valor booleano o nulo.
5063={0} solo se debe utilizar en el nivel superior, por s\u00ED mismo o en $and.
5064=Se permite una cl\u00E1usula $id como m\u00E1ximo.
#
# SQL phase "run-time" errors (5500 to 5999 error code range)
#
5500=El n\u00FAmero de valores escalares {0} no coincide con el n\u00FAmero de enlaces de consulta {1}.
5501=Operador no soportado.
