#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in query-by-example exceptions

#
# Syntax errors (5000 to 5499 error code range)
#
5000=\u03A3\u03C6\u03AC\u03BB\u03BC\u03B1 \u03C3\u03CD\u03BD\u03C4\u03B1\u03BE\u03B7\u03C2 \u03B5\u03C1\u03C9\u03C4\u03AE\u03BC\u03B1\u03C4\u03BF\u03C2.
5001=\u03A4\u03B1 \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03B1 \u03C3\u03C4\u03BF\u03BD \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1 \u03C4\u03B9\u03BC\u03CE\u03BD \u03B3\u03B9\u03B1 {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B1\u03BD\u03CD\u03C3\u03BC\u03B1\u03C4\u03B1.
5002=\u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1\u03C2 \u03B3\u03B9\u03B1 \u03C4\u03BF\u03BD \u03BB\u03BF\u03B3\u03B9\u03BA\u03CC \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {0}.
5003=\u0397 \u03C4\u03B9\u03BC\u03AE \u03B3\u03B9\u03B1 \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE $id \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B9\u03B1 \u03B1\u03BD\u03C5\u03C3\u03BC\u03B1\u03C4\u03B9\u03BA\u03AE \u03C3\u03C5\u03BC\u03B2\u03BF\u03BB\u03BF\u03C3\u03B5\u03B9\u03C1\u03AC \u03AE \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC\u03C2 \u03AE \u03AD\u03BD\u03B1\u03C2 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1\u03C2 \u03B1\u03BD\u03C5\u03C3\u03BC\u03B1\u03C4\u03B9\u03BA\u03CE\u03BD \u03C3\u03C5\u03BC\u03B2\u03BF\u03BB\u03BF\u03C3\u03B5\u03B9\u03C1\u03CE\u03BD \u03AE \u03B1\u03C1\u03B9\u03B8\u03BC\u03CE\u03BD
5004=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 {0} \u03B4\u03B5\u03BD \u03B1\u03BD\u03B1\u03BC\u03B5\u03BD\u03CC\u03C4\u03B1\u03BD.
5005=\u039F \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC\u03C2 \u03BC\u03B5\u03BB\u03CE\u03BD {0} \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C3\u03C9\u03C3\u03C4\u03CC\u03C2 \u03B3\u03B9\u03B1 \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {1}.
5006=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C4\u03B9\u03BC\u03AE \u03B3\u03B9\u03B1 \u03C4\u03B7\u03BD \u03B9\u03B4\u03B9\u03CC\u03C4\u03B7\u03C4\u03B1 {0}: \u03B1\u03BD\u03B1\u03BC\u03B5\u03BD\u03CC\u03C4\u03B1\u03BD {1}, \u03B2\u03C1\u03AD\u03B8\u03B7\u03BA\u03B5 {2}.
5007=\u039B\u03B5\u03AF\u03C0\u03B5\u03B9 \u03B7 \u03B9\u03B4\u03B9\u03CC\u03C4\u03B7\u03C4\u03B1 {0}.
5008=\u0397 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE \u03B3\u03B9\u03B1 \u03C4\u03BF \u03C0\u03B5\u03B4\u03AF\u03BF \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5 {0} \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03BC\u03BF\u03C1\u03C6\u03AE \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE\u03C2.
5009=\u03A4\u03BF \u03B1\u03BD\u03C4\u03B9\u03BA\u03B5\u03AF\u03BC\u03B5\u03BD\u03BF \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03BF\u03CD \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF, \u03BC\u03B7 \u03BF\u03BB\u03BF\u03BA\u03BB\u03B7\u03C1\u03C9\u03BC\u03AD\u03BD\u03BF \u03AE \u03B1\u03C0\u03AD\u03C4\u03C5\u03C7\u03B5 \u03B7 \u03B1\u03BD\u03AC\u03BB\u03C5\u03C3\u03AE \u03C4\u03BF\u03C5.
5010=\u03A4\u03BF \u03B1\u03BD\u03C4\u03B9\u03BA\u03B5\u03AF\u03BC\u03B5\u03BD\u03BF \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03BF\u03CD \u03C0\u03C1\u03BF\u03B2\u03BF\u03BB\u03AE\u03C2 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF, \u03BC\u03B7 \u03BF\u03BB\u03BF\u03BA\u03BB\u03B7\u03C1\u03C9\u03BC\u03AD\u03BD\u03BF \u03AE \u03B1\u03C0\u03AD\u03C4\u03C5\u03C7\u03B5 \u03B7 \u03B1\u03BD\u03AC\u03BB\u03C5\u03C3\u03AE \u03C4\u03BF\u03C5.
5011=\u039F \u03C4\u03CD\u03C0\u03BF\u03C2 \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD {0} \u03B4\u03B5\u03BD \u03B1\u03BD\u03B1\u03B3\u03BD\u03C9\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03AE \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B1\u03C0\u03BF\u03B4\u03B5\u03BA\u03C4\u03CC\u03C2 \u03B3\u03B9\u03B1 \u03BC\u03B9\u03B1 \u03C3\u03C4\u03AE\u03BB\u03B7 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5.
5012=\u03A4\u03BF \u03BC\u03AE\u03BA\u03BF\u03C2 {0} \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B1\u03C0\u03BF\u03B4\u03B5\u03BA\u03C4\u03CC \u03B3\u03B9\u03B1 \u03BC\u03B9\u03B1 \u03C3\u03C4\u03AE\u03BB\u03B7 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5.
5013=\u0397 \u03B3\u03BB\u03CE\u03C3\u03C3\u03B1 {0} \u03B4\u03B5\u03BD \u03B1\u03BD\u03B1\u03B3\u03BD\u03C9\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9.
5014=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AD\u03BF\u03C2 \u03B3\u03B9\u03B1 {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C3\u03C5\u03BC\u03B2\u03BF\u03BB\u03BF\u03C3\u03B5\u03B9\u03C1\u03AC.
5015=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AD\u03BF\u03C2 \u03B3\u03B9\u03B1 {0} \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 {1}.
5016=\u0388\u03BD\u03B1 \u03BA\u03BF\u03BD\u03C4\u03AD\u03B9\u03BD\u03B5\u03C1 {1} \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BF \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AD\u03BF\u03C2 \u03B3\u03B9\u03B1 \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {0}.
5017=\u03A4\u03B1 \u03C3\u03C5\u03C3\u03C4\u03B1\u03C4\u03B9\u03BA\u03AC \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03B1 \u03C4\u03BF\u03C5 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B1\u03BD\u03C4\u03B9\u03BA\u03B5\u03AF\u03BC\u03B5\u03BD\u03B1.
5018=\u03A4\u03BF \u03CC\u03BD\u03BF\u03BC\u03B1 \u03C4\u03BF\u03C5 \u03C0\u03B5\u03B4\u03AF\u03BF\u03C5 {0} \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B1\u03BD\u03B1\u03B3\u03BD\u03C9\u03C1\u03B9\u03C3\u03BC\u03AD\u03BD\u03BF\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2.
5019=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03B9 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03B5\u03C2 \u03BC\u03B5\u03C4\u03AC \u03C4\u03BF \u03C4\u03AD\u03BB\u03BF\u03C2 \u03C4\u03BF\u03C5 \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 JSON.
5020=\u039F \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1\u03C2 \u03C0\u03B5\u03C1\u03B9\u03AD\u03C7\u03B5\u03B9 \u03BC\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF {0}.
5021=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03AD\u03C7\u03B5\u03B9 \u03C4\u03BF\u03C5\u03BB\u03AC\u03C7\u03B9\u03C3\u03C4\u03BF\u03BD \u03AD\u03BD\u03B1\u03BD \u03C0\u03C1\u03BF\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC.
5022=\u0394\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AD\u03C2 \u03BC\u03B5 \u03B2\u03AE\u03BC\u03B1\u03C4\u03B1 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1.
5023=\u0394\u03B5\u03BD \u03AE\u03C4\u03B1\u03BD \u03B4\u03C5\u03BD\u03B1\u03C4\u03AE \u03B7 \u03B1\u03BD\u03AC\u03BB\u03C5\u03C3\u03B7 \u03C4\u03B7\u03C2 \u03BC\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7\u03C2 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE\u03C2 ({0}).
5024=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03BA\u03B5\u03BD\u03AE \u03AE null \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE.
5025=\u0394\u03B5\u03BD \u03B5\u03C0\u03B9\u03C4\u03C1\u03AD\u03C0\u03B5\u03C4\u03B1\u03B9 \u03BA\u03B5\u03BD\u03CC \u03B2\u03AE\u03BC\u03B1 \u03C3\u03C4\u03B7 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE ({0}) \u03C3\u03C4\u03B7 \u03B8\u03AD\u03C3\u03B7 {1}.
5026=\u0397 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE ({0}) \u03AD\u03C7\u03B5\u03B9 \u03BC\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03B4\u03B5\u03AF\u03BA\u03C4\u03B7 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1 {1}.
5027=\u0394\u03B5\u03BD \u03B5\u03C0\u03B9\u03C4\u03C1\u03AD\u03C0\u03B5\u03C4\u03B1\u03B9 \u03B2\u03AE\u03BC\u03B1 \u03B5\u03BD\u03C4\u03CC\u03C2 \u03B5\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03B9\u03BA\u03CE\u03BD \u03C3\u03C4\u03B7 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE ({0}) \u03C3\u03C4\u03B7 \u03B8\u03AD\u03C3\u03B7 {1}.
5028=\u03A5\u03C0\u03AC\u03C1\u03C7\u03B5\u03B9 {0} \u03C0\u03BF\u03C5 \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03B9 \u03BA\u03BB\u03B5\u03AF\u03C3\u03B5\u03B9 \u03C3\u03C4\u03BF \u03C4\u03AD\u03BB\u03BF\u03C2 \u03C4\u03B7\u03C2 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE\u03C2 ({1}).
5029=\u039B\u03B5\u03AF\u03C0\u03B5\u03B9 \u03B4\u03B9\u03B1\u03C7\u03C9\u03C1\u03B9\u03C3\u03C4\u03B9\u03BA\u03CC \u03C4\u03B5\u03BB\u03B5\u03AF\u03B1\u03C2 \u03C3\u03C4\u03B7 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE ({0}) \u03C3\u03C4\u03B7 \u03B8\u03AD\u03C3\u03B7 {1}.
5030=\u039B\u03B5\u03AF\u03C0\u03B5\u03B9 \u03C4\u03BF \u03CC\u03BD\u03BF\u03BC\u03B1 \u03C0\u03B5\u03B4\u03AF\u03BF\u03C5 \u03C3\u03C4\u03B7 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE ({0}) \u03C3\u03C4\u03B7 \u03B8\u03AD\u03C3\u03B7 {1}.
5031=\u03A3\u03C6\u03AC\u03BB\u03BC\u03B1 \u03C3\u03CD\u03BD\u03C4\u03B1\u03BE\u03B7\u03C2 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE\u03C2 \u03C3\u03C4\u03B7 \u03B8\u03AD\u03C3\u03B7 {1} \u03C3\u03C4\u03B7 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE ({0}).
5032=\u0394\u03B5\u03BD \u03B5\u03C0\u03B9\u03C4\u03C1\u03AD\u03C0\u03BF\u03BD\u03C4\u03B1\u03B9 \u03C0\u03BF\u03BB\u03BB\u03B1\u03C0\u03BB\u03BF\u03AF \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AD\u03C2 {0}.
5033=\u0397 \u03C4\u03B9\u03BC\u03AE \u03C4\u03BF\u03C5 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B1\u03BD\u03C4\u03B9\u03BA\u03B5\u03AF\u03BC\u03B5\u03BD\u03BF JSON.
5034=\u0391\u03BD \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B7\u03B8\u03B5\u03AF \u03C4\u03BF $query, \u03BF\u03B9 \u03C5\u03C0\u03CC\u03BB\u03BF\u03B9\u03C0\u03BF\u03B9 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AD\u03C2 \u03B5\u03C1\u03C9\u03C4\u03AE\u03BC\u03B1\u03C4\u03BF\u03C2 \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03BD \u03BD\u03B1 \u03B5\u03BC\u03C6\u03B1\u03BD\u03AF\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03C3\u03C4\u03BF \u03BA\u03BF\u03C1\u03C5\u03C6\u03B1\u03AF\u03BF \u03B5\u03C0\u03AF\u03C0\u03B5\u03B4\u03BF \u03C4\u03C9\u03BD \u03C0\u03C1\u03BF\u03B4\u03B9\u03B1\u03B3\u03C1\u03B1\u03C6\u03CE\u03BD \u03C6\u03AF\u03BB\u03C4\u03C1\u03BF\u03C5.
5035=\u0397 \u03C0\u03B1\u03C1\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03B7 \u03C4\u03B9\u03BC\u03AE \u03B3\u03B9\u03B1 \u03C4\u03B7 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE "\u03C3\u03B5\u03B9\u03C1\u03AC \u03BA\u03B1\u03C4\u03AC" ({0}) \u03B5\u03AF\u03BD\u03B1\u03B9 ({1}) \u03BA\u03B1\u03B9 \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BC\u03B5\u03C4\u03B1\u03C4\u03C1\u03B1\u03C0\u03B5\u03AF \u03C3\u03B5 \u03BC\u03B7 \u03BC\u03B7\u03B4\u03B5\u03BD\u03B9\u03BA\u03AE \u03B1\u03BA\u03AD\u03C1\u03B1\u03B9\u03B1 \u03C4\u03B9\u03BC\u03AE. \u0392\u03B5\u03B2\u03B1\u03B9\u03C9\u03B8\u03B5\u03AF\u03C4\u03B5 \u03CC\u03C4\u03B9 \u03B7 \u03C0\u03B1\u03C1\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03B7 \u03C4\u03B9\u03BC\u03AE \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B9\u03B1 \u03BC\u03B7 \u03BC\u03B7\u03B4\u03B5\u03BD\u03B9\u03BA\u03AE \u03B1\u03BA\u03AD\u03C1\u03B1\u03B9\u03B1 \u03C4\u03B9\u03BC\u03AE \u03AE \u03BC\u03B9\u03B1 \u03C3\u03C5\u03BC\u03B2\u03BF\u03BB\u03BF\u03C3\u03B5\u03B9\u03C1\u03AC \u03C0\u03BF\u03C5 \u03B1\u03BD\u03B1\u03C0\u03B1\u03C1\u03B9\u03C3\u03C4\u03AC \u03BC\u03B9\u03B1 \u03BC\u03B7 \u03BC\u03B7\u03B4\u03B5\u03BD\u03B9\u03BA\u03AE \u03B1\u03BA\u03AD\u03C1\u03B1\u03B9\u03B1 \u03C4\u03B9\u03BC\u03AE.
5036=\u0397 \u03C0\u03B1\u03C1\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03B7 \u03C4\u03B9\u03BC\u03AE \u03B3\u03B9\u03B1 \u03C4\u03B7 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE "\u03C3\u03B5\u03B9\u03C1\u03AC \u03BA\u03B1\u03C4\u03AC" ({0}) \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7. \u03A0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B9\u03B1 \u03BC\u03B7 \u03BC\u03B7\u03B4\u03B5\u03BD\u03B9\u03BA\u03AE \u03B1\u03BA\u03AD\u03C1\u03B1\u03B9\u03B1 \u03C4\u03B9\u03BC\u03AE \u03AE \u03BC\u03B9\u03B1 \u03C3\u03C5\u03BC\u03B2\u03BF\u03BB\u03BF\u03C3\u03B5\u03B9\u03C1\u03AC \u03C0\u03BF\u03C5 \u03B1\u03BD\u03B1\u03C0\u03B1\u03C1\u03B9\u03C3\u03C4\u03AC \u03BC\u03B9\u03B1 \u03BC\u03B7 \u03BC\u03B7\u03B4\u03B5\u03BD\u03B9\u03BA\u03AE \u03B1\u03BA\u03AD\u03C1\u03B1\u03B9\u03B1 \u03C4\u03B9\u03BC\u03AE.
5037=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 $not \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03C0\u03B5\u03C1\u03B9\u03BA\u03BB\u03B5\u03AF\u03B5\u03B9 \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {0}. 
5038=\u03A4\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF ({0}) \u03B4\u03B5\u03BD \u03B5\u03C0\u03B9\u03C4\u03C1\u03AD\u03C0\u03B5\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03B1\u03C5\u03C4\u03AE\u03BD \u03C4\u03B7\u03BD \u03C4\u03BF\u03C0\u03BF\u03B8\u03B5\u03C3\u03AF\u03B1. \u03A4\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 \u03C3\u03CD\u03B3\u03BA\u03C1\u03B9\u03C3\u03B7\u03C2, \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 $exists \u03AE $not.
5039=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 $id \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03C3\u03C4\u03BF \u03B1\u03BD\u03CE\u03C4\u03B1\u03C4\u03BF \u03B5\u03C0\u03AF\u03C0\u03B5\u03B4\u03BF, \u03B5\u03AF\u03C4\u03B5 \u03B1\u03C5\u03C4\u03BF\u03CD\u03C3\u03B9\u03BF\u03C2 \u03B5\u03AF\u03C4\u03B5 \u03C5\u03C0\u03CC \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE $and.
5040=\u0397 \u03C4\u03B9\u03BC\u03AE "datatype" \u03B3\u03B9\u03B1 \u03C4\u03BF "path" ({0}) \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 "string", \u03B1\u03BB\u03BB\u03AC \u03BA\u03B1\u03B8\u03BF\u03C1\u03AF\u03C3\u03C4\u03B7\u03BA\u03B5 \u03C4\u03BF "maxLength". \u03A4\u03BF "maxLength" \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03BC\u03CC\u03BD\u03BF \u03B5\u03AC\u03BD \u03B7 \u03C4\u03B9\u03BC\u03AE "datatype" \u03B5\u03AF\u03BD\u03B1\u03B9 "string".
5041=\u039F \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1\u03C2 \u03C4\u03BF\u03C5 \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF\u03C5 "fields" \u03C3\u03B5 \u03AD\u03BD\u03B1\u03BD \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5 \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BA\u03B5\u03BD\u03CC\u03C2.
5042=\u03A3\u03B5 \u03AD\u03BD\u03B1\u03BD \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5, \u03C4\u03BF "{0}" \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03C7\u03C9\u03C1\u03AF\u03C2 \u03C4\u03BF\u03BD \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC \u03C4\u03BF\u03C5 \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF\u03C5 "fields".
5043=\u03A4\u03BF \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF "language" \u03B8\u03B1 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03B3\u03B9\u03B1 \u03AD\u03BD\u03B1 \u03B5\u03C5\u03C1\u03B5\u03C4\u03AE\u03C1\u03B9\u03BF \u03BA\u03B5\u03B9\u03BC\u03AD\u03BD\u03BF\u03C5 JSON (\u03C3\u03B5 \u03B1\u03C5\u03C4\u03AE\u03BD \u03C4\u03B7\u03BD \u03C0\u03B5\u03C1\u03AF\u03C0\u03C4\u03C9\u03C3\u03B7, \u03C4\u03BF \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF "fields" \u03B8\u03B1 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C0\u03B1\u03C1\u03B1\u03BB\u03B5\u03AF\u03C0\u03B5\u03C4\u03B1\u03B9)
5044=\u0397 \u03C4\u03B9\u03BC\u03AE "order" \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 "{0}". \u039F\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B5\u03C2 \u03C4\u03B9\u03BC\u03AD\u03C2 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BF\u03B9 \u03B5\u03BE\u03AE\u03C2: "asc", "desc", "1", "-1", 1 \u03AE -1.
5045=\u03A4\u03BF \u03CC\u03C1\u03B9\u03C3\u03BC\u03B1 \u03B3\u03B9\u03B1 \u03C4\u03BF {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03BD\u03B1\u03C2 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1\u03C2 \u03B4\u03CD\u03BF \u03B1\u03BD\u03C5\u03C3\u03BC\u03B1\u03C4\u03B9\u03BA\u03CE\u03BD \u03C4\u03B9\u03BC\u03CE\u03BD, \u03BC\u03AF\u03B1 \u03B5\u03BA \u03C4\u03C9\u03BD \u03BF\u03C0\u03BF\u03AF\u03C9\u03BD \u03B4\u03B5\u03BD \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 null.
5046=\u039F \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1\u03C2 \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03BF\u03CD \u03B5\u03C0\u03B9\u03B4\u03B9\u03CC\u03C1\u03B8\u03C9\u03C3\u03B7\u03C2 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03C2, \u03BC\u03B7 \u03BF\u03BB\u03BF\u03BA\u03BB\u03B7\u03C1\u03C9\u03BC\u03AD\u03BD\u03BF\u03C2 \u03AE \u03B1\u03C0\u03AD\u03C4\u03C5\u03C7\u03B5 \u03B7 \u03B1\u03BD\u03AC\u03BB\u03C5\u03C3\u03AE \u03C4\u03BF\u03C5.
5047=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AD\u03BF\u03C2 \u03B3\u03B9\u03B1 {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC\u03C2.
5048=\u03A4\u03BF \u03C0\u03B5\u03B4\u03AF\u03BF {0} \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03B3\u03B9\u03B1 \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {1}.
5049=\u03A4\u03BF \u03C0\u03B5\u03B4\u03AF\u03BF {0} \u03B3\u03B9\u03B1 \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {1} \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B7 \u03B1\u03BD\u03B1\u03B3\u03BD\u03C9\u03C1\u03AF\u03C3\u03B9\u03BC\u03BF.
5050=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03AD\u03C7\u03B5\u03B9 \u03AD\u03BD\u03B1 \u03C0\u03B5\u03B4\u03AF\u03BF {1}.
5051=\u039F\u03B9 \u03C7\u03C9\u03C1\u03B9\u03BA\u03BF\u03AF \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AD\u03C2 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03BF\u03CD\u03BD\u03C4\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03C3\u03C4\u03BF \u03B1\u03BD\u03CE\u03C4\u03B1\u03C4\u03BF \u03B5\u03C0\u03AF\u03C0\u03B5\u03B4\u03BF.
5052=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 $contains \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03C3\u03C4\u03BF \u03B1\u03BD\u03CE\u03C4\u03B1\u03C4\u03BF \u03B5\u03C0\u03AF\u03C0\u03B5\u03B4\u03BF.
5053=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 {0} \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03C0\u03B5\u03C1\u03B9\u03BA\u03BB\u03B5\u03AF\u03B5\u03B9 \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE {1}. 
5054=\u03A4\u03BF \u03C0\u03B5\u03B4\u03AF\u03BF $orderby \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03AF\u03B6\u03B5\u03B9 \u03BC\u03B9\u03B1 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE.
5055=\u03A4\u03BF \u03C0\u03B5\u03B4\u03AF\u03BF $orderby \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03AD\u03C7\u03B5\u03B9 \u03C4\u03B7\u03BD \u03B9\u03B4\u03B9\u03CC\u03C4\u03B7\u03C4\u03B1 "{0}".
5056=\u0397 \u03B9\u03B4\u03B9\u03CC\u03C4\u03B7\u03C4\u03B1 $orderby "{0}" \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03AD\u03C7\u03B5\u03B9 \u03C4\u03B9\u03BC\u03AE "{1}".
5057=\u0397 \u03B9\u03B4\u03B9\u03CC\u03C4\u03B7\u03C4\u03B1 $orderby "{0}" \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03AD\u03C7\u03B5\u03B9 \u03C4\u03CD\u03C0\u03BF {1}.
5058=\u039F\u03B9 \u03B5\u03BD\u03B4\u03B5\u03AF\u03BA\u03C4\u03B5\u03C2 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5 "Scalar required" \u03BA\u03B1\u03B9 "lax" \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03BD \u03BD\u03B1 \u03AD\u03C7\u03BF\u03C5\u03BD \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03C4\u03B1\u03C5\u03C4\u03CC\u03C7\u03C1\u03BF\u03BD\u03B1 \u03C3\u03B5 true.
5059=\u03A4\u03BF "{0}" \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03C3\u03B5 \u03C3\u03C5\u03BD\u03B4\u03C5\u03B1\u03C3\u03BC\u03CC \u03BC\u03B5 \u03C4\u03BF "{1}".
5060=\u03A4\u03BF \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF "dataguide" \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 "{0}". \u039F\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B5\u03C2 \u03C4\u03B9\u03BC\u03AD\u03C2 \u03B5\u03AF\u03BD\u03B1\u03B9 "\u03B5\u03BD\u03B5\u03C1\u03B3\u03CC" \u03AE "\u03B1\u03BD\u03B5\u03BD\u03B5\u03C1\u03B3\u03CC".
5061=\u03A4\u03BF \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF "search_on" \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 "{0}". \u039F\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B5\u03C2 \u03C4\u03B9\u03BC\u03AD\u03C2 \u03B5\u03AF\u03BD\u03B1\u03B9 "none", "text" \u03BA\u03B1\u03B9 "text_value".
5062=\u03A4\u03B1 \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03B1 \u03C3\u03C4\u03BF\u03BD \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1 \u03C4\u03B9\u03BC\u03CE\u03BD \u03B3\u03B9\u03B1 \u03C4\u03BF {0} \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03BD \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C4\u03B9\u03BC\u03AD\u03C2 boolean \u03AE null.
5063=\u039F \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03C3\u03C4\u03BF \u03B1\u03BD\u03CE\u03C4\u03B1\u03C4\u03BF \u03B5\u03C0\u03AF\u03C0\u03B5\u03B4\u03BF, \u03B5\u03AF\u03C4\u03B5 \u03B1\u03C5\u03C4\u03BF\u03CD\u03C3\u03B9\u03BF\u03C2 \u03B5\u03AF\u03C4\u03B5 \u03C5\u03C0\u03CC \u03C4\u03BF\u03BD \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE $and.
5064=\u0395\u03C0\u03B9\u03C4\u03C1\u03AD\u03C0\u03B5\u03C4\u03B1\u03B9 \u03AD\u03C9\u03C2 \u03BA\u03B1\u03B9 \u03AD\u03BD\u03B1\u03C2 \u03CC\u03C1\u03BF\u03C2 $id.
#
# SQL phase "run-time" errors (5500 to 5999 error code range)
#
5500=\u039F \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC\u03C2 \u03B1\u03BD\u03C5\u03C3\u03BC\u03B1\u03C4\u03B9\u03BA\u03CE\u03BD \u03C4\u03B9\u03BC\u03CE\u03BD {0} \u03B4\u03B5\u03BD \u03C3\u03C5\u03BC\u03C6\u03C9\u03BD\u03B5\u03AF \u03BC\u03B5 \u03C4\u03BF\u03BD \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC \u03C4\u03C9\u03BD \u03B4\u03B5\u03C3\u03BC\u03B5\u03CD\u03C3\u03B5\u03C9\u03BD \u03B5\u03C1\u03C9\u03C4\u03AE\u03BC\u03B1\u03C4\u03BF\u03C2 {1}.
5501=\u039C\u03B7 \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03B9\u03B6\u03CC\u03BC\u03B5\u03BD\u03BF\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2.
