#
# Copyright (c) 2014, 2023, Oracle and/or its affiliates.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=La recopilaci\u00F3n {0} es de solo lectura, {1} no est\u00E1 permitido.
2001=La recopilaci\u00F3n {0} no tiene ning\u00FAn registro de hora que indique la \u00FAltima modificaci\u00F3n.
2002=Condici\u00F3n de filtro no v\u00E1lida.
2003=El descriptor no coincide con la recopilaci\u00F3n existente.
2004=El argumento {0} no puede ser nulo.
2005=El juego {0} est\u00E1 vac\u00EDo.
2006=Los argumentos ''since'' y ''until'' no pueden ser nulos.
2007=La recopilaci\u00F3n {0} no tiene ninguna versi\u00F3n.
2008=El argumento {0} debe ser positivo.
2009=El n\u00FAmero total de claves especificado mediante los m\u00E9todos key(), keys() o filter() es {0}, que excede el l\u00EDmite m\u00E1ximo de {1}.
2010=El iterador {0} ha devuelto un valor nulo despu\u00E9s de devolver {1} documentos.
2011=Valor de argumento no v\u00E1lido "{0}".
2012=No se puede definir una longitud m\u00E1xima para tipos LOB o un tipo JSON.
2013=La configuraci\u00F3n de SecureFile LOB no se puede utilizar cuando el tipo de columna de contenido es "{0}"
2014=El \u00EDndice de columna last-modified solo se puede definir cuando est\u00E1 definido el nombre de la columna last-modified.
2015=Si el m\u00E9todo de asignaci\u00F3n es "SEQUENCE", se debe especificar un nombre de secuencia de columna de clave.
2016=Se ha especificado un m\u00E9todo de versi\u00F3n, pero no se ha especificado el nombre de la columna de versi\u00F3n.
2017=El tipo de columna de clave especificado no se puede utilizar con una longitud m\u00E1xima.
2018=Al utilizar GUID o UUID para asignar valores de clave de tipo de car\u00E1cter, la longitud de la columna de clave debe tener 32 bytes o m\u00E1s.
2019=Puede que la recopilaci\u00F3n no tenga una columna de tipo de medio a menos que el tipo de columna de contenido sea BLOB.
2020=El tipo de medio del documento no es "application/json". getContentAsString() solo est\u00E1 soportado para documentos JSON.
2021=El juego {0} contiene un valor nulo.
2022=La clave para el documento que se va a sustituir se debe especificar con el m\u00E9todo key().
2023=El argumento {0} no debe tener un valor no negativo.
2024=Especificaci\u00F3n de creaci\u00F3n de \u00EDndice no v\u00E1lida.
2025=Especificaci\u00F3n de borrado de \u00EDndice no v\u00E1lida.
2026=El documento de metadatos de recopilaci\u00F3n no tiene contenido o \u00E9ste est\u00E1 vac\u00EDo.
2027=El documento de metadatos de recopilaci\u00F3n no es un JSON v\u00E1lido.
2028=El documento de metadatos de recopilaci\u00F3n no es un JSON v\u00E1lido, no se ha podido determinar la codificaci\u00F3n.
2029=Se ha producido una excepci\u00F3n de E/S al procesar el documento de metadatos de recopilaci\u00F3n.
2030=Valor no v\u00E1lido para "{0}" en los metadatos de recopilaci\u00F3n.
2031=Los metadatos de recopilaci\u00F3n deben ser un objeto JSON.
2032=La clave de objeto "{0}" es inesperada en los metadatos de recopilaci\u00F3n.
2033=La recopilaci\u00F3n no est\u00E1 configurada con claves asignadas por el cliente, pero el documento de entrada tiene una clave.
2034=La recopilaci\u00F3n no est\u00E1 configurada con una clave asignada por el cliente, pero el iterador {0} ha devuelto un documento con una clave despu\u00E9s de devolver {1} documentos.
2035=La llamada a getCurrentSchema() en la conexi\u00F3n JDBC proporcionada es nula.
2036=Especificaci\u00F3n de proyecci\u00F3n no v\u00E1lida.
2037=El valor {0} no es una clave v\u00E1lida de tipo {1}.
2038=La solicitud de \u00EDndice tiene m\u00E1s de {0} columnas.
2039=No se puede crear el \u00EDndice en el contenido cifrado. La indexaci\u00F3n solo est\u00E1 permitida si el cifrado de la columna de contenido est\u00E1 definido en NONE.
2040=No se puede llamar a next() en un cursor cerrado.
2041=Error al intentar borrar la recopilaci\u00F3n. Aseg\u00FArese de que se han confirmado todas las escrituras pendientes en la recopilaci\u00F3n.
2042=Esta operaci\u00F3n necesita SODA para iniciar una transacci\u00F3n, pero hay un error al desactivar la autoconfirmaci\u00F3n de conexi\u00F3n JDBC.
2043=El documento de especificaci\u00F3n {0} no tiene contenido o \u00E9ste est\u00E1 vac\u00EDo.
2045=La especificaci\u00F3n de protecci\u00F3n no deber\u00EDa contener reglas que se han incluido y excluido mezcladas.
2046=La ruta de acceso para un \u00EDndice u orden por condici\u00F3n no debe contener el paso de matriz.
2047=La conexi\u00F3n debe ser una OracleConnection o un envoltorio para una OracleConnection.
2048=El par\u00E1metro de idioma no est\u00E1 soportado con un \u00EDndice de texto de Oracle Database 12.1.0.2.
2049=El modo por defecto del \u00EDndice funcional se basa en la cl\u00E1usula "nula o vac\u00EDa" de json_value soportada desde la versi\u00F3n de Oracle Database 12.2.0.1. Los modos "scalarRequired" y "lax" est\u00E1n soportados en la versi\u00F3n 12.1.0.2. Nota: Los \u00EDndices "lax" no se usan en las consultas mediante ejemplos (QBE), por lo que se recomienda usar "scalarRequired".
2050="{0}" no se puede especificar para un \u00EDndice de texto de Oracle Database 12.1.0.2.
2051=La operaci\u00F3n "{0}" requiere una gesti\u00F3n de transacciones cuando la conexi\u00F3n est\u00E1 en modo de confirmaci\u00F3n autom\u00E1tica, pero el indicador "avoidTxnManagement" se define en true en la instancia de Oracle Database. Desactive el modo de confirmaci\u00F3n autom\u00E1tica para ejecutar la operaci\u00F3n.
2052=keyLike() solo se puede especificar para una recopilaci\u00F3n de claves asignadas por el cliente y una columna de claves del tipo varchar2.
2053=Ya existe un \u00EDndice con el nombre especificado en el esquema.
2054=La omisi\u00F3n o el l\u00EDmite no se pueden definir para una operaci\u00F3n de recuento.
2055=El par\u00E1metro textIndex121WithLang definido en true no est\u00E1 soportado en las versiones de base de datos superiores a 12.2.
2056=La especificaci\u00F3n de proyecci\u00F3n no deber\u00EDa contener pasos de matriz.
2057=En una especificaci\u00F3n de proyecci\u00F3n, las rutas no pueden tener un mismo prefijo.
2058=El m\u00E9todo {0} no se puede especificar junto con el m\u00E9todo {1}.
2059=Se ha producido un error durante la conversi\u00F3n a binario del contenido JSON del documento de entrada. Aseg\u00FArese de que este documento incluye contenido JSON v\u00E1lido.
2060=Se ha producido un error durante la conversi\u00F3n de JSON binario a JSON textual.
2061=La ruta de acceso especificada para la clave de documento no es v\u00E1lida.
2062=No se ha podido extraer la ruta de acceso del documento.
2063=No se ha podido insertar la ruta de acceso en el documento.
2064=No se debe especificar la validaci\u00F3n cuando el valor de contentColumn.sqlType es JSON.
2065=Tipo no soportado: {0}
2066=La indicaci\u00F3n {0} no es del tipo cadena, o contiene /* o */.
2067=La recopilaci\u00F3n est\u00E1 utilizando el almacenamiento de OSON, que necesita JDBC 19.6 o una versi\u00F3n jar superior.
2068=La recopilaci\u00F3n est\u00E1 utilizando el tipo de almacenamiento de OSON, que necesita JDBC 21.1 o una versi\u00F3n jar superior.
2069=La recopilaci\u00F3n asignada PURGE y DROP solo est\u00E1 soportada en la versi\u00F3n 21c de Oracle Database o superior.
2070=El tama\u00F1o del lote {0} no es de tipo entero.
2071=La ruta de acceso especificada para la clave de documento no es v\u00E1lida.
2072=No se ha podido extraer la ruta de acceso del documento.
2073=No se ha podido insertar la ruta de acceso en el documento.
2074=Se necesita JDBC 19.6 o una versi\u00F3n jar superior para esta operaci\u00F3n.
2075=Se necesita JDBC 21.1 o una versi\u00F3n jar superior para esta operaci\u00F3n.
2076=El par\u00E1metro de formato no es de tipo cadena o se ha definido en un valor no soportado.
2077=No se puede especificar eJSON si la columna de contenido de la recopilaci\u00F3n no almacena JSON binario.
2078=No se puede especificar eJSON si el documento tiene contenido binario.
2079=eJSON no est\u00E1 soportado para esta operaci\u00F3n.
2080=El documento eJSON debe ser un objeto JSON.
2081=La cadena proporcionada {0} no se puede convertir en un n\u00FAmero.
2082=Valor no v\u00E1lido en eJSON para el campo _id de tipo "{0}".s
2083=Clave no v\u00E1lida "{0}" en eJSON en el campo _id.
2084=Valor _id no v\u00E1lido en eJSON.
2089=Las cl\u00E1usulas de b\u00FAsqueda espaciales y de texto no est\u00E1n soportadas para esta operaci\u00F3n.
2090=La cl\u00E1usula $id no est\u00E1 soportada para esta operaci\u00F3n.
2091=La ruta DISTINCT no deber\u00EDa contener pasos de matriz.
2092=La ruta proporcionada es nula o est\u00E1 vac\u00EDa
2093=La especificaci\u00F3n de filtro no es un objeto JSON v\u00E1lido.
2094=DistinctStrict est\u00E1 soportado en Oracle Database 23c y superior.
2095=Los \u00EDndices TTL est\u00E1n soportados en la versi\u00F3n 19c de Oracle Database (y superior).


#
# Internal errors  (2500 to 2999 error code range)
#
2500=La recopilaci\u00F3n {0} no puede tener contenido binario en el tipo de columna {1}.
2501=La recopilaci\u00F3n {0} utiliza el control de versiones {1}, las escrituras de flujo no est\u00E1n permitidas.
2502=Fallo al guardar el documento para la recopilaci\u00F3n de {0}.
2503=Fallo al insertar el documento en la recopilaci\u00F3n {0}.
2504=No se ha podido generar la clave basada en UUID.
2505=El documento con clave {0} tiene un tama\u00F1o {1}, que supera el l\u00EDmite de 2 GB.
2506=La asignaci\u00F3n de clave de IDENTITY necesita el soporte de RETURNING en SQL.
2507=Error al obtener la versi\u00F3n de la base de datos.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=No est\u00E1 soportado el truncamiento. La recopilaci\u00F3n {0} no est\u00E1 basada en tablas.
3001=El \u00EDndice de b\u00FAsqueda JSON no est\u00E1 implantado para las columnas de contenido con tipo {0}.
3002=El \u00EDndice de b\u00FAsqueda JSON no est\u00E1 implantado para las recopilaciones con claves NVARCHAR2.
3003=Java Virtual Machine (JVM) no soporta el algoritmo de control de versiones MD5. Cambie a otro algoritmo de control de versiones.
3004=Java Virtual Machine (JVM) no soporta el algoritmo de control de versiones SHA256. Cambie a otro algoritmo de control de versiones.
3005=No se ha implantado la funci\u00F3n.
3006=La indexaci\u00F3n espacial JSON no est\u00E1 soportada en las recopilaciones heterog\u00E9neas.
3007=La indexaci\u00F3n de b\u00FAsqueda JSON no est\u00E1 soportada en las recopilaciones heterog\u00E9neas.
3008=La indexaci\u00F3n funcional JSON no est\u00E1 soportada en las recopilaciones heterog\u00E9neas.
3009=La consulta mediante ejemplo (QBE) no est\u00E1 soportada en las recopilaciones heterog\u00E9neas.
