#
# Copyright (c) 2014, 2023, Oracle and/or its affiliates.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE {0} \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03B3\u03B9\u03B1 \u03B1\u03BD\u03AC\u03B3\u03BD\u03C9\u03C3\u03B7, {1} \u03B4\u03B5\u03BD \u03B5\u03C0\u03B9\u03C4\u03C1\u03AD\u03C0\u03B5\u03C4\u03B1\u03B9.
2001=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE {0} \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03B9 \u03C7\u03C1\u03BF\u03BD\u03B9\u03BA\u03AE \u03AD\u03BD\u03B4\u03B5\u03B9\u03BE\u03B7 \u03B3\u03B9\u03B1 \u03C4\u03B7\u03BD \u03C4\u03B5\u03BB\u03B5\u03C5\u03C4\u03B1\u03AF\u03B1 \u03C4\u03C1\u03BF\u03C0\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7.
2002=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C3\u03C5\u03BD\u03B8\u03AE\u03BA\u03B7 \u03C6\u03B9\u03BB\u03C4\u03C1\u03B1\u03C1\u03AF\u03C3\u03BC\u03B1\u03C4\u03BF\u03C2.
2003=\u039F \u03C0\u03B1\u03C1\u03AC\u03B3\u03BF\u03BD\u03C4\u03B1\u03C2 \u03C0\u03B5\u03C1\u03B9\u03B3\u03C1\u03B1\u03C6\u03AE\u03C2 \u03B4\u03B5\u03BD \u03C3\u03C5\u03BC\u03C6\u03C9\u03BD\u03B5\u03AF \u03BC\u03B5 \u03C4\u03B7\u03BD \u03C5\u03C0\u03AC\u03C1\u03C7\u03BF\u03C5\u03C3\u03B1 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE.
2004=\u03A4\u03BF \u03CC\u03C1\u03B9\u03C3\u03BC\u03B1 {0} \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 null.
2005=\u03A4\u03BF \u03C3\u03CD\u03BD\u03BF\u03BB\u03BF {0} \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BA\u03B5\u03BD\u03CC.
2006=\u03A4\u03B1 \u03BF\u03C1\u03AF\u03C3\u03BC\u03B1\u03C4\u03B1 ''since'' \u03BA\u03B1\u03B9 ''until'' \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BA\u03B1\u03B9 \u03C4\u03B1 \u03B4\u03CD\u03BF null.
2007=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE {0} \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03B9 \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7.
2008=\u03A4\u03BF \u03CC\u03C1\u03B9\u03C3\u03BC\u03B1 {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B8\u03B5\u03C4\u03B9\u03BA\u03CC\u03C2 \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC\u03C2.
2009=\u039F \u03C3\u03C5\u03BD\u03BF\u03BB\u03B9\u03BA\u03CC\u03C2 \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC\u03C2 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03CE\u03BD \u03C0\u03BF\u03C5 \u03BA\u03B1\u03B8\u03BF\u03C1\u03AF\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03BC\u03B5 \u03C4\u03B9\u03C2 \u03BC\u03B5\u03B8\u03CC\u03B4\u03BF\u03C5\u03C2 key(), keys() \u03AE filter() \u03B5\u03AF\u03BD\u03B1\u03B9 {0}, \u03C4\u03BF \u03BF\u03C0\u03BF\u03AF\u03BF \u03C5\u03C0\u03B5\u03C1\u03B2\u03B1\u03AF\u03BD\u03B5\u03B9 \u03C4\u03BF \u03BC\u03AD\u03B3\u03B9\u03C3\u03C4\u03BF \u03CC\u03C1\u03B9\u03BF \u03C4\u03C9\u03BD {1}.
2010=\u039F \u03C0\u03B1\u03C1\u03AC\u03B3\u03BF\u03BD\u03C4\u03B1\u03C2 \u03B5\u03C0\u03B1\u03BD\u03AC\u03BB\u03B7\u03C8\u03B7\u03C2 {0} \u03B5\u03C0\u03AD\u03C3\u03C4\u03C1\u03B5\u03C8\u03B5 \u03C4\u03B9\u03BC\u03AE null, \u03BC\u03B5\u03C4\u03AC \u03B1\u03C0\u03CC \u03C4\u03B7\u03BD \u03B5\u03C0\u03B9\u03C3\u03C4\u03C1\u03BF\u03C6\u03AE {1} \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03C9\u03BD.
2011=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C4\u03B9\u03BC\u03AE \u03BF\u03C1\u03AF\u03C3\u03BC\u03B1\u03C4\u03BF\u03C2 "{0}".
2012=\u0394\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03BC\u03AD\u03B3\u03B9\u03C3\u03C4\u03BF \u03BC\u03AE\u03BA\u03BF\u03C2 \u03B3\u03B9\u03B1 \u03C4\u03CD\u03C0\u03BF\u03C5\u03C2 LOB \u03AE \u03C4\u03CD\u03C0\u03BF JSON.
2013=\u039F\u03B9 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03B9\u03C2 SecureFile LOB \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03BD \u03BD\u03B1 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B7\u03B8\u03BF\u03CD\u03BD \u03CC\u03C4\u03B1\u03BD \u03BF \u03C4\u03CD\u03C0\u03BF\u03C2 \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03BF\u03BC\u03AD\u03BD\u03BF\u03C5 \u03B5\u03AF\u03BD\u03B1\u03B9 "{0}"
2014=\u039F \u03B4\u03B5\u03AF\u03BA\u03C4\u03B7\u03C2 \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C5\u03C4\u03B1\u03AF\u03B1\u03C2 \u03C4\u03C1\u03BF\u03C0\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2 \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03BC\u03CC\u03BD\u03BF \u03CC\u03C4\u03B1\u03BD \u03AD\u03C7\u03B5\u03B9 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03C4\u03BF \u03CC\u03BD\u03BF\u03BC\u03B1 \u03C4\u03B7\u03C2 \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C5\u03C4\u03B1\u03AF\u03B1\u03C2 \u03C4\u03C1\u03BF\u03C0\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2.
2015=\u0395\u03AC\u03BD \u03B7 \u03BC\u03AD\u03B8\u03BF\u03B4\u03BF\u03C2 \u03B1\u03BD\u03C4\u03B9\u03C3\u03C4\u03BF\u03AF\u03C7\u03B9\u03C3\u03B7\u03C2 \u03B5\u03AF\u03BD\u03B1\u03B9 "SEQUENCE", \u03C4\u03CC\u03C4\u03B5 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03C4\u03BF \u03CC\u03BD\u03BF\u03BC\u03B1 \u03BC\u03B9\u03B1\u03C2 \u03B1\u03BA\u03BF\u03BB\u03BF\u03C5\u03B8\u03AF\u03B1\u03C2 \u03C3\u03C4\u03B7\u03BB\u03CE\u03BD \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03CE\u03BD.
2016=\u0388\u03C7\u03B5\u03B9 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03BC\u03B9\u03B1 \u03BC\u03AD\u03B8\u03BF\u03B4\u03BF\u03C2 \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7\u03C2, \u03B1\u03BB\u03BB\u03AC \u03B4\u03B5\u03BD \u03BA\u03B1\u03B8\u03BF\u03C1\u03AF\u03C3\u03C4\u03B7\u03BA\u03B5 \u03C4\u03BF \u03CC\u03BD\u03BF\u03BC\u03B1 \u03C4\u03B7\u03C2 \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7\u03C2.
2017=\u039F \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03BC\u03AD\u03BD\u03BF\u03C2 \u03C4\u03CD\u03C0\u03BF\u03C2 \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03CE\u03BD \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B7\u03B8\u03B5\u03AF \u03BC\u03B5 \u03BC\u03AD\u03B3\u03B9\u03C3\u03C4\u03BF \u03BC\u03AE\u03BA\u03BF\u03C2.
2018=\u038C\u03C4\u03B1\u03BD \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B1\u03B9 GUID \u03AE UUID \u03B3\u03B9\u03B1 \u03C4\u03B7\u03BD \u03B1\u03BD\u03C4\u03B9\u03C3\u03C4\u03BF\u03AF\u03C7\u03B9\u03C3\u03B7 \u03C4\u03B9\u03BC\u03CE\u03BD \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03BF\u03CD \u03C4\u03CD\u03C0\u03BF\u03C5 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03B1, \u03C4\u03BF \u03BC\u03AE\u03BA\u03BF\u03C2 \u03C4\u03B7\u03C2 \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03CE\u03BD \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 32 byte \u03AE \u03BC\u03B5\u03B3\u03B1\u03BB\u03CD\u03C4\u03B5\u03C1\u03BF.
2019=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BC\u03B7\u03BD \u03AD\u03C7\u03B5\u03B9 \u03C3\u03C4\u03AE\u03BB\u03B7 \u03C4\u03CD\u03C0\u03BF\u03C5 \u03BC\u03AD\u03C3\u03C9\u03BD, \u03B5\u03AC\u03BD \u03BF \u03C4\u03CD\u03C0\u03BF\u03C2 \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03BF\u03BC\u03AD\u03BD\u03BF\u03C5 \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 BLOB.
2020=\u039F \u03C4\u03CD\u03C0\u03BF\u03C2 \u03BC\u03AD\u03C3\u03C9\u03BD \u03C4\u03BF\u03C5 \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 "application/json". \u0397 \u03BC\u03AD\u03B8\u03BF\u03B4\u03BF\u03C2 getContentAsString() \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03B3\u03B9\u03B1 \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03B1 JSON.
2021=\u03A4\u03BF \u03C3\u03CD\u03BD\u03BF\u03BB\u03BF {0} \u03C0\u03B5\u03C1\u03B9\u03AD\u03C7\u03B5\u03B9 \u03C4\u03B9\u03BC\u03AD\u03C2 null.
2022=\u03A4\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF \u03B3\u03B9\u03B1 \u03C4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03C0\u03C1\u03BF\u03C2 \u03B1\u03BD\u03C4\u03B9\u03BA\u03B1\u03C4\u03AC\u03C3\u03C4\u03B1\u03C3\u03B7 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03BC\u03B5 \u03C4\u03B7 \u03C7\u03C1\u03AE\u03C3\u03B7 \u03C4\u03B7\u03C2 \u03BC\u03B5\u03B8\u03CC\u03B4\u03BF\u03C5 key().
2023=\u03A4\u03BF \u03CC\u03C1\u03B9\u03C3\u03BC\u03B1 {0} \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B7 \u03B1\u03C1\u03BD\u03B7\u03C4\u03B9\u03BA\u03CC\u03C2 \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC\u03C2.
2024=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C0\u03C1\u03BF\u03B4\u03B9\u03B1\u03B3\u03C1\u03B1\u03C6\u03AE \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1\u03C2 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5.
2025=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C0\u03C1\u03BF\u03B4\u03B9\u03B1\u03B3\u03C1\u03B1\u03C6\u03AE \u03BA\u03B1\u03C4\u03AC\u03C1\u03B3\u03B7\u03C3\u03B7\u03C2 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5.
2026=\u03A4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03BC\u03B5\u03C4\u03B1\u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2 \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03B9 \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03BF \u03AE \u03AD\u03C7\u03B5\u03B9 \u03BA\u03B5\u03BD\u03CC \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03BF.
2027=\u03A4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03BC\u03B5\u03C4\u03B1\u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2 \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF JSON.
2028=\u03A4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03BC\u03B5\u03C4\u03B1\u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2 \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF JSON, \u03B4\u03B5\u03BD \u03AE\u03C4\u03B1\u03BD \u03B4\u03C5\u03BD\u03B1\u03C4\u03CC \u03BD\u03B1 \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03B7 \u03BA\u03C9\u03B4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7.
2029=\u03A0\u03C1\u03BF\u03AD\u03BA\u03C5\u03C8\u03B5 IOException \u03BA\u03B1\u03C4\u03AC \u03C4\u03B7\u03BD \u03B5\u03C0\u03B5\u03BE\u03B5\u03C1\u03B3\u03B1\u03C3\u03AF\u03B1 \u03C4\u03BF\u03C5 \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03BC\u03B5\u03C4\u03B1\u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2.
2030=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C4\u03B9\u03BC\u03AE \u03B3\u03B9\u03B1 \u03C4\u03BF "{0}" \u03C3\u03C4\u03B1 \u03BC\u03B5\u03C4\u03B1\u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03B1 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2.
2031=\u03A4\u03B1 \u03BC\u03B5\u03C4\u03B1\u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03B1 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03BD\u03B1 \u03B1\u03BD\u03C4\u03B9\u03BA\u03B5\u03AF\u03BC\u03B5\u03BD\u03BF JSON.
2032=\u03A4\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF \u03B1\u03BD\u03C4\u03B9\u03BA\u03B5\u03B9\u03BC\u03AD\u03BD\u03BF\u03C5 "{0}" \u03B4\u03B5\u03BD \u03B1\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 \u03C3\u03C4\u03B1 \u03BC\u03B5\u03C4\u03B1\u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03B1 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2.
2033=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03B9 \u03B4\u03B9\u03B1\u03BC\u03BF\u03C1\u03C6\u03C9\u03B8\u03B5\u03AF \u03BC\u03B5 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03AC \u03B1\u03BD\u03C4\u03B9\u03C3\u03C4\u03BF\u03B9\u03C7\u03B9\u03C3\u03BC\u03AD\u03BD\u03B1 \u03C3\u03B5 client, \u03B1\u03BB\u03BB\u03AC \u03C4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03B5\u03B9\u03C3\u03CC\u03B4\u03BF\u03C5 \u03AD\u03C7\u03B5\u03B9 \u03AD\u03BD\u03B1 \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF.
2034=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03B9 \u03B4\u03B9\u03B1\u03BC\u03BF\u03C1\u03C6\u03C9\u03B8\u03B5\u03AF \u03BC\u03B5 \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF \u03B1\u03BD\u03C4\u03B9\u03C3\u03C4\u03BF\u03B9\u03C7\u03B9\u03C3\u03BC\u03AD\u03BD\u03BF \u03C3\u03B5 client, \u03B1\u03BB\u03BB\u03AC \u03BF \u03C0\u03B1\u03C1\u03AC\u03B3\u03BF\u03BD\u03C4\u03B1\u03C2 \u03B5\u03C0\u03B1\u03BD\u03AC\u03BB\u03B7\u03C8\u03B7\u03C2 {0} \u03B5\u03C0\u03AD\u03C3\u03C4\u03C1\u03B5\u03C8\u03B5 \u03AD\u03BD\u03B1 \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03BC\u03B5 \u03AD\u03BD\u03B1 \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF, \u03BC\u03B5\u03C4\u03AC \u03B1\u03C0\u03CC \u03C4\u03B7\u03BD \u03B5\u03C0\u03B9\u03C3\u03C4\u03C1\u03BF\u03C6\u03AE {1} \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03C9\u03BD.
2035=\u0397 \u03BC\u03AD\u03B8\u03BF\u03B4\u03BF\u03C2 getCurrentSchema() \u03C0\u03BF\u03C5 \u03BA\u03BB\u03AE\u03B8\u03B7\u03BA\u03B5 \u03C3\u03C4\u03B7\u03BD \u03C0\u03B1\u03C1\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03B7 \u03C3\u03CD\u03BD\u03B4\u03B5\u03C3\u03B7 JDBC \u03B5\u03C0\u03AD\u03C3\u03C4\u03C1\u03B5\u03C8\u03B5 \u03C4\u03B9\u03BC\u03AE null.
2036=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03C2 \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC\u03C2 \u03C0\u03C1\u03CC\u03B2\u03BB\u03B5\u03C8\u03B7\u03C2.
2037=\u0397 \u03C4\u03B9\u03BC\u03AE {0} \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF \u03C4\u03CD\u03C0\u03BF\u03C5 {1}.
2038=\u03A4\u03BF \u03B1\u03AF\u03C4\u03B7\u03BC\u03B1 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5 \u03AD\u03C7\u03B5\u03B9 \u03C0\u03B5\u03C1\u03B9\u03C3\u03C3\u03CC\u03C4\u03B5\u03C1\u03B5\u03C2 \u03B1\u03C0\u03CC {0} \u03C3\u03C4\u03AE\u03BB\u03B5\u03C2.
2039=\u0394\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B4\u03C5\u03BD\u03B1\u03C4\u03AE \u03B7 \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5 \u03C3\u03B5 \u03BA\u03C1\u03C5\u03C0\u03C4\u03BF\u03B3\u03C1\u03B1\u03C6\u03B7\u03BC\u03AD\u03BD\u03BF \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03BF. \u0397 \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5 \u03B5\u03C0\u03B9\u03C4\u03C1\u03AD\u03C0\u03B5\u03C4\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03B5\u03AC\u03BD \u03B7 \u03BA\u03C1\u03C5\u03C0\u03C4\u03BF\u03B3\u03C1\u03AC\u03C6\u03B7\u03C3\u03B7 \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03BF\u03BC\u03AD\u03BD\u03BF\u03C5 \u03AD\u03C7\u03B5\u03B9 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03C9\u03C2 NONE.
2040=\u03A4\u03BF \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF next() \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BA\u03BB\u03B7\u03B8\u03B5\u03AF \u03C3\u03B5 \u03AD\u03BD\u03B1\u03BD \u03BA\u03BB\u03B5\u03B9\u03C3\u03C4\u03CC cursor.
2041=\u03A0\u03B1\u03C1\u03BF\u03C5\u03C3\u03B9\u03AC\u03C3\u03C4\u03B7\u03BA\u03B5 \u03C3\u03C6\u03AC\u03BB\u03BC\u03B1 \u03BA\u03B1\u03C4\u03AC \u03C4\u03B7\u03BD \u03C0\u03C1\u03BF\u03C3\u03C0\u03AC\u03B8\u03B5\u03B9\u03B1 \u03B1\u03C0\u03CC\u03C1\u03C1\u03B9\u03C8\u03B7\u03C2 \u03C4\u03B7\u03C2 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2. \u0392\u03B5\u03B2\u03B1\u03B9\u03C9\u03B8\u03B5\u03AF\u03C4\u03B5 \u03CC\u03C4\u03B9 \u03CC\u03BB\u03B5\u03C2 \u03BF\u03B9 \u03B5\u03B3\u03B3\u03C1\u03B1\u03C6\u03AD\u03C2 \u03C3\u03B5 \u03B5\u03BA\u03BA\u03C1\u03B5\u03BC\u03CC\u03C4\u03B7\u03C4\u03B1 \u03B3\u03B9\u03B1 \u03C4\u03B7 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE \u03AD\u03C7\u03BF\u03C5\u03BD \u03BF\u03C1\u03B9\u03C3\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03B9\u03B7\u03B8\u03B5\u03AF.
2042=\u0391\u03C5\u03C4\u03AE \u03B7 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03B1\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF SODA \u03B3\u03B9\u03B1 \u03C4\u03B7\u03BD \u03AD\u03BD\u03B1\u03C1\u03BE\u03B7 \u03BC\u03B9\u03B1\u03C2 \u03C3\u03C5\u03BD\u03B1\u03BB\u03BB\u03B1\u03B3\u03AE\u03C2, \u03B1\u03BB\u03BB\u03AC \u03C5\u03C0\u03AC\u03C1\u03C7\u03B5\u03B9 \u03BA\u03AC\u03C0\u03BF\u03B9\u03BF \u03C3\u03C6\u03AC\u03BB\u03BC\u03B1 \u03BC\u03B5 \u03C4\u03B7\u03BD \u03B1\u03C0\u03B5\u03BD\u03B5\u03C1\u03B3\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7 \u03C4\u03B7\u03C2 \u03B1\u03C5\u03C4\u03CC\u03BC\u03B1\u03C4\u03B7\u03C2 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2 \u03C4\u03B7\u03C2 \u03C3\u03CD\u03BD\u03B4\u03B5\u03C3\u03B7\u03C2 JDBC.
2043=\u03A4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03C0\u03C1\u03BF\u03B4\u03B9\u03B1\u03B3\u03C1\u03B1\u03C6\u03CE\u03BD {0} \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03B9 \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03BF \u03AE \u03AD\u03C7\u03B5\u03B9 \u03BA\u03B5\u03BD\u03CC \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03BF.
2045=\u039F \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC\u03C2 \u03C0\u03C1\u03BF\u03B2\u03BF\u03BB\u03AE\u03C2 \u03B4\u03B5\u03BD \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C0\u03B5\u03C1\u03B9\u03AD\u03C7\u03B5\u03B9 \u03C3\u03C5\u03BD\u03B4\u03C5\u03B1\u03C3\u03BC\u03CC \u03BA\u03B1\u03BD\u03CC\u03BD\u03C9\u03BD \u03C3\u03C5\u03BC\u03C0\u03B5\u03C1\u03AF\u03BB\u03B7\u03C8\u03B7\u03C2 \u03BA\u03B1\u03B9 \u03B5\u03BE\u03B1\u03AF\u03C1\u03B5\u03C3\u03B7\u03C2.
2046=\u0397 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE \u03B3\u03B9\u03B1 \u03AD\u03BD\u03B1 \u03B5\u03C5\u03C1\u03B5\u03C4\u03AE\u03C1\u03B9\u03BF \u03AE \u03C4\u03B1\u03BE\u03B9\u03BD\u03CC\u03BC\u03B7\u03C3\u03B7 \u03BA\u03B1\u03C4\u03AC \u03C3\u03C5\u03BD\u03B8\u03AE\u03BA\u03B7 \u03B4\u03B5\u03BD \u03B8\u03B1 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C0\u03B5\u03C1\u03B9\u03AD\u03C7\u03B5\u03B9 \u03B2\u03AE\u03BC\u03B1\u03C4\u03B1 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1.
2047=\u0397 \u03C3\u03CD\u03BD\u03B4\u03B5\u03C3\u03B7 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 OracleConnection \u03AE \u03C0\u03B5\u03C1\u03B9\u03C4\u03CD\u03BB\u03B9\u03BE\u03B7 \u03B3\u03B9\u03B1 OracleConnection.
2048=\u0397 \u03B3\u03BB\u03C9\u03C3\u03C3\u03B9\u03BA\u03AE \u03C0\u03B1\u03C1\u03AC\u03BC\u03B5\u03C4\u03C1\u03BF\u03C2 \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03BC\u03B5 \u03B5\u03C5\u03C1\u03B5\u03C4\u03AE\u03C1\u03B9\u03BF \u03BA\u03B5\u03B9\u03BC\u03AD\u03BD\u03BF\u03C5 12.1.0.2 Oracle Database.
2049=\u0397 \u03C0\u03C1\u03BF\u03B5\u03C0\u03B9\u03BB\u03B5\u03B3\u03BC\u03AD\u03BD\u03B7 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03B9\u03BA\u03BF\u03CD \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03AF\u03BF\u03C5 \u03B2\u03B1\u03C3\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03C3\u03C4\u03BF\u03BD \u03CC\u03C1\u03BF "null \u03CC\u03C4\u03B1\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BA\u03B5\u03BD\u03CC" json_value \u03C0\u03BF\u03C5 \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9, \u03BE\u03B5\u03BA\u03B9\u03BD\u03CE\u03BD\u03C4\u03B1\u03C2 \u03B1\u03C0\u03CC \u03C4\u03B7\u03BD \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7 Oracle Database 12.2.0.1. \u03BF\u03B9 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B5\u03C2 "scalarRequired" \u03BA\u03B1\u03B9 "lax" \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03C3\u03C4\u03B7\u03BD \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7 12.1.0.2. \u03A3\u03B7\u03BC\u03B5\u03AF\u03C9\u03C3\u03B7: \u03A4\u03B1 \u03B5\u03C5\u03C1\u03B5\u03C4\u03AE\u03C1\u03B9\u03B1 "lax" \u03B4\u03B5\u03BD \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03BF\u03CD\u03BD\u03C4\u03B1\u03B9 \u03B1\u03C0\u03CC QBEs \u03BA\u03B1\u03B9, \u03B5\u03C0\u03BF\u03BC\u03AD\u03BD\u03C9\u03C2 \u03C0\u03C1\u03BF\u03C4\u03B5\u03AF\u03BD\u03B5\u03C4\u03B1\u03B9 \u03C4\u03BF "scalarRequired".
2050=\u03A4\u03BF "{0}" \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03B3\u03B9\u03B1 \u03B5\u03C5\u03C1\u03B5\u03C4\u03AE\u03C1\u03B9\u03BF \u03BA\u03B5\u03B9\u03BC\u03AD\u03BD\u03BF\u03C5 Oracle Database 12.1.0.2.
2051=\u0397 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 "{0}" \u03B1\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF \u03C4\u03B7 \u03B4\u03B9\u03B1\u03C7\u03B5\u03AF\u03C1\u03B9\u03C3\u03B7 \u03C3\u03C5\u03BD\u03B1\u03BB\u03BB\u03B1\u03B3\u03AE\u03C2 \u03CC\u03C4\u03B1\u03BD \u03B7 \u03C3\u03CD\u03BD\u03B4\u03B5\u03C3\u03B7 \u03B2\u03C1\u03AF\u03C3\u03BA\u03B5\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03B1\u03C5\u03C4\u03CC\u03BC\u03B1\u03C4\u03B7\u03C2 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2, \u03B1\u03BB\u03BB\u03AC \u03B7 \u03AD\u03BD\u03B4\u03B5\u03B9\u03BE\u03B7 "avoidTxnManagement" \u03AD\u03C7\u03B5\u03B9 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03C9\u03C2 true \u03C3\u03C4\u03BF \u03C3\u03C4\u03B9\u03B3\u03BC\u03B9\u03CC\u03C4\u03C5\u03C0\u03BF OracleDatabase. \u0391\u03C0\u03B5\u03BD\u03B5\u03C1\u03B3\u03BF\u03C0\u03BF\u03B9\u03AE\u03C3\u03C4\u03B5 \u03C4\u03B7 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03B1\u03C5\u03C4\u03CC\u03BC\u03B1\u03C4\u03B7\u03C2 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2 \u03B3\u03B9\u03B1 \u03C4\u03B7\u03BD \u03B5\u03BA\u03C4\u03AD\u03BB\u03B5\u03C3\u03B7 \u03C4\u03B7\u03C2 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1\u03C2.
2052=\u03A4\u03BF keyLike() \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03BC\u03CC\u03BD\u03BF \u03B3\u03B9\u03B1 \u03BC\u03B9\u03B1 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE \u03BC\u03B5 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03AC \u03B1\u03BD\u03C4\u03B9\u03C3\u03C4\u03BF\u03B9\u03C7\u03B9\u03C3\u03BC\u03AD\u03BD\u03B1 \u03B1\u03C0\u03CC \u03C0\u03B5\u03BB\u03AC\u03C4\u03B7 \u03BA\u03B1\u03B9 \u03C4\u03CD\u03C0\u03BF \u03C3\u03C4\u03AE\u03BB\u03B7\u03C2 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03BF\u03CD varchar2.
2053=\u03A5\u03C0\u03AC\u03C1\u03C7\u03B5\u03B9 \u03AE\u03B4\u03B7 \u03AD\u03BD\u03B1\u03C2 \u03B4\u03B5\u03AF\u03BA\u03C4\u03B7\u03C2 \u03BC\u03B5 \u03C4\u03BF \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03BC\u03AD\u03BD\u03BF \u03CC\u03BD\u03BF\u03BC\u03B1 \u03C3\u03C4\u03BF \u03C3\u03C7\u03AE\u03BC\u03B1.
2054=\u03B7 \u03C0\u03B1\u03C1\u03AC\u03BB\u03B5\u03B9\u03C8\u03B7 \u03AE \u03BF \u03C0\u03B5\u03C1\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC\u03C2 \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03B3\u03B9\u03B1 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03BA\u03B1\u03C4\u03B1\u03BC\u03AD\u03C4\u03C1\u03B7\u03C3\u03B7\u03C2.
2055=\u03BF \u03BF\u03C1\u03B9\u03C3\u03BC\u03CC\u03C2 \u03C4\u03B7\u03C2 \u03C0\u03B1\u03C1\u03B1\u03BC\u03AD\u03C4\u03C1\u03BF\u03C5 textIndex121WithLang \u03C9\u03C2 true \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03B9\u03C2 \u03B2\u03AC\u03C3\u03B7\u03C2 \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD \u03BC\u03B5\u03C4\u03B1\u03B3\u03B5\u03BD\u03AD\u03C3\u03C4\u03B5\u03C1\u03B5\u03C2 \u03C4\u03B7\u03C2 12.2.
2056=\u039F \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC\u03C2 \u03C0\u03C1\u03BF\u03B2\u03BF\u03BB\u03AE\u03C2 \u03B4\u03B5\u03BD \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C0\u03B5\u03C1\u03B9\u03AD\u03C7\u03B5\u03B9 \u03B2\u03AE\u03BC\u03B1\u03C4\u03B1 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1.
2057=\u03A3\u03B5 \u03AD\u03BD\u03B1\u03BD \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC \u03C0\u03C1\u03BF\u03B2\u03BF\u03BB\u03AE\u03C2, \u03BF\u03B9 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AD\u03C2 \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03BD \u03BD\u03B1 \u03BC\u03BF\u03B9\u03C1\u03AC\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03BA\u03BF\u03B9\u03BD\u03CC \u03C0\u03C1\u03CC\u03B8\u03B5\u03BC\u03B1.
2058=\u0397 \u03BC\u03AD\u03B8\u03BF\u03B4\u03BF\u03C2 {0} \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03C3\u03B5 \u03C3\u03C5\u03BD\u03B4\u03C5\u03B1\u03C3\u03BC\u03CC \u03BC\u03B5 \u03C4\u03B7 \u03BC\u03AD\u03B8\u03BF\u03B4\u03BF {1}.
2059=\u03A0\u03B1\u03C1\u03BF\u03C5\u03C3\u03B9\u03AC\u03C3\u03C4\u03B7\u03BA\u03B5 \u03C3\u03C6\u03AC\u03BB\u03BC\u03B1 \u03BA\u03B1\u03C4\u03AC \u03C4\u03B7\u03BD \u03BC\u03B5\u03C4\u03B1\u03C4\u03C1\u03BF\u03C0\u03AE \u03C4\u03BF\u03C5 \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03B5\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03AE\u03C2 \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03BF\u03BC\u03AD\u03BD\u03BF\u03C5 JSON \u03C3\u03B5 \u03B4\u03C5\u03B1\u03B4\u03B9\u03BA\u03AD\u03C2 \u03C4\u03B9\u03BC\u03AD\u03C2. \u0392\u03B5\u03B2\u03B1\u03B9\u03C9\u03B8\u03B5\u03AF\u03C4\u03B5 \u03CC\u03C4\u03B9 \u03C4\u03BF \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03BF \u03C4\u03BF\u03C5 \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03B5\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03AE\u03C2 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF JSON.
2060=\u03A0\u03B1\u03C1\u03BF\u03C5\u03C3\u03B9\u03AC\u03C3\u03C4\u03B7\u03BA\u03B5 \u03C3\u03C6\u03AC\u03BB\u03BC\u03B1 \u03BA\u03B1\u03C4\u03AC \u03C4\u03B7 \u03BC\u03B5\u03C4\u03B1\u03C4\u03C1\u03BF\u03C0\u03AE \u03C4\u03BF\u03C5 \u03B4\u03C5\u03B1\u03B4\u03B9\u03BA\u03BF\u03CD JSON \u03C3\u03B5 JSON \u03BA\u03B5\u03B9\u03BC\u03AD\u03BD\u03BF\u03C5.
2061=\u0397 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE \u03C0\u03BF\u03C5 \u03BA\u03B1\u03B8\u03BF\u03C1\u03AF\u03C3\u03C4\u03B7\u03BA\u03B5 \u03B3\u03B9\u03B1 \u03C4\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7.
2062=\u0397 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03C3\u03B5 \u03BD\u03B1 \u03B5\u03BE\u03B1\u03C7\u03B8\u03B5\u03AF \u03B1\u03C0\u03CC \u03C4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF.
2063=\u03A4\u03BF \u03BC\u03BF\u03BD\u03BF\u03C0\u03AC\u03C4\u03B9 \u03B4\u03B5\u03BD \u03BC\u03C0\u03CC\u03C1\u03B5\u03C3\u03B5 \u03BD\u03B1 \u03B5\u03B9\u03C3\u03B1\u03C7\u03B8\u03B5\u03AF \u03C3\u03C4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF.
2064=\u0397 \u03B5\u03C0\u03B9\u03BA\u03CD\u03C1\u03C9\u03C3\u03B7 \u03B4\u03B5\u03BD \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03BA\u03B1\u03B8\u03BF\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03CC\u03C4\u03B1\u03BD \u03C4\u03BF contentColumn.sqlType \u03B5\u03AF\u03BD\u03B1\u03B9 JSON.
2065=\u039C\u03B7 \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03B9\u03B6\u03CC\u03BC\u03B5\u03BD\u03BF\u03C2 \u03C4\u03CD\u03C0\u03BF\u03C2: {0}
2066=\u0397 \u03C5\u03C0\u03CC\u03B4\u03B5\u03B9\u03BE\u03B7 {0} \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C4\u03CD\u03C0\u03BF\u03C5 \u03C3\u03C5\u03BC\u03B2\u03BF\u03BB\u03BF\u03C3\u03B5\u03B9\u03C1\u03AC\u03C2 \u03AE \u03C0\u03B5\u03C1\u03B9\u03AD\u03C7\u03B5\u03B9 /* \u03AE */.
2067=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF \u03C7\u03CE\u03C1\u03BF \u03B1\u03C0\u03BF\u03B8\u03AE\u03BA\u03B5\u03C5\u03C3\u03B7\u03C2 OSON \u03C0\u03BF\u03C5 \u03B1\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF \u03C4\u03BF JDBC 19.6 \u03AE \u03C5\u03C8\u03B7\u03BB\u03CC\u03C4\u03B5\u03C1\u03BF\u03C5 jar.
2068=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF \u03C4\u03CD\u03C0\u03BF \u03C7\u03CE\u03C1\u03BF\u03C5 \u03B1\u03C0\u03BF\u03B8\u03AE\u03BA\u03B5\u03C5\u03C3\u03B7\u03C2 JSON \u03C0\u03BF\u03C5 \u03B1\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF \u03C4\u03BF JDBC 19.6 \u03AE \u03C5\u03C8\u03B7\u03BB\u03CC\u03C4\u03B5\u03C1\u03BF\u03C5 jar.
2069=\u0397 \u03B5\u03BA\u03BA\u03B1\u03B8\u03AC\u03C1\u03B9\u03C3\u03B7 \u03BA\u03B1\u03B9 \u03B7 \u03BA\u03B1\u03C4\u03AC\u03C1\u03B3\u03B7\u03C3\u03B7 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2 \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03BC\u03CC\u03BD\u03BF \u03C3\u03C4\u03BF Oracle Database 21c \u03BA\u03B1\u03B9 \u03C4\u03B9\u03C2 \u03BC\u03B5\u03C4\u03B1\u03B3\u03B5\u03BD\u03AD\u03C3\u03C4\u03B5\u03C1\u03B5\u03C2 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03B9\u03C2.
2070=\u03A4\u03BF \u03BC\u03AD\u03B3\u03B5\u03B8\u03BF\u03C2 \u03B4\u03AD\u03C3\u03BC\u03B7\u03C2 {0} \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B9\u03B1 \u03C4\u03B9\u03BC\u03AE \u03C4\u03CD\u03C0\u03BF\u03C5 Integer.
2071=\u0397 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE \u03C0\u03BF\u03C5 \u03BA\u03B1\u03B8\u03BF\u03C1\u03AF\u03C3\u03C4\u03B7\u03BA\u03B5 \u03B3\u03B9\u03B1 \u03C4\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7.
2072=\u0397 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03C3\u03B5 \u03BD\u03B1 \u03B5\u03BE\u03B1\u03C7\u03B8\u03B5\u03AF \u03B1\u03C0\u03CC \u03C4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF.
2073=\u03A4\u03BF \u03BC\u03BF\u03BD\u03BF\u03C0\u03AC\u03C4\u03B9 \u03B4\u03B5\u03BD \u03BC\u03C0\u03CC\u03C1\u03B5\u03C3\u03B5 \u03BD\u03B1 \u03B5\u03B9\u03C3\u03B1\u03C7\u03B8\u03B5\u03AF \u03C3\u03C4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF.
2074=\u0393\u03B9\u03B1 \u03B1\u03C5\u03C4\u03AE\u03BD \u03C4\u03B7 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03B1\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF\u03C4\u03B1\u03B9 \u03C4\u03BF JDBC 19.6 \u03AE \u03C5\u03C8\u03B7\u03BB\u03CC\u03C4\u03B5\u03C1\u03BF\u03C5 jar.
2075=\u0393\u03B9\u03B1 \u03B1\u03C5\u03C4\u03AE\u03BD \u03C4\u03B7 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03B1\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF\u03C4\u03B1\u03B9 \u03C4\u03BF JDBC 21.1 \u03AE \u03C5\u03C8\u03B7\u03BB\u03CC\u03C4\u03B5\u03C1\u03BF\u03C5 jar.
2076=\u0397 \u03C0\u03B1\u03C1\u03AC\u03BC\u03B5\u03C4\u03C1\u03BF\u03C2 format \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C4\u03CD\u03C0\u03BF\u03C5 String \u03AE \u03AD\u03C7\u03B5\u03B9 \u03BF\u03C1\u03B9\u03C3\u03C4\u03B5\u03AF \u03BC\u03B5 \u03BC\u03B9\u03B1 \u03BC\u03B7 \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03B9\u03B6\u03CC\u03BC\u03B5\u03BD\u03B7 \u03C4\u03B9\u03BC\u03AE.
2077=\u0394\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B4\u03C5\u03BD\u03B1\u03C4\u03CC\u03C2 \u03BF \u03BF\u03C1\u03B9\u03C3\u03BC\u03CC\u03C2 eJSON, \u03B1\u03BD \u03B7 \u03C3\u03C4\u03AE\u03BB\u03B7 \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03BF\u03BC\u03AD\u03BD\u03BF\u03C5 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE\u03C2 \u03B4\u03B5\u03BD \u03B1\u03C0\u03BF\u03B8\u03B7\u03BA\u03B5\u03CD\u03B5\u03B9 \u03B4\u03C5\u03B1\u03B4\u03B9\u03BA\u03CC JSON.
2078=\u0394\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B4\u03C5\u03BD\u03B1\u03C4\u03CC\u03C2 \u03BF \u03BF\u03C1\u03B9\u03C3\u03BC\u03CC\u03C2 eJSON, \u03B1\u03BD \u03C4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03AD\u03C7\u03B5\u03B9 \u03B4\u03C5\u03B1\u03B4\u03B9\u03BA\u03CC \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03BF.
2079=\u03A4\u03BF eJSON \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03B3\u03B9\u03B1 \u03B1\u03C5\u03C4\u03AE\u03BD \u03C4\u03B7 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1.
2080=\u03A4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF eJSON \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03BD\u03B1 \u03B1\u03BD\u03C4\u03B9\u03BA\u03B5\u03AF\u03BC\u03B5\u03BD\u03BF JSON.
2081=\u0397 \u03C0\u03B1\u03C1\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03B7 \u03C3\u03C5\u03BC\u03B2\u03BF\u03BB\u03BF\u03C3\u03B5\u03B9\u03C1\u03AC {0} \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03BC\u03B5\u03C4\u03B1\u03C4\u03C1\u03B1\u03C0\u03B5\u03AF \u03C3\u03B5 \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC.
2082=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C4\u03B9\u03BC\u03AE \u03C3\u03C4\u03BF eJSON \u03B3\u03B9\u03B1 \u03C4\u03BF \u03C0\u03B5\u03B4\u03AF\u03BF _id \u03C4\u03BF\u03C5 \u03C4\u03CD\u03C0\u03BF\u03C5 "{0}".
2083=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF "{0}" \u03C3\u03C4\u03BF eJSON \u03BA\u03AC\u03C4\u03C9 \u03B1\u03C0\u03CC \u03C4\u03BF \u03C0\u03B5\u03B4\u03AF\u03BF _id.
2084=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C4\u03B9\u03BC\u03AE _id \u03C3\u03C4\u03BF \u03C0\u03B5\u03B4\u03AF\u03BF eJSON.
2089=\u039F\u03B9 \u03CC\u03C1\u03BF\u03B9 \u03B1\u03BD\u03B1\u03B6\u03AE\u03C4\u03B7\u03C3\u03B7\u03C2 \u03BA\u03B5\u03B9\u03BC\u03AD\u03BD\u03BF\u03C5 \u03BA\u03B1\u03B9 \u03C7\u03C9\u03C1\u03B9\u03BA\u03AE\u03C2 \u03B1\u03BD\u03B1\u03B6\u03AE\u03C4\u03B7\u03C3\u03B7\u03C2 \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03B3\u03B9\u03B1 \u03B1\u03C5\u03C4\u03AE\u03BD \u03C4\u03B7 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1.
2090=\u039F \u03CC\u03C1\u03BF\u03C2 $id \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03B3\u03B9\u03B1 \u03B1\u03C5\u03C4\u03AE\u03BD \u03C4\u03B7 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1.
2091=\u0397 \u03B4\u03B9\u03B1\u03BA\u03C1\u03B9\u03C4\u03AE \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE \u03B4\u03B5\u03BD \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C0\u03B5\u03C1\u03B9\u03AD\u03C7\u03B5\u03B9 \u03B2\u03AE\u03BC\u03B1\u03C4\u03B1 \u03B4\u03B9\u03AC\u03C4\u03B1\u03BE\u03B7\u03C2 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1.
2092=\u0397 \u03C0\u03B1\u03C1\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03B7 \u03B4\u03B9\u03B1\u03B4\u03C1\u03BF\u03BC\u03AE \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BA\u03B5\u03BD\u03AE \u03AE null.
2093=\u039F \u03C0\u03C1\u03BF\u03C3\u03B4\u03B9\u03BF\u03C1\u03B9\u03C3\u03BC\u03CC\u03C2 \u03C6\u03AF\u03BB\u03C4\u03C1\u03BF\u03C5 \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03BD\u03B1 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03B1\u03BD\u03C4\u03B9\u03BA\u03B5\u03AF\u03BC\u03B5\u03BD\u03BF JSON.
2094=\u03A4\u03BF DistinctStrict \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03BC\u03B5 \u03C4\u03BF Oracle Database 23c \u03BA\u03B1\u03B9 \u03C4\u03B9\u03C2 \u03BC\u03B5\u03C4\u03B1\u03B3\u03B5\u03BD\u03AD\u03C3\u03C4\u03B5\u03C1\u03B5\u03C2 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03B9\u03C2.
2095=\u03A4\u03B1 \u03B5\u03C5\u03C1\u03B5\u03C4\u03AE\u03C1\u03B9\u03B1 TTL \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03C3\u03C4\u03BF Oracle Database 19c \u03BA\u03B1\u03B9 \u03C4\u03B9\u03C2 \u03BC\u03B5\u03C4\u03B1\u03B3\u03B5\u03BD\u03AD\u03C3\u03C4\u03B5\u03C1\u03B5\u03C2 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03B9\u03C2.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE {0} \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03AD\u03C7\u03B5\u03B9 \u03B4\u03C5\u03B1\u03B4\u03B9\u03BA\u03CC \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03CC\u03BC\u03B5\u03BD\u03BF \u03C3\u03C4\u03B7 \u03C3\u03C4\u03AE\u03BB\u03B7 \u03C4\u03CD\u03C0\u03BF\u03C5 {1}.
2501=\u0397 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE {0} \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF \u03B4\u03B9\u03B1\u03C7\u03B5\u03AF\u03C1\u03B9\u03C3\u03B7 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03C9\u03BD {1}, \u03B7 \u03C1\u03BF\u03AE \u03B5\u03B3\u03B3\u03C1\u03B1\u03C6\u03CE\u03BD \u03B4\u03B5\u03BD \u03B5\u03C0\u03B9\u03C4\u03C1\u03AD\u03C0\u03B5\u03C4\u03B1\u03B9.
2502=\u0397 \u03B1\u03C0\u03BF\u03B8\u03AE\u03BA\u03B5\u03C5\u03C3\u03B7 \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03C3\u03C4\u03B7 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE {0} \u03B1\u03C0\u03AD\u03C4\u03C5\u03C7\u03B5.
2503=\u0397 \u03B5\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03AE \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03C3\u03C4\u03B7 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE {0} \u03B1\u03C0\u03AD\u03C4\u03C5\u03C7\u03B5.
2504=\u0394\u03B5\u03BD \u03AE\u03C4\u03B1\u03BD \u03B4\u03C5\u03BD\u03B1\u03C4\u03AE \u03B7 \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03BF\u03CD \u03B2\u03AC\u03C3\u03B5\u03B9 UUID.
2505=\u03A4\u03BF \u03AD\u03B3\u03B3\u03C1\u03B1\u03C6\u03BF \u03BC\u03B5 \u03BA\u03BB\u03B5\u03B9\u03B4\u03AF {0} \u03AD\u03C7\u03B5\u03B9 \u03BC\u03AD\u03B3\u03B5\u03B8\u03BF\u03C2 {1}, \u03C4\u03BF \u03BF\u03C0\u03BF\u03AF\u03BF \u03C5\u03C0\u03B5\u03C1\u03B2\u03B1\u03AF\u03BD\u03B5\u03B9 \u03C4\u03BF \u03CC\u03C1\u03B9\u03BF \u03C4\u03C9\u03BD 2GB.
2506=\u0397 \u03B1\u03BD\u03C4\u03B9\u03C3\u03C4\u03BF\u03AF\u03C7\u03B9\u03C3\u03B7 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03BF\u03CD IDENTITY \u03B1\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF \u03C5\u03C0\u03BF\u03C3\u03C4\u03AE\u03C1\u03B9\u03BE\u03B7 RETURNING \u03C3\u03B5 SQL.
2507=\u03A3\u03C6\u03AC\u03BB\u03BC\u03B1 \u03BA\u03B1\u03C4\u03AC \u03C4\u03B7\u03BD \u03B1\u03BD\u03AC\u03BA\u03C4\u03B7\u03C3\u03B7 \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7\u03C2 \u03B2\u03AC\u03C3\u03B7\u03C2 \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=\u0397 \u03C0\u03B5\u03C1\u03B9\u03BA\u03BF\u03C0\u03AE \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9, \u03B7 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AE {0} \u03B4\u03B5\u03BD \u03B2\u03B1\u03C3\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B5\u03C2.
3001=\u03A4\u03BF \u03B5\u03C5\u03C1\u03B5\u03C4\u03AE\u03C1\u03B9\u03BF \u03B1\u03BD\u03B1\u03B6\u03AE\u03C4\u03B7\u03C3\u03B7\u03C2 JSON \u03B4\u03B5\u03BD \u03C5\u03BB\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B1\u03B9 \u03B3\u03B9\u03B1 \u03C3\u03C4\u03AE\u03BB\u03B5\u03C2 \u03C0\u03B5\u03C1\u03B9\u03B5\u03C7\u03BF\u03BC\u03AD\u03BD\u03BF\u03C5 \u03BC\u03B5 \u03C4\u03CD\u03C0\u03BF {0}.
3002=\u03A4\u03BF \u03B5\u03C5\u03C1\u03B5\u03C4\u03AE\u03C1\u03B9\u03BF \u03B1\u03BD\u03B1\u03B6\u03AE\u03C4\u03B7\u03C3\u03B7\u03C2 JSON \u03B4\u03B5\u03BD \u03C5\u03BB\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B1\u03B9 \u03B3\u03B9\u03B1 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AD\u03C2 \u03BC\u03B5 \u03BA\u03BB\u03B5\u03B9\u03B4\u03B9\u03AC NVARCHAR2.
3003=\u03A4\u03BF Java Virtual Machine (JVM) \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03B9 \u03C4\u03BF\u03BD \u03B1\u03BB\u03B3\u03CC\u03C1\u03B9\u03B8\u03BC\u03BF \u03B4\u03B9\u03B1\u03C7\u03B5\u03AF\u03C1\u03B9\u03C3\u03B7\u03C2 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03C9\u03BD MD5. \u0391\u03BB\u03BB\u03B1\u03B3\u03AE \u03C3\u03B5 \u03AC\u03BB\u03BB\u03BF \u03B1\u03BB\u03B3\u03CC\u03C1\u03B9\u03B8\u03BC\u03BF \u03B4\u03B9\u03B1\u03C7\u03B5\u03AF\u03C1\u03B9\u03C3\u03B7\u03C2 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03C9\u03BD.
3004=\u03A4\u03BF Java Virtual Machine (JVM) \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03B9 \u03C4\u03BF\u03BD \u03B1\u03BB\u03B3\u03CC\u03C1\u03B9\u03B8\u03BC\u03BF \u03B4\u03B9\u03B1\u03C7\u03B5\u03AF\u03C1\u03B9\u03C3\u03B7\u03C2 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03C9\u03BD SHA256. \u0391\u03BB\u03BB\u03B1\u03B3\u03AE \u03C3\u03B5 \u03AC\u03BB\u03BB\u03BF \u03B1\u03BB\u03B3\u03CC\u03C1\u03B9\u03B8\u03BC\u03BF \u03B4\u03B9\u03B1\u03C7\u03B5\u03AF\u03C1\u03B9\u03C3\u03B7\u03C2 \u03B5\u03BA\u03B4\u03CC\u03C3\u03B5\u03C9\u03BD.
3005=\u0397 \u03B4\u03C5\u03BD\u03B1\u03C4\u03CC\u03C4\u03B7\u03C4\u03B1 \u03B4\u03B5\u03BD \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B1\u03B9.
3006=\u0397 \u03C7\u03C9\u03C1\u03B9\u03BA\u03AE \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03B9\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7 JSON \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03B5\u03C4\u03B5\u03C1\u03BF\u03B3\u03B5\u03BD\u03B5\u03AF\u03C2 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AD\u03C2.
3007=\u0397 \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03B9\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7 \u03B1\u03BD\u03B1\u03B6\u03AE\u03C4\u03B7\u03C3\u03B7\u03C2 JSON \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03B5\u03C4\u03B5\u03C1\u03BF\u03B3\u03B5\u03BD\u03B5\u03AF\u03C2 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AD\u03C2.
3008=\u0397 \u03BB\u03B5\u03B9\u03C4\u03BF\u03C5\u03C1\u03B3\u03B9\u03BA\u03AE \u03B5\u03C5\u03C1\u03B5\u03C4\u03B7\u03C1\u03B9\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7 JSON \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03B5\u03C4\u03B5\u03C1\u03BF\u03B3\u03B5\u03BD\u03B5\u03AF\u03C2 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AD\u03C2.
3009=\u03A4\u03BF \u03B5\u03C1\u03CE\u03C4\u03B7\u03BC\u03B1 \u03B2\u03AC\u03C3\u03B5\u03B9 \u03C0\u03B1\u03C1\u03B1\u03B4\u03B5\u03AF\u03B3\u03BC\u03B1\u03C4\u03BF\u03C2 (QBE) \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03B5\u03C4\u03B5\u03C1\u03BF\u03B3\u03B5\u03BD\u03B5\u03AF\u03C2 \u03C3\u03C5\u03BB\u03BB\u03BF\u03B3\u03AD\u03C2.
