#
# Copyright (c) 2014, 2019, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=P\u0159i anal\u00FDze z\u00E1kladn\u00ED \u010D\u00E1sti multipart/form-data nebyl nalezen \u0159et\u011Bzec ohrani\u010Den\u00ED.
1002=P\u0159i anal\u00FDze z\u00E1kladn\u00ED \u010D\u00E1sti multipart/form-data nebyl pro ohrani\u010Den\u00ED nalezen odd\u011Blova\u010D \u0159\u00E1dk\u016F.
1003=P\u0159i anal\u00FDze argument\u016F formul\u00E1\u0159e selhala konverze znakov\u00E9 sady.
1004=Pro \u0159et\u011Bzec dotazu selhala konverze znakov\u00E9 sady.
1005=P\u0159i anal\u00FDze z\u00E1kladn\u00ED \u010D\u00E1sti multipart/form-data nebyl pro z\u00E1hlav\u00ED nalezen ukon\u010Dovac\u00ED znak.
1006=P\u0159i anal\u00FDze z\u00E1kladn\u00ED \u010D\u00E1sti multipart/form-data byl o\u010Dek\u00E1v\u00E1n n\u00E1zev pole, ale nebyl nalezen.
1007=Neplatn\u00FD n\u00E1zev pole v z\u00E1kladn\u00ED \u010D\u00E1sti multipart/form-data.
1008=V n\u00E1zvu pole nebo souboru v z\u00E1kladn\u00ED \u010D\u00E1sti multipart/form-data chyb\u00ED uzav\u00EDrac\u00ED uvozovka.
1009=V z\u00E1kladn\u00ED \u010D\u00E1sti multipart/form-data nebyl nalezen odd\u011Blova\u010D \u0159\u00E1dk\u016F ozna\u010Duj\u00EDc\u00ED za\u010D\u00E1tek hodnoty pole.
1010=V z\u00E1kladn\u00ED \u010D\u00E1sti multipart/form-data nebyl nalezen \u0159et\u011Bzec ohrani\u010Den\u00ED ozna\u010Duj\u00EDc\u00ED konec hodnoty pole.
1011=Neplatn\u00FD \u0159et\u011Bzec data/\u010Dasu {0} (form\u00E1t je rrrr-MM-dd''\u010C''HH:mm:ss.SSS).
1012=Syntaktick\u00E1 chyba dotazu.
1013=K\u00F3dov\u00E1n\u00ED znak\u016F {0} nebylo rozezn\u00E1no.
1014=K\u00F3dovanou bajtovou sekvenci nebylo mo\u017En\u00E9 dek\u00F3dovat jako {0}.
1015=ODESL\u00C1N\u00CD typu m\u00E9dia {0} nen\u00ED povoleno.
1016=Neplatn\u00E1 konfigurace servletu: {0}.
1017=Nezn\u00E1m\u00FD \u00FA\u010Det {0}, aktu\u00E1ln\u00ED sch\u00E9ma je {1}.
1018=Hodnota Null \u010Di pr\u00E1zdn\u00FD \u0159et\u011Bzec nejsou platn\u00FDmi hodnotami data/\u010Dasu.
1019=Dokument obsahuje v\u00EDce instanc\u00ED kl\u00ED\u010De.
1020=Pro extrakci nebo vlo\u017Een\u00ED kl\u00ED\u010De neexistuje \u017E\u00E1dn\u00FD vstupn\u00ED dokument.
1021=Cesta ke kl\u00ED\u010Di extrakce nebo vlo\u017Een\u00ED nesm\u00ED b\u00FDt pr\u00E1zdn\u00E1.
1022=Instance dokumentu nen\u00ED spr\u00E1vn\u011B uzav\u0159ena.
1023=Instance dokumentu je pr\u00E1zdn\u00E1, nebo se nejedn\u00E1 o objekt JSON.
1024=Extrahovan\u00FD kl\u00ED\u010D nen\u00ED \u0159et\u011Bzec nebo \u010D\u00EDslo.
1025=Vlo\u017Een\u00FD kl\u00ED\u010D se neshoduje s existuj\u00EDc\u00EDm kl\u00ED\u010Dem.
1026=Bylo nalezeno duplicitn\u00ED pole pro krok kl\u00ED\u010De {0}.
1027=P\u0159evod form\u00E1tu nen\u00ED implementov\u00E1n nebo je nedostupn\u00FD.
1028=Roz\u0161\u00ED\u0159en\u00FD typ dat JSON {0} nen\u00ED podporov\u00E1n.
1029=Vstupn\u00ED dokument pro p\u0159evod je po\u0161kozen\u00FD nebo ne\u010Diteln\u00FD.
1030=Kl\u00ED\u010D nelze extrahovat pomoc\u00ED \u010Dekaj\u00EDc\u00ED n\u00E1hrady kl\u00ED\u010De.
1031=Nen\u00ED zad\u00E1na cesta ke kl\u00ED\u010Di pro p\u0159evod.
1032=Operace {0} nen\u00ED na {1} povolena.
1033=P\u0159i operaci dokumentu do\u0161lo k chyb\u011B: {0}.
1034=Typ dokumentu {0} nen\u00ED podporov\u00E1n.
