#
# Copyright (c) 2014, 2022, Oracle and/or its affiliates. 
#

# Messages used in query-by-example exceptions

#
# Syntax errors (5000 to 5499 error code range)
#
5000=\u0E40\u0E01\u0E34\u0E14\u0E02\u0E49\u0E2D\u0E1C\u0E34\u0E14\u0E1E\u0E25\u0E32\u0E14\u0E01\u0E31\u0E1A\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E04\u0E33\u0E2A\u0E31\u0E48\u0E07\u0E02\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E2A\u0E37\u0E1A\u0E04\u0E49\u0E19
5001=\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E43\u0E19\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E04\u0E48\u0E32\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C
5002=\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E41\u0E1A\u0E1A\u0E25\u0E2D\u0E08\u0E34\u0E04\u0E31\u0E25 {0}
5003=\u0E04\u0E48\u0E32\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C $id \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E2B\u0E23\u0E37\u0E2D\u0E15\u0E31\u0E27\u0E40\u0E25\u0E02\u0E41\u0E1A\u0E1A\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C \u0E2B\u0E23\u0E37\u0E2D\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E02\u0E2D\u0E07\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E2B\u0E23\u0E37\u0E2D\u0E15\u0E31\u0E27\u0E40\u0E25\u0E02\u0E41\u0E1A\u0E1A\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C
5004=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0} \u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23
5005=\u0E08\u0E33\u0E19\u0E27\u0E19\u0E2A\u0E21\u0E32\u0E0A\u0E34\u0E01 {0} \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {1}
5006=\u0E04\u0E48\u0E32\u0E02\u0E2D\u0E07\u0E04\u0E38\u0E13\u0E2A\u0E21\u0E1A\u0E31\u0E15\u0E34\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 {0}: \u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23 {1}, \u0E1E\u0E1A {2}
5007=\u0E44\u0E21\u0E48\u0E21\u0E35\u0E04\u0E38\u0E13\u0E2A\u0E21\u0E1A\u0E31\u0E15\u0E34 {0}
5008=\u0E1E\u0E32\u0E18\u0E02\u0E2D\u0E07\u0E1F\u0E34\u0E25\u0E14\u0E4C\u0E14\u0E31\u0E0A\u0E19\u0E35 {0} \u0E44\u0E21\u0E48\u0E2D\u0E22\u0E39\u0E48\u0E43\u0E19\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E1E\u0E32\u0E18\u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
5009=\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E44\u0E21\u0E48\u0E2A\u0E21\u0E1A\u0E39\u0E23\u0E13\u0E4C \u0E2B\u0E23\u0E37\u0E2D\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E44\u0E21\u0E48\u0E2A\u0E33\u0E40\u0E23\u0E47\u0E08
5010=\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E01\u0E32\u0E23\u0E1B\u0E23\u0E30\u0E21\u0E32\u0E13\u0E01\u0E32\u0E23\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E44\u0E21\u0E48\u0E2A\u0E21\u0E1A\u0E39\u0E23\u0E13\u0E4C \u0E2B\u0E23\u0E37\u0E2D\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E44\u0E21\u0E48\u0E2A\u0E33\u0E40\u0E23\u0E47\u0E08
5011=\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E44\u0E21\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01\u0E2B\u0E23\u0E37\u0E2D\u0E44\u0E21\u0E48\u0E22\u0E2D\u0E21\u0E23\u0E31\u0E1A\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25 {0}
5012=\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E44\u0E21\u0E48\u0E22\u0E2D\u0E21\u0E23\u0E31\u0E1A\u0E04\u0E27\u0E32\u0E21\u0E22\u0E32\u0E27 {0}
5013=\u0E44\u0E21\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01\u0E20\u0E32\u0E29\u0E32 {0}
5014=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2A\u0E15\u0E23\u0E34\u0E07
5015=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19 {1}
5016=\u0E04\u0E2D\u0E19\u0E40\u0E17\u0E19\u0E40\u0E19\u0E2D\u0E23\u0E4C {1} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0}
5017=\u0E2D\u0E07\u0E04\u0E4C\u0E1B\u0E23\u0E30\u0E01\u0E2D\u0E1A\u0E02\u0E2D\u0E07\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C
5018=\u0E0A\u0E37\u0E48\u0E2D\u0E1F\u0E34\u0E25\u0E14\u0E4C {0} \u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E17\u0E35\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01
5019=\u0E21\u0E35\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E2D\u0E22\u0E39\u0E48\u0E2B\u0E25\u0E31\u0E07\u0E08\u0E38\u0E14\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E02\u0E2D\u0E07\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23 JSON
5020=\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E21\u0E35\u0E04\u0E35\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 {0}
5021=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0} \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E40\u0E1B\u0E49\u0E32\u0E2B\u0E21\u0E32\u0E22\u0E2D\u0E22\u0E48\u0E32\u0E07\u0E19\u0E49\u0E2D\u0E22\u0E2B\u0E19\u0E36\u0E48\u0E07\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23
5022=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E1E\u0E32\u0E18\u0E17\u0E35\u0E48\u0E21\u0E35\u0E02\u0E31\u0E49\u0E19\u0E15\u0E2D\u0E19\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C
5023=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E1E\u0E32\u0E18\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 ({0})
5024=\u0E1E\u0E32\u0E18\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E27\u0E48\u0E32\u0E07\u0E40\u0E1B\u0E25\u0E48\u0E32 \u0E2B\u0E23\u0E37\u0E2D\u0E40\u0E1B\u0E47\u0E19\u0E19\u0E31\u0E25
5025=\u0E44\u0E21\u0E48\u0E2D\u0E19\u0E38\u0E0D\u0E32\u0E15\u0E43\u0E2B\u0E49\u0E21\u0E35\u0E02\u0E31\u0E49\u0E19\u0E15\u0E2D\u0E19\u0E17\u0E35\u0E48\u0E27\u0E48\u0E32\u0E07\u0E40\u0E1B\u0E25\u0E48\u0E32\u0E43\u0E19\u0E1E\u0E32\u0E18 ({0}) \u0E17\u0E35\u0E48\u0E15\u0E33\u0E41\u0E2B\u0E19\u0E48\u0E07 {1}
5026=\u0E1E\u0E32\u0E18 ({0}) \u0E21\u0E35\u0E0B\u0E31\u0E1A\u0E2A\u0E04\u0E23\u0E34\u0E1B\u0E15\u0E4C\u0E02\u0E2D\u0E07\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 {1}
5027=\u0E21\u0E35\u0E02\u0E31\u0E49\u0E19\u0E15\u0E2D\u0E19\u0E43\u0E19\u0E40\u0E04\u0E23\u0E37\u0E48\u0E2D\u0E07\u0E2B\u0E21\u0E32\u0E22\u0E04\u0E33\u0E1E\u0E39\u0E14\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E19\u0E1E\u0E32\u0E18 ({0}) \u0E17\u0E35\u0E48\u0E15\u0E33\u0E41\u0E2B\u0E19\u0E48\u0E07 {1}
5028=\u0E21\u0E35 {0} \u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E1B\u0E34\u0E14\u0E17\u0E35\u0E48\u0E08\u0E38\u0E14\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E02\u0E2D\u0E07\u0E1E\u0E32\u0E18 ({1})
5029=\u0E44\u0E21\u0E48\u0E21\u0E35\u0E15\u0E31\u0E27\u0E04\u0E31\u0E48\u0E19\u0E17\u0E35\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E08\u0E38\u0E14\u0E43\u0E19\u0E1E\u0E32\u0E18 ({0}) \u0E17\u0E35\u0E48\u0E15\u0E33\u0E41\u0E2B\u0E19\u0E48\u0E07 {1}
5030=\u0E44\u0E21\u0E48\u0E21\u0E35\u0E0A\u0E37\u0E48\u0E2D\u0E1F\u0E34\u0E25\u0E14\u0E4C\u0E43\u0E19\u0E1E\u0E32\u0E18 ({0}) \u0E17\u0E35\u0E48\u0E15\u0E33\u0E41\u0E2B\u0E19\u0E48\u0E07 {1}
5031=\u0E40\u0E01\u0E34\u0E14\u0E02\u0E49\u0E2D\u0E1C\u0E34\u0E14\u0E1E\u0E25\u0E32\u0E14\u0E01\u0E31\u0E1A\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E04\u0E33\u0E2A\u0E31\u0E48\u0E07\u0E02\u0E2D\u0E07\u0E1E\u0E32\u0E18\u0E17\u0E35\u0E48\u0E15\u0E33\u0E41\u0E2B\u0E19\u0E48\u0E07 {1} \u0E43\u0E19\u0E1E\u0E32\u0E18 ({0})
5032=\u0E43\u0E0A\u0E49\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0} \u0E2B\u0E25\u0E32\u0E22\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49
5033=\u0E04\u0E48\u0E32\u0E02\u0E2D\u0E07\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C JSON
5034=\u0E2B\u0E32\u0E01\u0E43\u0E0A\u0E49 $query \u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E01\u0E32\u0E23\u0E2A\u0E37\u0E1A\u0E04\u0E49\u0E19\u0E2D\u0E37\u0E48\u0E19\u0E08\u0E30\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E1B\u0E23\u0E32\u0E01\u0E0F\u0E02\u0E36\u0E49\u0E19\u0E17\u0E35\u0E48\u0E23\u0E30\u0E14\u0E31\u0E1A\u0E1A\u0E19\u0E2A\u0E38\u0E14\u0E02\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E1F\u0E34\u0E25\u0E40\u0E15\u0E2D\u0E23\u0E4C
5035=\u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E1E\u0E32\u0E18\u0E15\u0E32\u0E21\u0E25\u0E33\u0E14\u0E31\u0E1A ({0}) \u0E04\u0E37\u0E2D ({1}) \u0E0B\u0E36\u0E48\u0E07\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E41\u0E1B\u0E25\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E08\u0E33\u0E19\u0E27\u0E19\u0E40\u0E15\u0E47\u0E21\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E28\u0E39\u0E19\u0E22\u0E4C \u0E42\u0E1B\u0E23\u0E14\u0E15\u0E23\u0E27\u0E08\u0E2A\u0E2D\u0E1A\u0E27\u0E48\u0E32\u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E04\u0E37\u0E2D\u0E08\u0E33\u0E19\u0E27\u0E19\u0E40\u0E15\u0E47\u0E21\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E28\u0E39\u0E19\u0E22\u0E4C\u0E2B\u0E23\u0E37\u0E2D\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E17\u0E35\u0E48\u0E41\u0E2A\u0E14\u0E07\u0E08\u0E33\u0E19\u0E27\u0E19\u0E40\u0E15\u0E47\u0E21\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E28\u0E39\u0E19\u0E22\u0E4C
5036=\u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E1E\u0E32\u0E18\u0E15\u0E32\u0E21\u0E25\u0E33\u0E14\u0E31\u0E1A ({0}) \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E08\u0E33\u0E19\u0E27\u0E19\u0E40\u0E15\u0E47\u0E21\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E28\u0E39\u0E19\u0E22\u0E4C\u0E2B\u0E23\u0E37\u0E2D\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E17\u0E35\u0E48\u0E41\u0E2A\u0E14\u0E07\u0E08\u0E33\u0E19\u0E27\u0E19\u0E40\u0E15\u0E47\u0E21\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E28\u0E39\u0E19\u0E22\u0E4C
5037=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C $not \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E41\u0E23\u0E1B\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0} 
5038=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E04\u0E35\u0E22\u0E4C ({0}) \u0E17\u0E35\u0E48\u0E15\u0E33\u0E41\u0E2B\u0E19\u0E48\u0E07\u0E19\u0E35\u0E49 \u0E04\u0E35\u0E22\u0E4C\u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E01\u0E32\u0E23\u0E40\u0E1B\u0E23\u0E35\u0E22\u0E1A\u0E40\u0E17\u0E35\u0E22\u0E1A, $exists \u0E2B\u0E23\u0E37\u0E2D $not
5039=\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E0A\u0E49 $id \u0E17\u0E35\u0E48\u0E23\u0E30\u0E14\u0E31\u0E1A\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19 \u0E42\u0E14\u0E22\u0E15\u0E19\u0E40\u0E2D\u0E07\u0E2B\u0E23\u0E37\u0E2D\u0E43\u0E19 $and
5040=\u0E04\u0E48\u0E32 "datatype" \u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A "path" ({0}) \u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48 "string" \u0E41\u0E15\u0E48\u0E21\u0E35\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38 "maxLength" \u0E04\u0E38\u0E13\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E23\u0E30\u0E1A\u0E38 "maxLength" \u0E44\u0E14\u0E49\u0E15\u0E48\u0E2D\u0E40\u0E21\u0E37\u0E48\u0E2D\u0E04\u0E48\u0E32 "datatype" \u0E04\u0E37\u0E2D "string"
5041=\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E02\u0E2D\u0E07 "fields" \u0E43\u0E19\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E27\u0E48\u0E32\u0E07\u0E40\u0E1B\u0E25\u0E48\u0E32
5042=\u0E43\u0E19\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E14\u0E31\u0E0A\u0E19\u0E35 \u0E23\u0E30\u0E1A\u0E38 "{0}" \u0E42\u0E14\u0E22\u0E44\u0E21\u0E48\u0E21\u0E35\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38 "fields" \u0E44\u0E21\u0E48\u0E44\u0E14\u0E49
5043=\u0E04\u0E27\u0E23\u0E23\u0E30\u0E1A\u0E38 "language" \u0E40\u0E09\u0E1E\u0E32\u0E30\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E02\u0E49\u0E2D\u0E04\u0E27\u0E32\u0E21 JSON (\u0E08\u0E32\u0E01\u0E19\u0E31\u0E49\u0E19\u0E15\u0E49\u0E2D\u0E07\u0E40\u0E27\u0E49\u0E19 "fields")
5044=\u0E04\u0E48\u0E32 "order" \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19 "{0}" \u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E04\u0E37\u0E2D "asc", "desc", "1", "-1", 1 \u0E2B\u0E23\u0E37\u0E2D -1
5045=\u0E2D\u0E32\u0E23\u0E4C\u0E01\u0E34\u0E27\u0E40\u0E21\u0E19\u0E15\u0E4C\u0E02\u0E2D\u0E07 {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E02\u0E2D\u0E07\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C\u0E2A\u0E2D\u0E07\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23 \u0E42\u0E14\u0E22\u0E2B\u0E19\u0E36\u0E48\u0E07\u0E43\u0E19\u0E19\u0E31\u0E49\u0E19\u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E19\u0E31\u0E25
5046=\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E41\u0E1E\u0E17\u0E0A\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E44\u0E21\u0E48\u0E2A\u0E21\u0E1A\u0E39\u0E23\u0E13\u0E4C \u0E2B\u0E23\u0E37\u0E2D\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E44\u0E21\u0E48\u0E2A\u0E33\u0E40\u0E23\u0E47\u0E08
5047=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E15\u0E31\u0E27\u0E40\u0E25\u0E02
5048=\u0E1F\u0E34\u0E25\u0E14\u0E4C {0} \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {1}
5049=\u0E44\u0E21\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01\u0E1F\u0E34\u0E25\u0E14\u0E4C {0} \u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {1}
5050=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0} \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E1F\u0E34\u0E25\u0E14\u0E4C {1}
5051=\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E0A\u0E49\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E1E\u0E37\u0E49\u0E19\u0E17\u0E35\u0E48\u0E17\u0E35\u0E48\u0E23\u0E30\u0E14\u0E31\u0E1A\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19
5052=\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E0A\u0E49 $contains \u0E17\u0E35\u0E48\u0E23\u0E30\u0E14\u0E31\u0E1A\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19
5053=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E41\u0E23\u0E1B\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {1}
5054=\u0E1F\u0E34\u0E25\u0E14\u0E4C $orderby \u0E15\u0E49\u0E2D\u0E07\u0E23\u0E30\u0E1A\u0E38\u0E1E\u0E32\u0E18
5055=\u0E1F\u0E34\u0E25\u0E14\u0E4C $orderby \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E21\u0E35\u0E04\u0E38\u0E13\u0E2A\u0E21\u0E1A\u0E31\u0E15\u0E34 "{0}"
5056=\u0E04\u0E38\u0E13\u0E2A\u0E21\u0E1A\u0E31\u0E15\u0E34 $orderby "{0}" \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E21\u0E35\u0E04\u0E48\u0E32 "{1}"
5057="{0}" \u0E04\u0E38\u0E13\u0E2A\u0E21\u0E1A\u0E31\u0E15\u0E34 "{1}" \u0E15\u0E49\u0E2D\u0E07\u0E2D\u0E22\u0E39\u0E48\u0E43\u0E19\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17 "{2}"
5058=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32\u0E41\u0E1F\u0E25\u0E01 "scalarRequired" \u0E41\u0E25\u0E30 "lax" \u0E40\u0E1B\u0E47\u0E19 \u0E08\u0E23\u0E34\u0E07 \u0E44\u0E14\u0E49
5059=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32 "{0}" \u0E23\u0E48\u0E27\u0E21\u0E01\u0E31\u0E1A "{1}" \u0E44\u0E14\u0E49
5060="dataguide" \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E21\u0E35\u0E04\u0E48\u0E32\u0E40\u0E1B\u0E47\u0E19 "{0}" \u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E04\u0E37\u0E2D "on" \u0E2B\u0E23\u0E37\u0E2D "off"
5061="search_on" \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E21\u0E35\u0E04\u0E48\u0E32\u0E40\u0E1B\u0E47\u0E19 "{0}" \u0E04\u0E48\u0E32\u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E04\u0E37\u0E2D "none", "text" \u0E41\u0E25\u0E30 "text_value"
5062=\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E43\u0E19\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E04\u0E48\u0E32\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E21\u0E35\u0E04\u0E48\u0E32\u0E40\u0E1B\u0E47\u0E19\u0E1A\u0E39\u0E25\u0E35\u0E19\u0E2B\u0E23\u0E37\u0E2D\u0E40\u0E1B\u0E47\u0E19\u0E19\u0E31\u0E25
5063=\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E0A\u0E49 {0} \u0E17\u0E35\u0E48\u0E23\u0E30\u0E14\u0E31\u0E1A\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19 \u0E42\u0E14\u0E22\u0E15\u0E19\u0E40\u0E2D\u0E07\u0E2B\u0E23\u0E37\u0E2D\u0E43\u0E19 $and
5064=\u0E43\u0E0A\u0E49\u0E2A\u0E48\u0E27\u0E19\u0E02\u0E2D\u0E07\u0E04\u0E33\u0E2A\u0E31\u0E48\u0E07 $id \u0E44\u0E14\u0E49\u0E44\u0E21\u0E48\u0E40\u0E01\u0E34\u0E19\u0E2B\u0E19\u0E36\u0E48\u0E07\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23
5065=\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02\u0E02\u0E2D\u0E07\u0E1F\u0E34\u0E25\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E15\u0E49\u0E2D\u0E07\u0E1B\u0E23\u0E32\u0E01\u0E0F\u0E2D\u0E22\u0E39\u0E48\u0E43\u0E19\u0E2A\u0E48\u0E27\u0E19\u0E02\u0E2D\u0E07\u0E04\u0E33\u0E2A\u0E31\u0E48\u0E07 $query \u0E40\u0E21\u0E37\u0E48\u0E2D\u0E21\u0E35\u0E01\u0E32\u0E23\u0E43\u0E0A\u0E49\u0E2A\u0E48\u0E27\u0E19\u0E02\u0E2D\u0E07\u0E04\u0E33\u0E2A\u0E31\u0E48\u0E07 $project, $patch, $merge \u0E2B\u0E23\u0E37\u0E2D $orderby
5066=\u0E43\u0E19\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E14\u0E31\u0E0A\u0E19\u0E35 \u0E08\u0E30\u0E23\u0E30\u0E1A\u0E38 "{0}" \u0E42\u0E14\u0E22\u0E44\u0E21\u0E48\u0E21\u0E35\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38 "fields" \u0E2B\u0E23\u0E37\u0E2D "spatial" \u0E44\u0E21\u0E48\u0E44\u0E14\u0E49
5067=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C "{0}" \u0E43\u0E19 $sqlJson
5068=\u0E1F\u0E34\u0E25\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E04\u0E48\u0E32\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02\u0E17\u0E35\u0E48\u0E21\u0E35\u0E04\u0E27\u0E32\u0E21\u0E22\u0E32\u0E27 {0} \u0E40\u0E01\u0E34\u0E19\u0E04\u0E27\u0E32\u0E21\u0E22\u0E32\u0E27\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14 {1}
5069=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {0}
5070=\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E27\u0E48\u0E32\u0E07\u0E40\u0E1B\u0E25\u0E48\u0E32
5071=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C
5072=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E40\u0E2D\u0E47\u0E01\u0E0B\u0E4C\u0E40\u0E1E\u0E23\u0E2A\u0E0A\u0E31\u0E19\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C
5073=\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E01\u0E32\u0E23\u0E2D\u0E31\u0E1B\u0E40\u0E14\u0E15\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E2B\u0E23\u0E37\u0E2D\u0E44\u0E21\u0E48\u0E2A\u0E21\u0E1A\u0E39\u0E23\u0E13\u0E4C
5074=\u0E04\u0E48\u0E32\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E1E\u0E32\u0E18
5075=\u0E01\u0E32\u0E23\u0E04\u0E33\u0E19\u0E27\u0E13 {0} \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C 2 \u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C
5076=\u0E1E\u0E32\u0E18 ({0}) \u0E02\u0E36\u0E49\u0E19\u0E15\u0E49\u0E19\u0E14\u0E49\u0E27\u0E22 ''$'' \u0E41\u0E25\u0E30\u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E17\u0E35\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01
5077=\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C
5078=\u0E1A\u0E25\u0E47\u0E2D\u0E04\u0E01\u0E32\u0E23\u0E41\u0E1B\u0E25\u0E07\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E43\u0E14\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E2B\u0E19\u0E36\u0E48\u0E07\u0E08\u0E32\u0E01: $keep, $remove \u0E2B\u0E23\u0E37\u0E2D $modify
5079=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E08\u0E31\u0E1A\u0E04\u0E39\u0E48\u0E0A\u0E37\u0E48\u0E2D\u0E1F\u0E34\u0E25\u0E14\u0E4C {0} \u0E43\u0E19\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {1}
5080=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E0A\u0E37\u0E48\u0E2D\u0E1F\u0E34\u0E25\u0E14\u0E4C {0} \u0E43\u0E19\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {1}
5081=\u0E0A\u0E37\u0E48\u0E2D\u0E1F\u0E34\u0E25\u0E14\u0E4C {0} \u0E0B\u0E49\u0E33\u0E01\u0E31\u0E19\u0E43\u0E19\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {1}
5082-The \u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C
5083-The \u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E41\u0E23\u0E19\u0E14\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A {0} \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E17\u0E35\u0E48\u0E01\u0E33\u0E2B\u0E19\u0E14
5084=\u0E01\u0E32\u0E23\u0E2A\u0E23\u0E38\u0E1B\u0E23\u0E27\u0E21\u0E15\u0E49\u0E2D\u0E07\u0E23\u0E30\u0E1A\u0E38\u0E01\u0E32\u0E23\u0E14\u0E33\u0E40\u0E19\u0E34\u0E19\u0E01\u0E32\u0E23\u0E43\u0E19\u0E1F\u0E34\u0E25\u0E14\u0E4C
5085=\u0E01\u0E32\u0E23\u0E41\u0E1B\u0E25\u0E07 {0} \u0E40\u0E1B\u0E47\u0E19\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C {1} \u0E25\u0E49\u0E21\u0E40\u0E2B\u0E25\u0E27
5086=\u0E1F\u0E34\u0E25\u0E14\u0E4C {0} \u0E44\u0E21\u0E48\u0E40\u0E2B\u0E21\u0E32\u0E30\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C {1}
5087=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E40\u0E2D\u0E47\u0E01\u0E0B\u0E4C\u0E40\u0E1E\u0E23\u0E2A\u0E0A\u0E31\u0E19\u0E02\u0E2D\u0E07\u0E1E\u0E32\u0E18\u0E40\u0E1B\u0E47\u0E19\u0E04\u0E48\u0E32\u0E20\u0E32\u0E22\u0E43\u0E19\u0E1A\u0E25\u0E47\u0E2D\u0E04\u0E01\u0E32\u0E23\u0E41\u0E1B\u0E25\u0E07\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E2A\u0E31\u0E48\u0E07
5088=\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E04\u0E27\u0E2D\u0E25\u0E34\u0E44\u0E1F\u0E40\u0E2D\u0E2D\u0E23\u0E4C $value \u0E01\u0E31\u0E1A\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C\u0E2B\u0E23\u0E37\u0E2D\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19 \u0E41\u0E25\u0E30\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E0A\u0E49\u0E17\u0E35\u0E48\u0E23\u0E30\u0E14\u0E31\u0E1A\u0E1A\u0E19\u0E2A\u0E38\u0E14\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19
5089=\u0E40\u0E2D\u0E47\u0E01\u0E0B\u0E4C\u0E40\u0E1E\u0E23\u0E2A\u0E0A\u0E31\u0E19 $case \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07: \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E01\u0E23\u0E13\u0E35\u0E2D\u0E22\u0E48\u0E32\u0E07\u0E19\u0E49\u0E2D\u0E22\u0E2B\u0E19\u0E36\u0E48\u0E07\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23 \u0E41\u0E25\u0E30\u0E01\u0E23\u0E13\u0E35\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02 (\u0E01\u0E23\u0E13\u0E35\u0E2D\u0E37\u0E48\u0E19\u0E46) \u0E15\u0E49\u0E2D\u0E07\u0E40\u0E1B\u0E47\u0E19\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E2A\u0E38\u0E14\u0E17\u0E49\u0E32\u0E22
5090=\u0E04\u0E33\u0E2A\u0E31\u0E48\u0E07 $let \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07: \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35 $variable \u0E41\u0E25\u0E30\u0E40\u0E2D\u0E47\u0E01\u0E0B\u0E4C\u0E40\u0E1E\u0E23\u0E2A\u0E0A\u0E31\u0E19\u0E2B\u0E19\u0E36\u0E48\u0E07\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23
5091=\u0E40\u0E2D\u0E47\u0E01\u0E0B\u0E4C\u0E40\u0E1E\u0E23\u0E2A\u0E0A\u0E31\u0E19 $sortArray \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07: \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E04\u0E33\u0E2B\u0E25\u0E31\u0E01 \u0E2B\u0E23\u0E37\u0E2D\u0E2D\u0E32\u0E40\u0E23\u0E22\u0E4C\u0E02\u0E2D\u0E07\u0E2D\u0E2D\u0E1A\u0E40\u0E08\u0E01\u0E15\u0E4C\u0E17\u0E35\u0E48\u0E41\u0E2A\u0E14\u0E07\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E1E\u0E32\u0E18\u0E41\u0E25\u0E30\u0E01\u0E32\u0E23\u0E40\u0E23\u0E35\u0E22\u0E07\u0E25\u0E33\u0E14\u0E31\u0E1A\u0E17\u0E35\u0E48\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23
5092=\u0E0A\u0E37\u0E48\u0E2D\u0E15\u0E31\u0E27\u0E41\u0E1B\u0E23\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 {0}; \u0E15\u0E49\u0E2D\u0E07\u0E02\u0E36\u0E49\u0E19\u0E15\u0E49\u0E19\u0E14\u0E49\u0E27\u0E22\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E17\u0E35\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E15\u0E31\u0E27\u0E2D\u0E31\u0E01\u0E29\u0E23\u0E41\u0E25\u0E30\u0E15\u0E49\u0E2D\u0E07\u0E1B\u0E23\u0E30\u0E01\u0E2D\u0E1A\u0E14\u0E49\u0E27\u0E22\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E17\u0E35\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E15\u0E31\u0E27\u0E2D\u0E31\u0E01\u0E29\u0E23\u0E41\u0E25\u0E30\u0E15\u0E31\u0E27\u0E40\u0E25\u0E02 ASCII \u0E2B\u0E23\u0E37\u0E2D\u0E40\u0E04\u0E23\u0E37\u0E48\u0E2D\u0E07\u0E2B\u0E21\u0E32\u0E22\u0E02\u0E35\u0E14\u0E25\u0E48\u0E32\u0E07\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19
#
# SQL phase "run-time" errors (5500 to 5999 error code range)
#
5500=\u0E08\u0E33\u0E19\u0E27\u0E19\u0E04\u0E48\u0E32\u0E2A\u0E40\u0E01\u0E25\u0E32\u0E23\u0E4C {0} \u0E44\u0E21\u0E48\u0E15\u0E23\u0E07\u0E01\u0E31\u0E1A\u0E08\u0E33\u0E19\u0E27\u0E19\u0E01\u0E32\u0E23\u0E40\u0E0A\u0E37\u0E48\u0E2D\u0E21\u0E42\u0E22\u0E07\u0E01\u0E32\u0E23\u0E2A\u0E37\u0E1A\u0E04\u0E49\u0E19 {1}
5501=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E42\u0E2D\u0E40\u0E1B\u0E2D\u0E40\u0E23\u0E40\u0E15\u0E2D\u0E23\u0E4C
