#
# Copyright (c) 2014, 2022, Oracle and/or its affiliates. 
#

# Messages used in query-by-example exceptions

#
# Syntax errors (5000 to 5499 error code range)
#
5000=eroare \u00EEn sintaxa interog\u0103rii.
5001=Elementele din matricea de valori pt. {0} trebuie s\u0103 fie scalare.
5002=Se a\u015Ftepta matricea pt. operatorul logic {0}.
5003=Valoarea pt. operatorul $id trebuie s\u0103 fie un \u015Fir sau un num\u0103r scalar ori o matrice de \u015Firuri sau numere scalare
5004=Nu se a\u015Ftepta operatorul {0}.
5005=Nr. de membri {0} este incorect pt. operatorul {1}.
5006=Valoare nevalid\u0103 pt. proprietatea {0}: se a\u015Ftepta {1}, s-a g\u0103sit {2}.
5007=Lipse\u015Fte proprietatea {0}.
5008=Calea nevalid\u0103 a c\u00E2mpului, {0}, nu are un format valid de cale.
5009=Obiectul specifica\u0163iei de indexare este nevalid, incomplet sau a e\u015Fuat la interpretare.
5010=Obiectul specifica\u0163iei de proiec\u0163ie este nevalid, incomplet sau a e\u015Fuat la interpretare.
5011=Tipul de date {0} nu a fost recunoscut sau nu este acceptabil pt. o coloan\u0103 de indexare.
5012=Lungimea {0} nu este acceptabil\u0103 pt. o coloan\u0103 de indexare.
5013=Limba {0} nu a fost recunoscut\u0103.
5014=Operandul pt. {0} trebuie s\u0103 fie un \u015Fir.
5015=Operandul pt. {0} nu poate fi {1}.
5016=Un container {1} nu poate fi operand pt. operatorul {0}.
5017=Componentele operatorului {0} trebuie s\u0103 fie obiecte.
5018=Numele de c\u00E2mp {0} nu este un operator recunoscut.
5019=Urmeaz\u0103 caractere nevalide la sf\u00E2r\u015Fitul unui document JSON.
5020=Matricea con\u0163ine cheia nevalid\u0103 {0}.
5021=Operatorul {0} trebuie s\u0103 aib\u0103 cel pu\u0163in o destina\u0163ie.
5022=C\u0103ile cu pa\u015Fi de matrice nu sunt acceptate.
5023=Cala nevalid\u0103 {0} nu a putut fi interpretat\u0103.\n
5024=Cale goal\u0103 sau nul\u0103 nevalid\u0103.
5025=Nu este permis un pas gol \u00EEn calea ({0}), la pozi\u0163ia {1}.
5026=Calea ({0}) are un subscript de matrice nevalid, {1}.
5027=Pas nevalid inclus \u00EEntre ghilimele, \u00EEn calea ({0}), la pozi\u0163ia {1}.
5028={0} ne\u00EEnchis\u0103 la sf\u00E2r\u015Fitul c\u0103ii ({1}).
5029=Lipse\u015Fte separatorul punct din calea ({0}), la pozi\u0163ia {1}.
5030=Lipse\u015Fte numele c\u00E2mpului din calea ({0}), la pozi\u0163ia {1}.
5031=Eroare de sintax\u0103 a c\u0103ii la pozi\u0163ia {1}, din calea ({0}).
5032=Nu sunt permi\u015Fi mai mul\u0163i operatori {0}.
5033=Valoarea operatorului {0} trebuie s\u0103 fie un obiect JSON.
5034=Dac\u0103 s-a utilizat $query, nu pot ap\u0103rea al\u0163i operatori de interogare la nivelul superior al specifica\u0163iei filtrului.
5035=Valoarea specificat\u0103 pt. calea de ordonare ({0}) este ({1}), care nu se poate converti la un num\u0103r \u00EEntreg diferit de zero. Asigura\u0163i-v\u0103 c\u0103 valoarea specificat\u0103 este un num\u0103r \u00EEntreg diferit de zero sau un \u015Fir care reprezint\u0103 un num\u0103r \u00EEntreg diferit de zero.
5036=Valoarea specificat\u0103 pt. calea de ordonare ({0}) este nevalid\u0103. Trebuie s\u0103 fie un num\u0103r \u00EEntreg diferit de zero sau un \u015Fir care reprezint\u0103 un num\u0103r \u00EEntreg diferit de zero.
5037=Operatorul $not nu poate \u00EEncadra operatorul {0}. 
5038=Cheia ({0}) nu este permis\u0103 la aceast\u0103 loca\u0163ie. Cheia trebuie s\u0103 fie un operator de comparare, $exists, sau $not.
5039=$id trebuie utilizat doar la nivelul zero, fie ca atare, fie sub $and.
5040=Valoarea "datatype" pt. "path" ({0}) nu este "string", dar s-a specificat "maxLength". "maxLength" se poate specificat doar dac\u0103 valoarea "datatype" este "string".
5041=Matricea de "fields" dintr-o specifica\u0163ie de indexare nu poate fi goal\u0103.
5042=\u00CEntr-o specifica\u0163ie de indexare, "{0}" nu se poate specificat f\u0103r\u0103 a specifica "fields".
5043="language" trebuie specificat\u0103 doar pt. o indexare de text JSON (\u00EEn acest caz "fields" trebuie omise)
5044=Valoarea "order" nu poate fi "{0}". Valorile valide sunt "asc", "desc", "1", "-1", 1 \u015Fi -1.
5045=Argumentul pt. {0} trebuie s\u0103 fie o matrice de dou\u0103 valori scalare, dintre care una nu trebuie s\u0103 fie nul\u0103.
5046=Matricea specifica\u0163iei Patch este nevalid\u0103, incomplet\u0103 sau a e\u015Fuat la interpretare.
5047=Operandul pt. {0} trebuie s\u0103 fie un num\u0103r.
5048=C\u00E2mpul {0} este nevalid pt. operatorul {1}.
5049=C\u00E2mpul {0} pt. operatorul {1} nu este recunoscut.
5050=Operatorul {0} trebuie s\u0103 aib\u0103 un c\u00E2mp {1}.
5051=Operatorii spa\u0163iali trebuie s\u0103 fie utiliza\u0163i doar la nivelul zero.
5052=$contains trebuie utilizat doar la nivelul zero.
5053=Operatorul {0} nu poate \u00EEncadra operatorul {1}.
5054=Un c\u00E2mp $orderby trebuie s\u0103 specifice o cale.
5055=Un c\u00E2mp $orderby nu poate avea proprietatea "{0}".
5056=Proprietatea $orderby "{0}" nu poate avea valoarea "{1}".
5057=Proprietatea "{1}" "{0}" trebuie s\u0103 fie de tip "{2}".
5058=Marcajele "scalarRequired" \u015Fi "lax" nu pot fi setate am\u00E2ndou\u0103 la true (Adev\u0103rat).
5059="{0}" nu poate fi setat \u00EEmpreun\u0103 cu "{1}".
5060="dataguide" nu poate fi "{0}". Valorile valide sunt "on" \u015Fi "off".
5061="search_on" nu poate fi "{0}". Valorile valide sunt "none", "text" \u015Fi "text_value".
5062=Elementele din matricea de valori pt. {0} nu pot fi booleene sau nule.
5063={0} trebuie utilizat doar la nivelul zero, fie ca atare, fie sub $and.
5064=Este permis\u0103 cel mult o clauz\u0103 $id.
5065=Condi\u0163iile de filtrare trebuie s\u0103 apar\u0103 \u00EEn clauza $query c\u00E2nd este utilizat\u0103 o clauz\u0103 $project, $patch, $merge sau $orderby.
5066=\u00CEntr-o specifica\u0163ie de indexare, nu se poate specifica "{0}" f\u0103r\u0103 a specifica "fields" sau "spatial".
5067=Operatorul "{0}" nu este acceptat \u00EEn $sqlJson.
5068=Valoarea \u015Firului condi\u0163iei de filtrare de lungimea {0} dep\u0103\u015Fe\u015Fte lungimea maxim\u0103 {1}.
5069=Un obiect nu poate fi utilizat pentru operatorul {0}.
5070=Matricea pentru {0} nu poate fi goal\u0103.
5071=Operandul pentru {0} nu poate fi o matrice.
5072=Operandul pentru o asignare trebuie s\u0103 fie o expresie scalar\u0103.
5073=Specifica\u0163ia actualiz\u0103rii este nevalid\u0103 sau incomplet\u0103.
5074=Valoarea pentru {0} trebuie s\u0103 fie un \u015Fir de cale.
5075=Calculul {0} trebuie s\u0103 aib\u0103 o matrice cu dou\u0103 valori tip operand.
5076=Calea ({0}) \u00EEncepe cu ''$'' \u015Fi nu este un operator cunoscut.
5077=Operandul pentru {0} nu poate fi o m\u0103rime scalar\u0103.
5078=Blocul de transformare trebuie s\u0103 aib\u0103 exact una dintre func\u0163iile: $keep, $remove, sau $modify.
5079=Nu s-a g\u0103sit nicio coresponden\u0163\u0103 pentru numele c\u00E2mpului {0} din operatorul {1}.
5080=Numele c\u00E2mpului {0} nu este permis \u00EEn operatorul {1}.
5081=Numele c\u00E2mpului {0} este duplicat \u00EEn operatorul {1}.
5082-The operandul pentru {0} trebuie s\u0103 fie o m\u0103rime scalar\u0103.
5083-The operandul pentru {0} trebuie s\u0103 aib\u0103 un tip de date definit.
5084=Agregarea trebuie s\u0103 specifice o opera\u0163ie pe c\u00E2mpuri.
5085=Conversia {0} la tipul scalar {1} a e\u015Fuat.
5086=C\u00E2mpul {0} este inadecvat pentru operatorul {1}.
5087=Expresia pentru cale nu este permis\u0103 ca valoare \u00EEn cadrul unui bloc de transformare neordonat.
5088=Un calificator $value poate fi aplicat numai unui obiect sau unei matrici \u015Fi trebuie utilizat numai la nivelul zero.
5089=Expresia $case este nevalid\u0103: trebuie s\u0103 aib\u0103 cel pu\u0163in un caz \u015Fi orice caz f\u0103r\u0103 condi\u0163ie (cazul 'else') trebuie s\u0103 fie ultimul.
5090=Declara\u0163ia $let este nevalid\u0103: trebuie s\u0103 aib\u0103 o $variable \u015Fi o expresie.
5091=Expresia $sortArray este nevalid\u0103: trebuie s\u0103 aib\u0103 un cuv\u00E2nt cheie sau o matrice de obiecte, care listeaz\u0103 \u015Firurile pentru c\u0103i \u015Fi ordinea dorit\u0103.
5092=Numele de variabil\u0103 {0} este nevalid; trebuie s\u0103 \u00EEnceap\u0103 cu un caracter alfabetic \u015Fi s\u0103 includ\u0103 numai caractere alfanumerice ASCII sau caracterul de subliniere.
#
# SQL phase "run-time" errors (5500 to 5999 error code range)
#
5500=Nr. de valori scalare {0} nu corespunde c\u0103 nr. de leg\u0103turi de interogare {1}.
5501=Operator neacceptat.
