#
# Copyright (c) 2014, 2015, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

1101=\u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23 {0} \u0E17\u0E35\u0E48\u0E08\u0E30\u0E41\u0E17\u0E19\u0E17\u0E35\u0E48\u0E43\u0E19 {1}
1102=\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E43\u0E0A\u0E49\u0E07\u0E32\u0E19
1103=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E40\u0E1B\u0E47\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E48\u0E32\u0E19\u0E2D\u0E22\u0E48\u0E32\u0E07\u0E40\u0E14\u0E35\u0E22\u0E27 \u0E44\u0E21\u0E48\u0E2D\u0E19\u0E38\u0E0D\u0E32\u0E15 {1}
1104=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E2D\u0E31\u0E1B\u0E40\u0E14\u0E15\u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07\u0E41\u0E1E\u0E47\u0E04\u0E40\u0E01\u0E08 {0}
1105=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E1F\u0E34\u0E25\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E41\u0E25\u0E30\u0E01\u0E32\u0E23\u0E2D\u0E31\u0E1B\u0E40\u0E14\u0E15\u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07\u0E41\u0E1E\u0E47\u0E04\u0E40\u0E01\u0E08 {0}
1106=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E1F\u0E34\u0E25\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E41\u0E25\u0E30\u0E01\u0E32\u0E23\u0E1B\u0E23\u0E30\u0E21\u0E32\u0E13\u0E01\u0E32\u0E23\u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07\u0E41\u0E1E\u0E47\u0E04\u0E40\u0E01\u0E08 {0}
1107=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E1F\u0E34\u0E25\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07\u0E41\u0E1E\u0E47\u0E04\u0E40\u0E01\u0E08 {0}
1108=\u0E44\u0E21\u0E48\u0E2D\u0E19\u0E38\u0E0D\u0E32\u0E15\u0E43\u0E2B\u0E49\u0E43\u0E0A\u0E49\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07\u0E41\u0E1E\u0E47\u0E04\u0E40\u0E01\u0E08 {0}
1109=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32\u0E44\u0E1A\u0E19\u0E32\u0E23\u0E35\u0E43\u0E19\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C {1}
1110=\u0E04\u0E33\u0E02\u0E2D\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E21\u0E35\u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C\u0E21\u0E32\u0E01\u0E01\u0E27\u0E48\u0E32 {0} \u0E04\u0E2D\u0E25\u0E31\u0E21\u0E19\u0E4C
1111=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E27\u0E25\u0E32\u0E23\u0E30\u0E1A\u0E1A\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\u0E27\u0E48\u0E32\u0E41\u0E01\u0E49\u0E44\u0E02\u0E04\u0E23\u0E31\u0E49\u0E07\u0E25\u0E48\u0E32\u0E2A\u0E38\u0E14\u0E40\u0E21\u0E37\u0E48\u0E2D\u0E43\u0E14
1112=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E44\u0E14\u0E49\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E04\u0E2D\u0E19\u0E1F\u0E34\u0E40\u0E01\u0E2D\u0E23\u0E4C\u0E40\u0E1E\u0E37\u0E48\u0E2D\u0E44\u0E21\u0E48\u0E43\u0E2B\u0E49\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E25\u0E1A\u0E44\u0E14\u0E49
1113=\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02\u0E02\u0E2D\u0E07\u0E1F\u0E34\u0E25\u0E40\u0E15\u0E2D\u0E23\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
1114=\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E43\u0E0A\u0E49\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19 {1} \u0E44\u0E21\u0E48\u0E2D\u0E19\u0E38\u0E0D\u0E32\u0E15\u0E43\u0E2B\u0E49\u0E43\u0E0A\u0E49\u0E01\u0E32\u0E23\u0E40\u0E02\u0E35\u0E22\u0E19\u0E41\u0E1A\u0E1A\u0E2A\u0E15\u0E23\u0E35\u0E21
1115=Descriptor \u0E44\u0E21\u0E48\u0E15\u0E23\u0E07\u0E01\u0E31\u0E1A\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E17\u0E35\u0E48\u0E21\u0E35\u0E2D\u0E22\u0E39\u0E48
1116=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E2D\u0E31\u0E1B\u0E40\u0E14\u0E15\u0E2B\u0E23\u0E37\u0E2D\u0E41\u0E1E\u0E17\u0E0A\u0E4C\u0E2A\u0E48\u0E27\u0E19\u0E40\u0E1E\u0E34\u0E48\u0E21\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23
1117=\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E43\u0E0A\u0E49\u0E07\u0E32\u0E19\u0E01\u0E32\u0E23\u0E2A\u0E37\u0E1A\u0E04\u0E49\u0E19\u0E42\u0E14\u0E22 {1} \u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07\u0E41\u0E1E\u0E47\u0E04\u0E40\u0E01\u0E08 {0}
1118=\u0E15\u0E49\u0E2D\u0E07\u0E23\u0E30\u0E1A\u0E38\u0E0A\u0E37\u0E48\u0E2D\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19
1119=\u0E21\u0E35\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E2D\u0E22\u0E39\u0E48\u0E41\u0E25\u0E49\u0E27
1120=\u0E04\u0E48\u0E32 {0} \u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E04\u0E35\u0E22\u0E4C\u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17 {1}
1121=\u0E01\u0E32\u0E23\u0E41\u0E17\u0E23\u0E01\u0E40\u0E2D\u0E01\u0E2A\u0E32\u0E23\u0E43\u0E19\u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E25\u0E49\u0E21\u0E40\u0E2B\u0E25\u0E27
1122=\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E15\u0E31\u0E14\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25 \u0E04\u0E2D\u0E25\u0E40\u0E25\u0E47\u0E04\u0E0A\u0E31\u0E19 {0} \u0E44\u0E21\u0E48\u0E43\u0E0A\u0E48\u0E41\u0E1A\u0E1A\u0E17\u0E35\u0E48\u0E43\u0E0A\u0E49\u0E15\u0E32\u0E23\u0E32\u0E07
1123=Java Virtual Machine (JVM) \u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E2D\u0E31\u0E25\u0E01\u0E2D\u0E23\u0E34\u0E17\u0E36\u0E21\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19 MD5 \u0E40\u0E1B\u0E25\u0E35\u0E48\u0E22\u0E19\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E31\u0E25\u0E01\u0E2D\u0E23\u0E34\u0E17\u0E36\u0E21\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19\u0E2D\u0E37\u0E48\u0E19
1124=Java Virtual Machine (JVM) \u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E2D\u0E31\u0E25\u0E01\u0E2D\u0E23\u0E34\u0E17\u0E36\u0E21\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19 SHA256 \u0E40\u0E1B\u0E25\u0E35\u0E48\u0E22\u0E19\u0E40\u0E1B\u0E47\u0E19\u0E2D\u0E31\u0E25\u0E01\u0E2D\u0E23\u0E34\u0E17\u0E36\u0E21\u0E01\u0E32\u0E23\u0E04\u0E27\u0E1A\u0E04\u0E38\u0E21\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E0A\u0E31\u0E19\u0E2D\u0E37\u0E48\u0E19

