#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=\u00C7ok par\u00E7al\u0131/form verileri g\u00F6vdesi ayr\u0131\u015Ft\u0131r\u0131l\u0131rken s\u0131n\u0131r dizesi bulunamad\u0131.
1002=\u00C7ok par\u00E7al\u0131/form verileri g\u00F6vdesi ayr\u0131\u015Ft\u0131r\u0131l\u0131rken s\u0131n\u0131r i\u00E7in sat\u0131r ay\u0131r\u0131c\u0131 bulunamad\u0131.
1003=Form ba\u011F\u0131ms\u0131z de\u011Fi\u015Fkenleri ayr\u0131\u015Ft\u0131r\u0131l\u0131rken karakter k\u00FCmesi d\u00F6n\u00FC\u015Ft\u00FCrme ba\u015Far\u0131s\u0131z oldu.
1004=Sorgu dizesi karakter k\u00FCmesi d\u00F6n\u00FC\u015Ft\u00FCrmesi ba\u015Far\u0131s\u0131z oldu.
1005=\u00C7ok par\u00E7al\u0131/form verileri g\u00F6vdesi ayr\u0131\u015Ft\u0131r\u0131l\u0131rken ba\u015Fl\u0131k i\u00E7in sat\u0131r sonland\u0131r\u0131c\u0131s\u0131 bulunamad\u0131.
1006=\u00C7ok par\u00E7al\u0131/form verileri g\u00F6vdesi ayr\u0131\u015Ft\u0131r\u0131l\u0131rken beklenen alan ad\u0131 bulunamad\u0131.
1007=\u00C7ok par\u00E7al\u0131/form verileri g\u00F6vdesinde ge\u00E7ersiz alan ad\u0131.
1008=\u00C7ok par\u00E7al\u0131/form verileri g\u00F6vdesinde alan veya dosya ad\u0131nda kapan\u0131\u015F \u00E7ift t\u0131rnak i\u015Fareti eksik.
1009=\u00C7ok par\u00E7al\u0131/form verileri g\u00F6vdesinde alan ba\u015Flang\u0131\u00E7 de\u011Ferini i\u015Faretleyen sat\u0131r ay\u0131r\u0131c\u0131s\u0131 bulunamad\u0131.
1010=\u00C7ok par\u00E7al\u0131/form verileri g\u00F6vdesinde alan biti\u015F de\u011Ferini i\u015Faretleyen s\u0131n\u0131r dizesi bulunamad\u0131.
1011=Ge\u00E7ersiz tarih/saat dizesi {0} (format yyyy-AA-gg''S''SS:dd:ss.SSS).
1012=Sorgu s\u00F6zdizimi hatas\u0131.
1013=Karakter kodlama {0} tan\u0131nm\u0131yor.
1014=Kodlanm\u0131\u015F bayt s\u0131ras\u0131 kodu {0} olarak \u00E7\u00F6z\u00FClemez.
1015={0} ortam t\u00FCr\u00FC POST''una izin verilmez.
1016=Ge\u00E7ersiz servlet konfig\u00FCrasyonu: {0}.
1017=Bilinmeyen hesap {0}, ge\u00E7erli \u015Fema: {1}.
1018=Null veya bo\u015F dize ge\u00E7erli bir tarih/saat de\u011Fil.
1019=Dok\u00FCmanda anahtara ait birden fazla an var.
1020=Anahtar \u00E7\u0131karma/ekleme i\u00E7in hi\u00E7 giri\u015F dok\u00FCman\u0131 yok.
1021=Anahtar \u00E7\u0131karma/ekleme veri yolu bo\u015F olamaz.
1022=Dok\u00FCman an\u0131 d\u00FCzg\u00FCn kapat\u0131lmam\u0131\u015F.
1023=Dok\u00FCman an\u0131 bo\u015F veya JSON nesnesi de\u011Fil.
1024=\u00C7\u0131kar\u0131lan anahtar bir dize veya say\u0131 de\u011Fil.
1025=Eklenen anahtar mevcut anahtar ile e\u015Fle\u015Fmiyor.
