#
# Copyright (c) 2014, 2019, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=N\u00E3o foi poss\u00EDvel encontrar a string lim\u00EDtrofe ao efetuar parsing do corpo multipart/form-data.
1002=N\u00E3o foi poss\u00EDvel encontrar o separador de linha ao efetuar parsing do corpo multipart/form-data.
1003=Houve falha na convers\u00E3o do conjunto de caracteres ao efetuar parsing dos argumentos do form.
1004=Houve falha na convers\u00E3o do conjunto de caracteres da string de consulta.
1005=N\u00E3o foi poss\u00EDvel encontrar o separador de linha do cabe\u00E7alho ao efetuar parsing do corpo multipart/form-data.
1006=N\u00E3o foi poss\u00EDvel encontrar o nome de campo esperado ao efetuar parsing do corpo multipart/form-data.
1007=Nome de campo inv\u00E1lido no corpo multipart/form-data.
1008=Faltam as aspas de fechamento no nome do campo ou arquivo no corpo multipart/form-data.
1009=N\u00E3o foi encontrado no corpo multipart/form-data o separador de linha que marca o in\u00EDcio do valor do campo.
1010=N\u00E3o foi encontrado no corpo multipart/form-data a string lim\u00EDtrofe que marca o final do valor do campo.
1011=String {0} de data/hor\u00E1rio inv\u00E1lida (o formato \u00E9 aaaa-MM-dd''T''HH:mm:ss.SSS).
1012=Erro na sintaxe da consulta.
1013=Codifica\u00E7\u00E3o de caracteres {0} n\u00E3o reconhecida.
1014=N\u00E3o foi poss\u00EDvel decodificar como {0} a sequ\u00EAncia de bytes codificada.
1015=POST do tipo de m\u00EDdia {0} n\u00E3o permitido.
1016=Configura\u00E7\u00E3o inv\u00E1lida do servlet: {0}.
1017=Conta {0} desconhecida; o esquema atual \u00E9 {1}.
1018=String nula ou vazia - n\u00E3o \u00E9 uma data/hora v\u00E1lida.
1019=O documento tem v\u00E1rias inst\u00E2ncias de chave.
1020=N\u00E3o h\u00E1 documento de entrada para a extra\u00E7\u00E3o/inser\u00E7\u00E3o da chave.
1021=O caminho para a extra\u00E7\u00E3o/inser\u00E7\u00E3o da chave n\u00E3o pode ficar vazio.
1022=A inst\u00E2ncia do documento n\u00E3o foi fechada corretamente.
1023=A inst\u00E2ncia do documento est\u00E1 vazio ou n\u00E3o \u00E9 um objeto JSON.
1024=A chave extra\u00EDda n\u00E3o era uma string ou n\u00FAmero.
1025=A chave inserida n\u00E3o corresponde \u00E0 chave existente.
1026=Foi encontrado um campo duplicado para a etapa principal {0}.
1027=Convers\u00E3o de formato n\u00E3o implementada ou indispon\u00EDvel.
1028=N\u00E3o h\u00E1 suporte para o tipo de dados JSON estendido {0}.
1029=O documento de entrada para uma convers\u00E3o est\u00E1 danificado ou ileg\u00EDvel.
1030=N\u00E3o \u00E9 poss\u00EDvel extrair a chave com uma substitui\u00E7\u00E3o de chave pendente.
1031=Caminho de chave n\u00E3o especificado para a convers\u00E3o.
1032=Opera\u00E7\u00E3o {0} n\u00E3o permitida em {1}.
1033=A opera\u00E7\u00E3o de documento encontrou um erro: {0}.
1034=N\u00E3o h\u00E1 suporte para o tipo de documento {0}.
