#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=\u05DC\u05D0 \u05E0\u05DE\u05E6\u05D0\u05D4 \u05DE\u05D7\u05E8\u05D5\u05D6\u05EA \u05D2\u05D1\u05D5\u05DC \u05D1\u05E2\u05EA \u05E4\u05D9\u05E8\u05D5\u05E7 \u05D2\u05D5\u05E3 multipart/form-data.
1002=\u05DC\u05D0 \u05E0\u05DE\u05E6\u05D0 \u05DE\u05E4\u05E8\u05D9\u05D3 \u05E9\u05D5\u05E8\u05D5\u05EA \u05DC\u05D2\u05D1\u05D5\u05DC \u05D1\u05E2\u05EA \u05E4\u05D9\u05E8\u05D5\u05E7 \u05D2\u05D5\u05E3 multipart/form-data.
1003=\u05DB\u05E9\u05DC \u05D1\u05D4\u05DE\u05E8\u05EA \u05DE\u05E2\u05E8\u05DB\u05EA \u05EA\u05D5\u05D5\u05D9\u05DD \u05D1\u05E2\u05EA \u05E4\u05D9\u05E8\u05D5\u05E7 \u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8\u05D9\u05DD \u05E9\u05DC \u05D8\u05D5\u05E4\u05E1.
1004=\u05DB\u05E9\u05DC \u05D1\u05D4\u05DE\u05E8\u05EA \u05DE\u05E2\u05E8\u05DB\u05EA \u05EA\u05D5\u05D5\u05D9\u05DD \u05E9\u05DC \u05DE\u05D7\u05E8\u05D5\u05D6\u05EA \u05E9\u05D0\u05D9\u05DC\u05EA\u05D0.
1005=\u05DC\u05D0 \u05E0\u05DE\u05E6\u05D0 \u05DE\u05E1\u05D9\u05D9\u05DD \u05E9\u05D5\u05E8\u05D4 \u05DC\u05DB\u05D5\u05EA\u05E8\u05EA \u05D1\u05E2\u05EA \u05E4\u05D9\u05E8\u05D5\u05E7 \u05D2\u05D5\u05E3 multipart/form-data.
1006=\u05DC\u05D0 \u05E0\u05DE\u05E6\u05D0 \u05E9\u05DD \u05E9\u05D3\u05D4 \u05E6\u05E4\u05D5\u05D9 \u05D1\u05E2\u05EA \u05E4\u05D9\u05E8\u05D5\u05E7 \u05D2\u05D5\u05E3 multipart/form-data.
1007=\u05E9\u05DD \u05E9\u05D3\u05D4 \u05DC\u05D0 \u05EA\u05E7\u05E3 \u05D1\u05D2\u05D5\u05E3 multipart/form-data.
1008=\u05DE\u05E8\u05DB\u05D0\u05D5\u05EA \u05E1\u05D5\u05D2\u05E8\u05D5\u05EA \u05D7\u05E1\u05E8\u05D5\u05EA \u05D1\u05E9\u05DD \u05E9\u05D3\u05D4 \u05D0\u05D5 \u05D1\u05E9\u05DD \u05E7\u05D5\u05D1\u05E5 \u05D1\u05D2\u05D5\u05E3 multipart/form-data.
1009=\u05DC\u05D0 \u05E0\u05DE\u05E6\u05D0 \u05DE\u05E4\u05E8\u05D9\u05D3 \u05E9\u05D5\u05E8\u05D5\u05EA \u05D4\u05DE\u05E1\u05DE\u05DF \u05D0\u05EA \u05EA\u05D7\u05D9\u05DC\u05EA \u05E2\u05E8\u05DA \u05D4\u05E9\u05D3\u05D4 \u05D1\u05E2\u05EA \u05E0\u05D9\u05EA\u05D5\u05D7 \u05D2\u05D5\u05E3 multipart/form-data.
1010=\u05DC\u05D0 \u05E0\u05DE\u05E6\u05D0 \u05DE\u05D7\u05E8\u05D5\u05D6\u05EA \u05D2\u05D1\u05D5\u05DC \u05D4\u05DE\u05E1\u05DE\u05E0\u05EA \u05D0\u05EA \u05E1\u05D9\u05D5\u05DD \u05E2\u05E8\u05DA \u05D4\u05E9\u05D3\u05D4 \u05D1\u05E2\u05EA \u05E0\u05D9\u05EA\u05D5\u05D7 \u05D2\u05D5\u05E3 multipart/form-data.
1011=\u05DE\u05D7\u05E8\u05D5\u05D6\u05EA \u05EA\u05D0\u05E8\u05D9\u05DA/\u05E9\u05E2\u05D4 \u05DC\u05D0 \u05EA\u05E7\u05E4\u05D4 {0}. \u05D4\u05EA\u05D1\u05E0\u05D9\u05EA \u05D4\u05D9\u05D0 yyyy-MM-dd''T''HH:mm:ss.SSS.
1012=\u05E9\u05D2\u05D9\u05D0\u05EA \u05EA\u05D7\u05D1\u05D9\u05E8 \u05E9\u05DC \u05E9\u05D0\u05D9\u05DC\u05EA\u05D0.
1013=\u05E7\u05D9\u05D3\u05D5\u05D3 \u05D4\u05EA\u05D5\u05D5\u05D9\u05DD {0} \u05DC\u05D0 \u05DE\u05D6\u05D5\u05D4\u05D4.
1014=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E4\u05EA\u05D5\u05E8 \u05D0\u05EA \u05E8\u05E6\u05E3 \u05D4\u05D1\u05D9\u05D9\u05D8\u05D9\u05DD \u05D4\u05DE\u05E7\u05D5\u05D3\u05D3 \u05DB-{0}.
1015=POST \u05E9\u05DC \u05E1\u05D5\u05D2 \u05D4\u05DE\u05D3\u05D9\u05D4 {0} \u05D0\u05E1\u05D5\u05E8.
1016=\u05EA\u05E6\u05D5\u05E8\u05EA servlet \u05DC\u05D0 \u05EA\u05E7\u05E4\u05D4: {0}.
1017=\u05D7\u05E9\u05D1\u05D5\u05DF \u05DC\u05D0 \u05D9\u05D3\u05D5\u05E2 {0}, \u05D4\u05E1\u05DB\u05DE\u05D4 \u05D4\u05E0\u05D5\u05DB\u05D7\u05D9\u05EA \u05D4\u05D9\u05D0 {1}.
1018=\u05DE\u05D7\u05E8\u05D5\u05D6\u05EA Null \u05D0\u05D5 \u05E8\u05D9\u05E7\u05D4 \u05D0\u05D9\u05E0\u05D4 \u05EA\u05D0\u05E8\u05D9\u05DA/\u05E9\u05E2\u05D4 \u05EA\u05E7\u05E4\u05D9\u05DD.
1019=\u05DC\u05DE\u05E1\u05DE\u05DA \u05D9\u05E9 \u05E8\u05D9\u05D1\u05D5\u05D9 \u05DE\u05D5\u05E4\u05E2\u05D9 \u05DE\u05E4\u05EA\u05D7.
1020=\u05D0\u05D9\u05DF \u05DE\u05E1\u05DE\u05DA \u05E7\u05DC\u05D8 \u05DC\u05D7\u05D9\u05DC\u05D5\u05E5/\u05D4\u05D5\u05E1\u05E4\u05EA \u05DE\u05E4\u05EA\u05D7.
1021=\u05D4\u05E0\u05EA\u05D9\u05D1 \u05DC\u05D7\u05D9\u05DC\u05D5\u05E5/\u05D4\u05D5\u05E1\u05E4\u05D4 \u05E9\u05DC \u05DE\u05E4\u05EA\u05D7 \u05D0\u05D9\u05E0\u05D5 \u05D9\u05DB\u05D5\u05DC \u05DC\u05D4\u05D9\u05D5\u05EA \u05E8\u05D9\u05E7.
1022=\u05DE\u05D5\u05E4\u05E2 \u05D4\u05DE\u05E1\u05DE\u05DA \u05DC\u05D0 \u05E0\u05E1\u05D2\u05E8 \u05DB\u05E8\u05D0\u05D5\u05D9.
1023=\u05DE\u05D5\u05E4\u05E2 \u05D4\u05DE\u05E1\u05DE\u05DA \u05D4\u05D5\u05D0 \u05E8\u05D9\u05E7 \u05D0\u05D5 \u05E9\u05D0\u05D9\u05E0\u05D5 \u05D0\u05D5\u05D1\u05D9\u05D9\u05E7\u05D8 JSON.
1024=\u05D4\u05DE\u05E4\u05EA\u05D7 \u05E9\u05D7\u05D5\u05DC\u05E5 \u05D0\u05D9\u05E0\u05D5 \u05DE\u05D7\u05E8\u05D5\u05D6\u05EA \u05D5\u05D0\u05D9\u05E0\u05D5 \u05DE\u05E1\u05E4\u05E8.
1025=\u05D4\u05DE\u05E4\u05EA\u05D7 \u05E9\u05E0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05E0\u05D5 \u05DE\u05EA\u05D0\u05D9\u05DD \u05DC\u05D0\u05E3 \u05DE\u05E4\u05EA\u05D7 \u05E7\u05D9\u05D9\u05DD.
