#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=\u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0633\u0644\u0633\u0644\u0629 \u0627\u0644\u062D\u062F \u0623\u062B\u0646\u0627\u0621 \u062A\u062D\u0644\u064A\u0644 \u0627\u0644\u0646\u0635 \u0630\u064A \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0639\u062F\u062F \u0627\u0644\u0623\u062C\u0632\u0627\u0621 multipart/\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C form-data.
1002=\u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0641\u0627\u0635\u0644 \u0627\u0644\u0623\u0633\u0637\u0631 \u0644\u0644\u062D\u062F \u0623\u062B\u0646\u0627\u0621 \u062A\u062D\u0644\u064A\u0644 \u0627\u0644\u0646\u0635 \u0630\u064A \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0639\u062F\u062F \u0627\u0644\u0623\u062C\u0632\u0627\u0621 multipart/\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C form-data.
1003=\u0641\u0634\u0644 \u062A\u062D\u0648\u064A\u0644 \u0645\u062C\u0645\u0648\u0639\u0629 \u0627\u0644\u0623\u062D\u0631\u0641 \u0623\u062B\u0646\u0627\u0621 \u062A\u062D\u0644\u064A\u0644 \u0648\u0633\u064A\u0637\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C.
1004=\u0641\u0634\u0644 \u062A\u062D\u0648\u064A\u0644 \u0645\u062C\u0645\u0648\u0639\u0629 \u0627\u0644\u0623\u062D\u0631\u0641 \u0644\u0633\u0644\u0633\u0644\u0629 \u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645.
1005=\u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0645\u0646\u0647\u064A \u0627\u0644\u0623\u0633\u0637\u0631 \u0644\u0644\u0631\u0623\u0633 \u0623\u062B\u0646\u0627\u0621 \u062A\u062D\u0644\u064A\u0644 \u0627\u0644\u0646\u0635 \u0630\u064A \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0639\u062F\u062F \u0627\u0644\u0623\u062C\u0632\u0627\u0621 multipart/\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C form-data.
1006=\u0627\u0633\u0645 \u0627\u0644\u062D\u0642\u0644 \u0645\u062A\u0648\u0642\u0639 \u0648\u0644\u0643\u0646 \u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u064A\u0647 \u0623\u062B\u0646\u0627\u0621 \u062A\u062D\u0644\u064A\u0644 \u0627\u0644\u0646\u0635 \u0630\u064A \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0639\u062F\u062F \u0627\u0644\u0623\u062C\u0632\u0627\u0621 multipart/\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C form-data.
1007=\u0627\u0633\u0645 \u0627\u0644\u062D\u0642\u0644 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D \u0641\u064A \u0627\u0644\u0646\u0635 \u0630\u064A \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0639\u062F\u062F \u0627\u0644\u0623\u062C\u0632\u0627\u0621 multipart/\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C form-data.
1008=\u0639\u0644\u0627\u0645\u0629 \u0625\u063A\u0644\u0627\u0642 \u0627\u0644\u0627\u0642\u062A\u0628\u0627\u0633 \u063A\u064A\u0631 \u0645\u0648\u062C\u0648\u062F\u0629 \u0628\u0627\u0633\u0645 \u0627\u0644\u062D\u0642\u0644 \u0623\u0648 \u0627\u0644\u0645\u0644\u0641 \u0641\u064A \u0627\u0644\u0646\u0635 \u0630\u064A \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0639\u062F\u062F \u0627\u0644\u0623\u062C\u0632\u0627\u0621 multipart/\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C form-data.
1009=\u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0641\u0627\u0635\u0644 \u0627\u0644\u0623\u0633\u0637\u0631 \u0627\u0644\u0630\u064A \u064A\u062D\u062F\u062F \u0628\u062F\u0627\u064A\u0629 \u0642\u064A\u0645\u0629 \u0627\u0644\u062D\u0642\u0644\u060C \u0641\u064A \u0627\u0644\u0646\u0635 \u0630\u064A \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0639\u062F\u062F \u0627\u0644\u0623\u062C\u0632\u0627\u0621 multipart/\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C form-data.
1010=\u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0633\u0644\u0633\u0644\u0629 \u0627\u0644\u062D\u062F \u0627\u0644\u062A\u064A \u062A\u062D\u062F\u062F \u0646\u0647\u0627\u064A\u0629 \u0642\u064A\u0645\u0629 \u0627\u0644\u062D\u0642\u0644\u060C \u0641\u064A \u0627\u0644\u0646\u0635 \u0630\u064A \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0639\u062F\u062F \u0627\u0644\u0623\u062C\u0632\u0627\u0621 multipart/\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0646\u0645\u0648\u0630\u062C form-data.
1011=\u0633\u0644\u0633\u0644\u0629 \u0627\u0644\u062A\u0627\u0631\u064A\u062E/\u0627\u0644\u0648\u0642\u062A \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629 {0} (\u0627\u0644\u0635\u064A\u063A\u0629 \u0647\u064A yyyy-MM-dd''T''HH:mm:ss.SSS).
1012=\u062E\u0637\u0623 \u0641\u064A \u0635\u064A\u0627\u063A\u0629 \u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645.
1013=\u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u062A\u0639\u0631\u0641 \u0639\u0644\u0649 \u062A\u0631\u0645\u064A\u0632 \u0627\u0644\u0623\u062D\u0631\u0641 {0}.
1014=\u062A\u0639\u0630\u0631 \u0641\u0643 \u062A\u0631\u0645\u064A\u0632 \u062A\u0633\u0644\u0633\u0644 \u0648\u062D\u062F\u0627\u062A \u0627\u0644\u0628\u0627\u064A\u062A \u0627\u0644\u0630\u064A \u062A\u0645 \u062A\u0631\u0645\u064A\u0632\u0647\u060C \u0643\u0640 {0}.
1015=\u063A\u064A\u0631 \u0645\u0633\u0645\u0648\u062D \u0628\u0640 POST \u0645\u0646 \u0646\u0648\u0639 \u0627\u0644\u0648\u0633\u0627\u0626\u0637 {0}.
1016=\u062A\u0643\u0648\u064A\u0646 \u0628\u0631\u064A\u0645\u062C \u0627\u0644\u062E\u0627\u062F\u0645 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D: {0}.
1017=\u062D\u0633\u0627\u0628 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641 {0}\u060C \u0645\u062E\u0637\u0637 \u0642\u0627\u0639\u062F\u0629 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u062D\u0627\u0644\u064A \u0647\u0648 {1}.
1018=\u0627\u0644\u0633\u0644\u0633\u0644\u0629 \u0627\u0644\u0641\u0627\u0631\u063A\u0629 \u0623\u0648 \u0627\u0644\u062E\u0627\u0644\u064A\u0629 \u062A\u0639\u062F \u0642\u064A\u0645\u0629 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629 \u0644\u0644\u062A\u0627\u0631\u064A\u062E/\u0627\u0644\u0648\u0642\u062A.
1019=\u064A\u0634\u062A\u0645\u0644 \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0639\u0644\u0649 \u0637\u0628\u0639\u0627\u062A \u0645\u062A\u0639\u062F\u062F\u0629 \u0645\u0646 \u0627\u0644\u0645\u0641\u062A\u0627\u062D.
1020=\u0644\u0627 \u064A\u0648\u062C\u062F \u0645\u0633\u062A\u0646\u062F \u0645\u062F\u062E\u0644 \u0644\u0627\u0633\u062A\u062E\u0631\u0627\u062C/\u0625\u062F\u0631\u0627\u062C \u0645\u0641\u062A\u0627\u062D.
1021=\u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u0631\u0643 \u0645\u0633\u0627\u0631 \u0627\u0633\u062A\u062E\u0631\u0627\u062C/\u0625\u062F\u0631\u0627\u062C \u0627\u0644\u0645\u0641\u062A\u0627\u062D \u0641\u0627\u0631\u063A\u064B\u0627.
1022=\u0644\u0645 \u064A\u062A\u0645 \u0625\u063A\u0644\u0627\u0642 \u0637\u0628\u0639\u0629 \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0639\u0644\u0649 \u0646\u062D\u0648 \u0635\u062D\u064A\u062D.
1023=\u0637\u0628\u0639\u0629 \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0641\u0627\u0631\u063A\u0629 \u0623\u0648 \u0644\u064A\u0633\u062A \u0643\u0627\u0626\u0646 JSON.
1024=\u0644\u0645 \u064A\u0643\u0646 \u0627\u0644\u0645\u0641\u062A\u0627\u062D \u0627\u0644\u0645\u0633\u062A\u062E\u0631\u062C \u0633\u0644\u0633\u0644\u0629 \u0623\u0648 \u0631\u0642\u0645\u064B\u0627.
1025=\u0627\u0644\u0645\u0641\u062A\u0627\u062D \u0627\u0644\u0645\u062F\u0631\u062C \u063A\u064A\u0631 \u0645\u0637\u0627\u0628\u0642 \u0644\u0644\u0645\u0641\u062A\u0627\u062D \u0627\u0644\u0645\u0648\u062C\u0648\u062F.
