#
# Copyright (c) 2014, 2015, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=\u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E02\u0E2D\u0E1A\u0E40\u0E02\u0E15\u0E02\u0E13\u0E30\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32 multipart/form-data
1002=\u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E15\u0E31\u0E27\u0E04\u0E31\u0E48\u0E19\u0E1A\u0E23\u0E23\u0E17\u0E31\u0E14\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E02\u0E2D\u0E1A\u0E40\u0E02\u0E15\u0E02\u0E13\u0E30\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32 multipart/form-data
1003=\u0E01\u0E32\u0E23\u0E41\u0E1B\u0E25\u0E07\u0E0A\u0E38\u0E14\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E25\u0E49\u0E21\u0E40\u0E2B\u0E25\u0E27\u0E02\u0E13\u0E30\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E2D\u0E32\u0E23\u0E4C\u0E01\u0E34\u0E27\u0E40\u0E21\u0E19\u0E15\u0E4C\u0E02\u0E2D\u0E07\u0E1F\u0E2D\u0E23\u0E4C\u0E21
1004=\u0E01\u0E32\u0E23\u0E41\u0E1B\u0E25\u0E07\u0E0A\u0E38\u0E14\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E02\u0E2D\u0E07\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E01\u0E32\u0E23\u0E2A\u0E37\u0E1A\u0E04\u0E49\u0E19\u0E25\u0E49\u0E21\u0E40\u0E2B\u0E25\u0E27
1005=\u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E40\u0E04\u0E23\u0E37\u0E48\u0E2D\u0E07\u0E2B\u0E21\u0E32\u0E22\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E1A\u0E23\u0E23\u0E17\u0E31\u0E14\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E2A\u0E48\u0E27\u0E19\u0E2B\u0E31\u0E27\u0E02\u0E13\u0E30\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32 multipart/form-data
1006=\u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E0A\u0E37\u0E48\u0E2D\u0E1F\u0E34\u0E25\u0E14\u0E4C\u0E17\u0E35\u0E48\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E02\u0E13\u0E30\u0E1E\u0E32\u0E23\u0E4C\u0E0B\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32 multipart/form-data
1007=\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32 multipart/form-data \u0E21\u0E35\u0E0A\u0E37\u0E48\u0E2D\u0E1F\u0E34\u0E25\u0E14\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
1008=\u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E04\u0E23\u0E37\u0E48\u0E2D\u0E07\u0E2B\u0E21\u0E32\u0E22\u0E04\u0E33\u0E1E\u0E39\u0E14\u0E1B\u0E34\u0E14\u0E43\u0E19\u0E1F\u0E34\u0E25\u0E14\u0E4C\u0E2B\u0E23\u0E37\u0E2D\u0E0A\u0E37\u0E48\u0E2D\u0E44\u0E1F\u0E25\u0E4C\u0E43\u0E19\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32 multipart/form-data
1009=\u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E15\u0E31\u0E27\u0E04\u0E31\u0E48\u0E19\u0E1A\u0E23\u0E23\u0E17\u0E31\u0E14\u0E17\u0E35\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E08\u0E38\u0E14\u0E40\u0E23\u0E34\u0E48\u0E21\u0E15\u0E49\u0E19\u0E04\u0E48\u0E32\u0E02\u0E2D\u0E07\u0E1F\u0E34\u0E25\u0E14\u0E4C\u0E43\u0E19\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32 multipart/form-data
1010=\u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E02\u0E2D\u0E1A\u0E40\u0E02\u0E15\u0E17\u0E35\u0E48\u0E40\u0E1B\u0E47\u0E19\u0E08\u0E38\u0E14\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E04\u0E48\u0E32\u0E02\u0E2D\u0E07\u0E1F\u0E34\u0E25\u0E14\u0E4C\u0E43\u0E19\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E2B\u0E32 multipart/form-data
1011=\u0E2A\u0E15\u0E23\u0E34\u0E07\u0E27\u0E31\u0E19\u0E17\u0E35\u0E48/\u0E40\u0E27\u0E25\u0E32 {0} \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 (\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E17\u0E35\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E04\u0E37\u0E2D yyyy-MM-dd''T''HH:mm:ss.SSS)
1012=\u0E40\u0E01\u0E34\u0E14\u0E02\u0E49\u0E2D\u0E1C\u0E34\u0E14\u0E1E\u0E25\u0E32\u0E14\u0E01\u0E31\u0E1A\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E04\u0E33\u0E2A\u0E31\u0E48\u0E07\u0E02\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E2A\u0E37\u0E1A\u0E04\u0E49\u0E19
1013=\u0E44\u0E21\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01\u0E01\u0E32\u0E23\u0E40\u0E02\u0E49\u0E32\u0E23\u0E2B\u0E31\u0E2A\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30 {0}
1014=\u0E25\u0E33\u0E14\u0E31\u0E1A\u0E44\u0E1A\u0E15\u0E4C\u0E17\u0E35\u0E48\u0E40\u0E02\u0E49\u0E32\u0E23\u0E2B\u0E31\u0E2A\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E16\u0E2D\u0E14\u0E23\u0E2B\u0E31\u0E2A\u0E40\u0E1B\u0E47\u0E19 {0}
1015=\u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E04\u0E33\u0E2A\u0E31\u0E48\u0E07 POST \u0E43\u0E19\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E2A\u0E37\u0E48\u0E2D {0}
1016=\u0E04\u0E2D\u0E19\u0E1F\u0E34\u0E40\u0E01\u0E2D\u0E40\u0E23\u0E0A\u0E31\u0E19\u0E02\u0E2D\u0E07\u0E40\u0E0B\u0E34\u0E23\u0E4C\u0E1F\u0E40\u0E25\u0E47\u0E15\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07: {0}
1017=\u0E41\u0E2D\u0E04\u0E40\u0E04\u0E32\u0E17\u0E4C\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01 {0}, \u0E2A\u0E04\u0E35\u0E21\u0E32\u0E1B\u0E31\u0E08\u0E08\u0E38\u0E1A\u0E31\u0E19\u0E04\u0E37\u0E2D {1}
