#
# Copyright (c) 2014, 2017, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=No se ha encontrado la cadena de l\u00EDmite al analizar el cuerpo multipart/form-data.
1002=No se ha encontrado el separador de l\u00EDnea al analizar el cuerpo multipart/form-data.
1003=Fallo en la conversi\u00F3n del juego de caracteres al analizar los argumentos de formato.
1004=Fallo en la conversi\u00F3n del juego de caracteres de la cadena de consulta.
1005=No se ha encontrado la cabecera del terminador de l\u00EDnea al analizar el cuerpo multipart/form-data.
1006=Se esperaba un nombre de campo pero no se ha encontrado al analizar el cuerpo multipart/form-data.
1007=Nombre de campo no v\u00E1lido en el cuerpo multipart/form-data.
1008=Falta la comilla de cierre en el nombre de archivo o campo en el cuerpo multipart/form-data.
1009=No se ha encontrado el separador de l\u00EDnea que marca el inicio del valor de campo en el cuerpo multipart/form-data.
1010=No se ha encontrado la cadena de l\u00EDmite que marca el final del valor de campo en el cuerpo multipart/form-data.
1011=Cadena de fecha/hora no v\u00E1lida {0} (el formato es aaaa-MM-dd''T''HH:mm:ss.SSS).
1012=Error de sintaxis de consulta.
1013=No se reconoce la codificaci\u00F3n de caracteres {0}.
1014=La secuencia de bytes codificada no se ha podido descodificar como {0}.
1015=No est\u00E1 permitido POST del tipo de medio {0}.
1016=Configuraci\u00F3n de servlet no v\u00E1lida: {0}.
1017=Cuenta desconocida {0}, el esquema actual es {1}.
1018=Una cadena nula o vac\u00EDa no es una fecha/hora v\u00E1lida.
1019=El documento tiene varias instancias de clave.
1020=No hay ning\u00FAn documento de entrada para la extracci\u00F3n/inserci\u00F3n de claves.
1021=La ruta de acceso para la extracci\u00F3n/inserci\u00F3n de claves no puede estar vac\u00EDa.
1022=No se ha cerrado correctamente la instancia del documento.
1023=La instancia del documento est\u00E1 vac\u00EDa o no es un objeto JSON.
1024=La clave extra\u00EDda no era una cadena o un n\u00FAmero.
1025=La clave introducida no coincide con la clave existente.
