#
# Copyright (c) 2014, 2019, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=\u015Eirul Boundary nu a fost g\u0103sit la interpretarea corpului multipart/form-data.
1002=Separatorul de linii pt. Boundary nu a fost g\u0103sit la interpretarea corpului multipart/form-data.
1003=Conversia setului de caractere a e\u015Fuat la interpretarea argumentelor formularului.
1004=Conversia setului de caractere a \u015Firului interog\u0103rii a e\u015Fuat.
1005=Terminatorul de linii pt. antet nu a fost g\u0103sit la interpretarea corpului multipart/form-data.
1006=Se a\u015Ftepta numele c\u00E2mpului, dar nu a fost g\u0103sit la interpretarea corpului multipart/form-data.
1007=Nume nevalid de c\u00E2mp \u00EEn corpul multipart/form-data.
1008=Lipsesc ghilimelele de \u00EEnchidere din numele c\u00E2mpului sau fi\u015Fierului din corpul multipart/form-data.
1009=Separatorul de linii ce marcheaz\u0103 \u00EEnceputul valorii c\u00E2mpului nu a fost g\u0103sit \u00EEn corpul multipart/form-data.
1010=\u015Eirul Boundary ce marcheaz\u0103 sf\u00E2r\u015Fitul valorii c\u00E2mpului nu a fost g\u0103sit \u00EEn corpul multipart/form-data.
1011=\u015Eir nevalid de tip Dat\u0103/Or\u0103, {0} (formatul este yyyy-MM-dd''T''HH:mm:ss.SSS).
1012=eroare \u00EEn sintaxa interog\u0103rii.
1013=Codificarea caracterelor, {0}, nu a fost recunoscut\u0103.
1014=Secven\u0163a de bytes codificat\u0103 nu a putut fi decodificat\u0103, deoarece {0}.
1015=Opera\u0163ia POST pt. tipul de media {0} nu este permis\u0103.
1016=Configura\u0163ie nevalid\u0103 a servletului: {0}.
1017=Cont necunoscut {0}; schema curent\u0103 este {1}.
1018=Un \u015Fir nul sau gol nu este o dat\u0103/or\u0103 valid\u0103.
1019=Documentul are mai multe instan\u0163e ale cheii.
1020=Niciun document de intrare pt. extragerea/inserarea cheii.
1021=Calea pt. extragerea/inserarea cheii nu poate fi necompletat\u0103.
1022=Instan\u0163a documentului nu este \u00EEnchis\u0103 corect.
1023=Instan\u0163a documentului este goal\u0103 sau nu este un obiect JSON.
1024=Cheia extras\u0103 nu a fost un \u015Fir sau un num\u0103r.
1025=Cheia inserat\u0103 nu corespunde cheii existente.
1026=S-a g\u0103sit un c\u00E2mp duplicat pt. etapa cheii {0}
1027=Conversie neimplementat\u0103 sau indisponibil\u0103 a formatului.
1028=Tipul de date JSON extins {0} nu este acceptat.
1029=Documentul de intrare pt. o conversie este corupt sau nu poate fi citit.
1030=Cheia nu poate fi extras\u0103 dac\u0103 exist\u0103 o \u00EEnlocuire \u00EEn a\u015Fteptare a cheii.
1031=Calea cheii nu este specificat\u0103 pentru conversie.
1032=Opera\u0163ia {0} nu este permis\u0103 pe {1}.
1033=Opera\u0163ia documentului a \u00EEnt\u00E2lnit o eroare: {0}.
1034=Tipul documentului {0} nu este acceptat.
