#
# Copyright (c) 2014, 2019, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in common/util exceptions

1001=Cha\u00EEne de limite introuvable lors de l'analyse du corps multipart/form-data.
1002=S\u00E9parateur de ligne pour la limite introuvable lors de l'analyse du corps multipart/form-data.
1003=Echec de la conversion de jeu de caract\u00E8res lors de l'analyse des arguments de formulaire.
1004=Echec de la conversion de jeu de caract\u00E8res de la cha\u00EEne de requ\u00EAte.
1005=Caract\u00E8re de fin de ligne pour l'en-t\u00EAte introuvable lors de l'analyse du corps multipart/form-data.
1006=Nom de champ attendu mais introuvable lors de l'analyse du corps multipart/form-data.
1007=Nom de champ non valide dans le corps multipart/form-data.
1008=Guillemet de fermeture manquant dans le nom de fichier ou de champ dans le corps multipart/form-data.
1009=S\u00E9parateur de ligne marquant le d\u00E9but de la valeur de champ introuvable dans le corps multipart/form-data.
1010=Cha\u00EEne de limite marquant la fin de la valeur de champ introuvable dans le corps multipart/form-data.
1011=Cha\u00EEne de date/d''heure {0} non valide (format : yyyy-MM-dd''T''HH:mm:ss.SSS).
1012=Erreur de syntaxe de requ\u00EAte.
1013=Encodage de caract\u00E8res {0} non reconnu.
1014=Impossible de d\u00E9coder la s\u00E9quence d''octets encod\u00E9e en tant que {0}.
1015=Op\u00E9ration POST du type de support {0} non autoris\u00E9e.
1016=Configuration de servlet non valide : {0}.
1017=Compte inconnu : {0}. Le sch\u00E9ma en cours est {1}.
1018=Une cha\u00EEne NULL ou vide n'est pas une date/heure valide.
1019=Le document comporte plusieurs instances de la cl\u00E9.
1020=Aucun document d'entr\u00E9e pour l'extraction/l'insertion de cl\u00E9.
1021=Le chemin pour l'extraction/l'insertion de cl\u00E9 ne peut pas \u00EAtre vide.
1022=L'instance de document n'est pas ferm\u00E9e correctement.
1023=L'instance de document est vide ou n'est pas un objet JSON.
1024=La cl\u00E9 extraite n'\u00E9tait pas une cha\u00EEne ou un nombre.
1025=La cl\u00E9 ins\u00E9r\u00E9e ne correspond pas \u00E0 la cl\u00E9 existante.
1026=Champ en double trouv\u00E9 pour l''\u00E9tape de cl\u00E9 {0}.
1027=Conversion de format non impl\u00E9ment\u00E9e ou non disponible.
1028=Le type de donn\u00E9es JSON \u00E9tendu {0} n''est pas pris en charge.
1029=Le document d'entr\u00E9e pour une conversion est endommag\u00E9 ou illisible.
1030=Impossible d'extraire la cl\u00E9 avec un remplacement de cl\u00E9 en attente.
1031=Chemin de cl\u00E9 non indiqu\u00E9 pour la conversion.
1032=Op\u00E9ration {0} non autoris\u00E9e sur {1}.
1033=Une erreur est survenue pendant l''op\u00E9ration du document : {0}.
1034=Le type de document {0} n''est pas pris en charge.
