#
# Copyright (c) 2014, 2023, Oracle and/or its affiliates.
#

# Messages used in SODA API exceptions

#
# User errors (2000 to 2499 error code range)
#
2000=\u05D4\u05D0\u05D5\u05E1\u05E3 {0} \u05D4\u05D5\u05D0 \u05DC\u05E7\u05E8\u05D9\u05D0\u05D4 \u05D1\u05DC\u05D1\u05D3, {1} \u05D0\u05E1\u05D5\u05E8.
2001=\u05DC\u05D0\u05D5\u05E1\u05E3 {0} \u05D0\u05D9\u05DF \u05D7\u05D5\u05EA\u05DE\u05EA \u05D6\u05DE\u05DF \u05D4\u05DE\u05E2\u05D9\u05D3\u05D4 \u05E2\u05DC \u05EA\u05D0\u05E8\u05D9\u05DA \u05D4\u05E9\u05D9\u05E0\u05D5\u05D9 \u05D4\u05D0\u05D7\u05E8\u05D5\u05DF.
2002=\u05EA\u05E0\u05D0\u05D9 \u05DE\u05E1\u05E0\u05DF \u05DC\u05D0 \u05EA\u05E7\u05E3.
2003=\u05D4\u05EA\u05D9\u05D0\u05D5\u05E8 \u05DC\u05D0 \u05EA\u05D5\u05D0\u05DD \u05DC\u05D0\u05D5\u05E1\u05E3 \u05D4\u05E7\u05D9\u05D9\u05DD.
2004=\u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8 {0} \u05DC\u05D0 \u05D9\u05DB\u05D5\u05DC \u05DC\u05D4\u05D9\u05D5\u05EA null.
2005=\u05E7\u05D1\u05D5\u05E6\u05EA {0} \u05E8\u05D9\u05E7\u05D4.
2006=\u05D4\u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8\u05D9\u05DD ''since'' \u05D5-''until'' \u05DC\u05D0 \u05D9\u05DB\u05D5\u05DC\u05D9\u05DD \u05E9\u05E0\u05D9\u05D4\u05DD \u05DC\u05D4\u05D9\u05D5\u05EA null.
2007=\u05DC\u05D0\u05D5\u05E1\u05E3 {0} \u05D0\u05D9\u05DF \u05D2\u05E8\u05E1\u05D4.
2008=\u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8 {0} \u05E6\u05E8\u05D9\u05DA \u05DC\u05D4\u05D9\u05D5\u05EA \u05D7\u05D9\u05D5\u05D1\u05D9.
2009=\u05D4\u05DE\u05E1\u05E4\u05E8 \u05D4\u05DB\u05D5\u05DC\u05DC \u05E9\u05DC \u05D4\u05DE\u05E4\u05EA\u05D7\u05D5\u05EA \u05D4\u05DE\u05E9\u05EA\u05DE\u05E9\u05D9\u05DD \u05D1\u05E9\u05D9\u05D8\u05D5\u05EA key(), keys() \u05D0\u05D5 filter() \u05D4\u05D5\u05D0 {0}, \u05E9\u05D7\u05D5\u05E8\u05D2 \u05DE\u05D4\u05D2\u05D1\u05D5\u05DC \u05D4\u05DE\u05E8\u05D1\u05D9 {1}.
2010=\u05D4\u05D0\u05D9\u05D8\u05E8\u05D8\u05D5\u05E8 {0} \u05D4\u05D7\u05D6\u05D9\u05E8 null, \u05DC\u05D0\u05D7\u05E8 \u05D4\u05D7\u05D6\u05E8\u05EA {1} \u05DE\u05E1\u05DE\u05DB\u05D9\u05DD.
2011=\u05E2\u05E8\u05DA \u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8 \u05DC\u05D0 \u05EA\u05E7\u05E3 "{0}".
2012=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05D2\u05D3\u05D9\u05E8 \u05D0\u05D5\u05E8\u05DA \u05DE\u05E8\u05D1\u05D9 \u05DC\u05E1\u05D5\u05D2\u05D9 LOB \u05D0\u05D5 \u05E1\u05D5\u05D2 JSON.
2013=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05E9\u05EA\u05DE\u05E9 \u05D1\u05D4\u05D2\u05D3\u05E8\u05D5\u05EA SecureFile LOB \u05DB\u05D0\u05E9\u05E8 \u05E1\u05D5\u05D2 \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05EA\u05D5\u05DB\u05DF \u05D4\u05D5\u05D0 "{0}"
2014=\u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05D2\u05D3\u05D9\u05E8 \u05D0\u05EA \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D4\u05E2\u05DE\u05D5\u05D3\u05D4 \u05D4\u05D0\u05D7\u05E8\u05D5\u05DF \u05E9\u05E2\u05D5\u05D3\u05DB\u05DF \u05E8\u05E7 \u05DB\u05D0\u05E9\u05E8 \u05DE\u05D2\u05D3\u05D9\u05E8\u05D9\u05DD \u05D0\u05EA \u05E9\u05DD \u05D4\u05E2\u05DE\u05D5\u05D3\u05D4 \u05D4\u05D0\u05D7\u05E8\u05D5\u05DF \u05E9\u05E2\u05D5\u05D3\u05DB\u05DF.
2015=\u05D0\u05DD \u05E9\u05D9\u05D8\u05EA \u05D4\u05D4\u05E7\u05E6\u05D0\u05D4 \u05D4\u05D9\u05D0 "SEQUENCE", \u05D9\u05E9 \u05DC\u05E6\u05D9\u05D9\u05DF \u05E9\u05DD \u05E8\u05E6\u05E3 \u05E2\u05DE\u05D5\u05D3\u05D5\u05EA \u05DE\u05E4\u05EA\u05D7.
2016=\u05E9\u05D9\u05D8\u05EA \u05D4\u05D2\u05E8\u05E1\u05D4 \u05E6\u05D5\u05D9\u05E0\u05D4 \u05D0\u05D1\u05DC \u05E9\u05DD \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05D2\u05E8\u05E1\u05D4 \u05DC\u05D0 \u05E6\u05D5\u05D9\u05DF.
2017=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05E9\u05EA\u05DE\u05E9 \u05D1\u05E1\u05D5\u05D2 \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05DE\u05E4\u05EA\u05D7 \u05E9\u05E6\u05D5\u05D9\u05DF \u05E2\u05DD \u05D0\u05D5\u05E8\u05DA \u05DE\u05E8\u05D1\u05D9.
2018=\u05DB\u05D0\u05E9\u05E8 \u05DE\u05E9\u05EA\u05DE\u05E9\u05D9\u05DD \u05D1-GUID \u05D0\u05D5 \u05D1-UUID \u05DB\u05D3\u05D9 \u05DC\u05D4\u05E7\u05E6\u05D5\u05EA \u05E2\u05E8\u05DB\u05D9 \u05DE\u05E4\u05EA\u05D7 \u05DC\u05E1\u05D5\u05D2 \u05EA\u05D5, \u05D0\u05D5\u05E8\u05DA \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05DE\u05E4\u05EA\u05D7 \u05E6\u05E8\u05D9\u05DA \u05DC\u05D4\u05D9\u05D5\u05EA 32 \u05D1\u05D9\u05D9\u05D8\u05D9\u05DD \u05D5\u05DE\u05E2\u05DC\u05D4.
2019=\u05DC\u05D0\u05D5\u05E1\u05E3 \u05DC\u05D0 \u05D9\u05DB\u05D5\u05DC\u05D4 \u05DC\u05D4\u05D9\u05D5\u05EA \u05E2\u05DE\u05D5\u05D3\u05EA \u05E1\u05D5\u05D2 \u05DE\u05D3\u05D9\u05D4 \u05D0\u05DC\u05D0 \u05D0\u05DD \u05DB\u05DF \u05E1\u05D5\u05D2 \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05EA\u05D5\u05DB\u05DF \u05D4\u05D5\u05D0 BLOB.
2020=\u05E1\u05D5\u05D2 \u05D4\u05DE\u05D3\u05D9\u05D4 \u05E9\u05DC \u05D4\u05DE\u05E1\u05DE\u05DA \u05D0\u05D9\u05E0\u05D5 "application/json". getContentAsString() \u05E0\u05EA\u05DE\u05DA \u05E8\u05E7 \u05DC\u05DE\u05E1\u05DE\u05DB\u05D9 JSON.
2021=\u05E7\u05D1\u05D5\u05E6\u05EA {0} \u05DB\u05D5\u05DC\u05DC\u05EA null.
2022=\u05D9\u05E9 \u05DC\u05E6\u05D9\u05D9\u05DF \u05D0\u05EA \u05D4\u05DE\u05E4\u05EA\u05D7 \u05DC\u05DE\u05E1\u05DE\u05DA \u05DC\u05D4\u05D7\u05DC\u05E4\u05D4 \u05D1\u05D0\u05DE\u05E6\u05E2\u05D5\u05EA \u05D4\u05E9\u05D9\u05D8\u05D4 key().
2023=\u05D0\u05E8\u05D2\u05D5\u05DE\u05E0\u05D8 {0} \u05D0\u05D9\u05E0\u05D5 \u05D9\u05DB\u05D5\u05DC \u05DC\u05D4\u05D9\u05D5\u05EA \u05E9\u05DC\u05D9\u05DC\u05D9.
2024=\u05DE\u05E4\u05E8\u05D8 \u05D9\u05E6\u05D9\u05E8\u05EA \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05DC\u05D0 \u05EA\u05E7\u05E3.
2025=\u05DE\u05E4\u05E8\u05D8 \u05DE\u05D7\u05D9\u05E7\u05EA \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05DC\u05D0 \u05EA\u05E7\u05E3.
2026=\u05DC\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05DF \u05EA\u05D5\u05DB\u05DF \u05D0\u05D5 \u05E9\u05D4\u05EA\u05D5\u05DB\u05DF \u05E9\u05DC\u05D5 \u05E8\u05D9\u05E7.
2027=\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05E0\u05D5 JSON \u05EA\u05E7\u05E3.
2028=\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05E0\u05D5 JSON \u05EA\u05E7\u05E3, \u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E7\u05D5\u05D1\u05E2 \u05DE\u05D4\u05D5 \u05D4\u05E7\u05D9\u05D3\u05D5\u05D3.
2029=\u05D0\u05D9\u05E8\u05E2 IOException \u05D1\u05E2\u05EA \u05E2\u05D9\u05D1\u05D5\u05D3 \u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3.
2030=\u05E2\u05E8\u05DA \u05DC\u05D0 \u05EA\u05E7\u05E3 \u05DC-"{0}" \u05D1\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3.
2031=\u05D4\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3 \u05E6\u05E8\u05D9\u05DA \u05DC\u05D4\u05D9\u05D5\u05EA \u05D0\u05D5\u05D1\u05D9\u05D9\u05E7\u05D8 JSON.
2032=\u05DE\u05E4\u05EA\u05D7 \u05D4\u05D0\u05D5\u05D1\u05D9\u05D9\u05E7\u05D8 "{0}" \u05D0\u05D9\u05E0\u05D5 \u05E6\u05E4\u05D5\u05D9 \u05D1\u05DE\u05D8\u05D0\u05D3\u05D8\u05D4 \u05E9\u05DC \u05D4\u05D0\u05D5\u05E1\u05E3.
2033=\u05D4\u05D0\u05D5\u05E1\u05E3 \u05DC\u05D0 \u05DE\u05D5\u05D2\u05D3\u05E8 \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7\u05D5\u05EA \u05DE\u05D5\u05E7\u05E6\u05D9\u05DD \u05DC\u05DC\u05E7\u05D5\u05D7, \u05D0\u05DA \u05DC\u05DE\u05E1\u05DE\u05DA \u05D4\u05E7\u05DC\u05D8 \u05D9\u05E9 \u05DE\u05E4\u05EA\u05D7.
2034=\u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05E0\u05D5 \u05DE\u05D5\u05D2\u05D3\u05E8 \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7 \u05DE\u05D5\u05E7\u05E6\u05D4 \u05DC\u05DC\u05E7\u05D5\u05D7, \u05D0\u05D1\u05DC \u05D4\u05D0\u05D9\u05D8\u05E8\u05D8\u05D5\u05E8 {0} \u05DE\u05D7\u05D6\u05D9\u05E8 \u05DE\u05E1\u05DE\u05DA \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7, \u05DC\u05D0\u05D7\u05E8 \u05D4\u05D7\u05D6\u05E8\u05EA {1} \u05DE\u05E1\u05DE\u05DB\u05D9\u05DD.
2035=getCurrentSchema() \u05E9\u05D4\u05D5\u05E4\u05E2\u05DC \u05D1\u05D7\u05D9\u05D1\u05D5\u05E8 JDBC \u05E9\u05E1\u05D5\u05E4\u05E7 \u05D4\u05D7\u05D6\u05D9\u05E8 null.
2036=\u05DE\u05E4\u05E8\u05D8 projection \u05DC\u05D0 \u05EA\u05E7\u05E3.
2037=\u05D4\u05E2\u05E8\u05DA {0} \u05D0\u05D9\u05E0\u05D5 \u05E1\u05D5\u05D2 \u05DE\u05E4\u05EA\u05D7 \u05EA\u05E7\u05E3 {1}.
2038=\u05D1\u05D1\u05E7\u05E9\u05EA \u05D4\u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D9\u05E9 \u05D9\u05D5\u05EA\u05E8 \u05DE-{0} \u05E2\u05DE\u05D5\u05D3\u05D5\u05EA.
2039=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D9\u05E6\u05D5\u05E8 \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D1\u05EA\u05D5\u05DB\u05DF \u05DE\u05D5\u05E6\u05E4\u05DF, \u05D4\u05DE\u05D9\u05E4\u05EA\u05D5\u05D7 \u05DE\u05D5\u05EA\u05E8 \u05E8\u05E7 \u05D0\u05DD \u05D4\u05E6\u05E4\u05E0\u05EA \u05E2\u05DE\u05D5\u05D3\u05EA \u05D4\u05EA\u05D5\u05DB\u05DF \u05DE\u05D5\u05D2\u05D3\u05E8 \u05DB-NONE.
2040=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E7\u05E8\u05D5\u05D0 \u05DC-next() \u05D1\u05E1\u05DE\u05DF \u05E1\u05D2\u05D5\u05E8.
2041=\u05D0\u05D9\u05E8\u05E2\u05D4 \u05E9\u05D2\u05D9\u05D0\u05D4 \u05D1\u05E2\u05EA \u05E0\u05D9\u05E1\u05D9\u05D5\u05DF \u05DC\u05E9\u05D7\u05E8\u05E8 \u05D0\u05EA \u05D4\u05D0\u05D5\u05E1\u05E3. \u05D5\u05D3\u05D0 \u05E9\u05DB\u05DC \u05D4\u05DB\u05EA\u05D9\u05D1\u05D5\u05EA  \u05D4\u05E4\u05EA\u05D5\u05D7\u05D5\u05EA \u05DC\u05D0\u05D5\u05E1\u05E3 \u05DE\u05D1\u05D5\u05E6\u05E2\u05D5\u05EA.
2042=\u05DC\u05E4\u05E2\u05D5\u05DC\u05D4 \u05D6\u05D5 \u05E0\u05D3\u05E8\u05E9\u05EA SODA \u05DB\u05D3\u05D9 \u05DC\u05D4\u05E4\u05E2\u05D9\u05DC \u05EA\u05E0\u05D5\u05E2\u05D4, \u05D0\u05DA \u05D9\u05E9 \u05E9\u05D2\u05D9\u05D0\u05D4 \u05D1\u05D4\u05E9\u05D1\u05EA\u05EA \u05D1\u05D9\u05E6\u05D5\u05E2 auto-commit \u05D0\u05D5\u05D8\u05D5\u05DE\u05D8\u05D9 \u05E9\u05DC \u05D7\u05D9\u05D1\u05D5\u05E8 JDBC.
2043=\u05DC\u05DE\u05E1\u05DE\u05DA \u05D4\u05DE\u05E4\u05E8\u05D8 {0} \u05D0\u05D9\u05DF \u05EA\u05D5\u05DB\u05DF \u05D0\u05D5 \u05E9\u05D4\u05EA\u05D5\u05DB\u05DF \u05E9\u05DC\u05D5 \u05E8\u05D9\u05E7.
2045=\u05DE\u05E4\u05E8\u05D8 \u05D4\u05D9\u05D8\u05DC \u05DC\u05D0 \u05D0\u05DE\u05D5\u05E8 \u05DC\u05D4\u05DB\u05D9\u05DC \u05EA\u05E2\u05E8\u05D5\u05D1\u05EA \u05E9\u05DC \u05DB\u05DC\u05DC\u05D9 \u05D4\u05DB\u05DC\u05DC\u05D4 \u05D5\u05DB\u05DC\u05DC\u05D9 \u05D0\u05D9-\u05D4\u05DB\u05DC\u05DC\u05D4.
2046=\u05E0\u05EA\u05D9\u05D1 \u05DC\u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D0\u05D5 \u05DC'\u05E1\u05D9\u05D3\u05D5\u05E8 \u05DC\u05E4\u05D9 \u05EA\u05E0\u05D0\u05D9' \u05D0\u05D9\u05E0\u05D5 \u05D9\u05DB\u05D5\u05DC \u05DC\u05D4\u05DB\u05D9\u05DC \u05E9\u05DC\u05D1\u05D9 \u05DE\u05E2\u05E8\u05DA.
2047=\u05D4\u05D7\u05D9\u05D1\u05D5\u05E8 \u05E6\u05E8\u05D9\u05DA \u05DC\u05D4\u05D9\u05D5\u05EA OracleConnection \u05D0\u05D5 wrapper \u05DC-OracleConnection.
2048=\u05E4\u05E8\u05DE\u05D8\u05E8 \u05D4\u05E9\u05E4\u05D4 \u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA \u05E2\u05DD \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D8\u05E7\u05E1\u05D8 \u05E9\u05DC 12.1.0.2 Oracle Database.
2049=\u05D1\u05E8\u05D9\u05E8\u05EA \u05D4\u05DE\u05D7\u05D3\u05DC \u05DC\u05DE\u05E6\u05D1 \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05E4\u05D5\u05E0\u05E7\u05E6\u05D9\u05D5\u05E0\u05DC\u05D9 \u05DE\u05E1\u05EA\u05DE\u05DA \u05E2\u05DC \u05E4\u05E1\u05D5\u05E7 json_value "null on empty" \u05E0\u05EA\u05DE\u05DA, \u05E9\u05DE\u05EA\u05D7\u05D9\u05DC \u05D1\u05D2\u05E8\u05E1\u05D4 12.2.0.1 Oracle Database.  \u05DE\u05E6\u05D1\u05D9 "scalarRequired" \u05D5-"lax" \u05E0\u05EA\u05DE\u05DB\u05D9\u05DD \u05D1-12.1.0.2. \u05D4\u05E2\u05E8\u05D4: \u05D0\u05D9\u05E0\u05D3\u05E7\u05E1\u05D9\u05DD \u05DE\u05E1\u05D5\u05D2"lax" \u05D0\u05D9\u05E0\u05DD \u05DE\u05E9\u05DE\u05E9\u05D9\u05DD QBEs, \u05D5\u05DC\u05DB\u05DF \u05DE\u05D5\u05DE\u05DC\u05E5 "scalarRequired".
2050=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E6\u05D9\u05D9\u05DF "{0}"\u05DC\u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D8\u05E7\u05E1\u05D8 12.1.0.2 Oracle Database.
2051=\u05D4\u05E4\u05E2\u05D5\u05DC\u05D4 "{0}" \u05DE\u05D7\u05D9\u05D9\u05D1\u05EA \u05E0\u05D9\u05D4\u05D5\u05DC \u05D8\u05E8\u05E0\u05D6\u05D0\u05E7\u05E6\u05D9\u05D4 \u05DB\u05D0\u05E9\u05E8 \u05D4\u05D7\u05D9\u05D1\u05D5\u05E8 \u05D4\u05D5\u05D0 \u05D1\u05DE\u05E6\u05D1 commit \u05D0\u05D5\u05D8\u05D5\u05DE\u05D8\u05D9, \u05D0\u05D1\u05DC \u05D9\u05E9 \u05DC\u05D4\u05D9\u05DE\u05E0\u05E2 \u05DE\u05D4\u05D2\u05D3\u05E8\u05EA \u05D3\u05D2\u05DC "avoidTxnManagement"\u05DB-true \u05D1\u05DE\u05D5\u05E4\u05E2 OracleDatabase. \u05DB\u05D3\u05D9 \u05DC\u05D1\u05E6\u05E2 \u05D0\u05EA \u05D4\u05E4\u05E2\u05D5\u05DC\u05D4 \u05D9\u05E9 \u05DC\u05D4\u05E9\u05D1\u05D9\u05EA \u05DE\u05E6\u05D1 commit \u05D0\u05D5\u05D8\u05D5\u05DE\u05D8\u05D9.
2052=\u05E0\u05D9\u05EA\u05DF \u05DC\u05E6\u05D9\u05D9\u05DF keyLike() \u05E8\u05E7 \u05DC\u05D0\u05D5\u05E1\u05E3 \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7\u05D5\u05EA \u05E9\u05D4\u05E7\u05E6\u05D4 \u05D4\u05DC\u05E7\u05D5\u05D7 \u05D5\u05E1\u05D5\u05D2 \u05E2\u05DE\u05D5\u05D3\u05EA \u05DE\u05E4\u05EA\u05D7 varchar2.
2053=\u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D1\u05E9\u05DD \u05E9\u05E6\u05D5\u05D9\u05DF \u05DB\u05D1\u05E8 \u05E7\u05D9\u05D9\u05DD \u05D1\u05E1\u05DB\u05DE\u05D4.
2054=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05D2\u05D3\u05D9\u05E8 \u05D3\u05D9\u05DC\u05D5\u05D2 \u05D0\u05D5 \u05D4\u05D2\u05D1\u05DC\u05D4 \u05DC\u05E4\u05E2\u05D5\u05DC\u05EA \u05E1\u05E4\u05D9\u05E8\u05D4.
2055=\u05D4\u05E4\u05E8\u05DE\u05D8\u05E8 textIndex121WithLang\u05E9\u05D4\u05D5\u05D2\u05D3\u05E8 \u05DB-true \u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA \u05D1\u05D2\u05E8\u05E1\u05D0\u05D5\u05EA \u05DE\u05E1\u05D3 \u05E0\u05EA\u05D5\u05E0\u05D9\u05DD \u05D4\u05DE\u05D0\u05D5\u05D7\u05E8\u05D5\u05EA \u05DE-12.2.
2056=\u05DC\u05DE\u05E4\u05E8\u05D8 \u05D4\u05D9\u05D8\u05DC \u05D0\u05E1\u05D5\u05E8 \u05DC\u05D4\u05DB\u05D9\u05DC \u05E9\u05DC\u05D1\u05D9 \u05DE\u05E2\u05E8\u05DA.
2057=\u05D1\u05DE\u05E4\u05E8\u05D8 \u05DE\u05E2\u05E8\u05DA, \u05E0\u05EA\u05D9\u05D1\u05D9\u05DD \u05D0\u05D9\u05E0\u05DD \u05D9\u05DB\u05D5\u05DC\u05D9\u05DD \u05DC\u05D7\u05DC\u05D5\u05E7 \u05E7\u05D9\u05D3\u05D5\u05DE\u05EA \u05DE\u05E9\u05D5\u05EA\u05E4\u05EA.
2058=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E6\u05D9\u05D9\u05DF \u05D0\u05EA \u05D4\u05E9\u05D9\u05D8\u05D4 {0} \u05D1\u05E6\u05DE\u05D9\u05D3\u05D5\u05EA \u05DC\u05E9\u05D9\u05D8\u05D4 {1}.
2059=\u05D0\u05D9\u05E8\u05E2\u05D4 \u05E9\u05D2\u05D9\u05D0\u05D4 \u05D1\u05E2\u05EA \u05D4\u05DE\u05E8\u05EA \u05EA\u05D5\u05DB\u05DF JSON \u05E9\u05DC \u05DE\u05E1\u05DE\u05DA \u05D4\u05E7\u05DC\u05D8 \u05DC\u05D1\u05D9\u05E0\u05D0\u05E8\u05D9. \u05D5\u05D3\u05D0 \u05E9\u05EA\u05D5\u05DB\u05DF \u05DE\u05E1\u05DE\u05DA \u05D4\u05E7\u05DC\u05D8 \u05D4\u05D5\u05D0 JSON \u05EA\u05E7\u05E3.
2060=\u05D0\u05D9\u05E8\u05E2\u05D4 \u05E9\u05D2\u05D9\u05D0\u05D4 \u05D1\u05E2\u05EA \u05D4\u05DE\u05E8\u05EA JSON \u05D1\u05D9\u05E0\u05D0\u05E8\u05D9 \u05DC-JSON \u05E9\u05DC \u05D8\u05E7\u05E1\u05D8.
2061=\u05D4\u05E0\u05EA\u05D9\u05D1 \u05E9\u05E6\u05D5\u05D9\u05DF \u05DC\u05DE\u05E4\u05EA\u05D7 \u05D4\u05DE\u05E1\u05DE\u05DA \u05D0\u05D9\u05E0\u05D5 \u05EA\u05E7\u05E3.
2062=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E9\u05DC\u05D5\u05E3 \u05D0\u05EA \u05D4\u05E0\u05EA\u05D9\u05D1 \u05DE\u05D4\u05DE\u05E1\u05DE\u05DA.
2063=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05DB\u05E0\u05D9\u05E1 \u05D0\u05EA \u05D4\u05E0\u05EA\u05D9\u05D1 \u05DC\u05DE\u05E1\u05DE\u05DA.
2064=\u05D0\u05D9\u05DF \u05DC\u05E6\u05D9\u05D9\u05DF \u05D1\u05D3\u05D9\u05E7\u05EA \u05EA\u05E7\u05D9\u05E0\u05D5\u05EA \u05DB\u05D0\u05E9\u05E8 contentColumn.sqlType \u05D4\u05D5\u05D0 JSON.
2065=\u05E1\u05D5\u05D2 \u05DC\u05D0 \u05E0\u05EA\u05DE\u05DA: {0}
2066=\u05D4\u05E8\u05DE\u05D6 {0} \u05D0\u05D9\u05E0\u05D5 \u05DE\u05E1\u05D5\u05D2 \u05DE\u05D7\u05E8\u05D5\u05D6\u05EA \u05D0\u05D5 \u05E9\u05D0\u05D9\u05E0\u05D5 \u05DE\u05DB\u05D9\u05DC \u05D0\u05EA /* \u05D0\u05D5 */.
2067=\u05D4\u05D0\u05D5\u05E1\u05E3 \u05DE\u05E9\u05EA\u05DE\u05E9 \u05D1\u05D0\u05D7\u05E1\u05D5\u05DF OSON, \u05D4\u05D3\u05D5\u05E8\u05E9 \u05E6\u05E0\u05E6\u05E0\u05EA JDBC 19.6 \u05D5\u05DE\u05E2\u05DC\u05D4.
2068=\u05D4\u05D0\u05D5\u05E1\u05E3 \u05DE\u05E9\u05EA\u05DE\u05E9 \u05D1\u05D0\u05D7\u05E1\u05D5\u05DF \u05DE\u05E1\u05D5\u05D2 JSON, \u05E9\u05D3\u05D5\u05E8\u05E9 \u05E6\u05E0\u05E6\u05E0\u05EA JDBC 21.1 \u05D5\u05DE\u05E2\u05DC\u05D4.
2069=\u05E1\u05D9\u05DC\u05D5\u05E7 \u05D5\u05D4\u05E1\u05E8\u05D4 \u05E9\u05DC \u05D0\u05D5\u05E1\u05E3 \u05DE\u05DE\u05D5\u05E4\u05D4 \u05E0\u05EA\u05DE\u05DB\u05D9\u05DD \u05E8\u05E7 \u05D1\u05DE\u05D4\u05D3\u05D5\u05E8\u05EA Oracle Database 21c \u05D5\u05DE\u05E2\u05DC\u05D4.
2070=\u05D2\u05D5\u05D3\u05DC \u05D0\u05E6\u05D5\u05D5\u05D4 {0} \u05D0\u05D9\u05E0\u05D5 \u05DE\u05E1\u05D5\u05D2 \u05DE\u05E1\u05E4\u05E8 \u05E9\u05DC\u05DD.
2071=\u05D4\u05E0\u05EA\u05D9\u05D1 \u05E9\u05E6\u05D5\u05D9\u05DF \u05DC\u05DE\u05E4\u05EA\u05D7 \u05D4\u05DE\u05E1\u05DE\u05DA \u05D0\u05D9\u05E0\u05D5 \u05EA\u05E7\u05E3.
2072=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05E9\u05DC\u05D5\u05E3 \u05D0\u05EA \u05D4\u05E0\u05EA\u05D9\u05D1 \u05DE\u05D4\u05DE\u05E1\u05DE\u05DA.
2073=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D4\u05DB\u05E0\u05D9\u05E1 \u05D0\u05EA \u05D4\u05E0\u05EA\u05D9\u05D1 \u05DC\u05DE\u05E1\u05DE\u05DA.
2074=\u05E0\u05D3\u05E8\u05E9\u05EA \u05E6\u05E0\u05E6\u05E0\u05EA JDBC 19.6 \u05D5\u05DE\u05E2\u05DC\u05D4 \u05D1\u05E9\u05D1\u05D9\u05DC \u05E4\u05E2\u05D5\u05DC\u05D4 \u05D6\u05D5.
2075=\u05E0\u05D3\u05E8\u05E9\u05EA \u05E6\u05E0\u05E6\u05E0\u05EA JDBC 21.1 \u05D5\u05DE\u05E2\u05DC\u05D4 \u05D1\u05E9\u05D1\u05D9\u05DC \u05E4\u05E2\u05D5\u05DC\u05D4 \u05D6\u05D5.
2076=\u05E4\u05E8\u05DE\u05D8\u05E8 \u05D4\u05E4\u05D5\u05E8\u05DE\u05D8 \u05D0\u05D9\u05E0\u05D5 \u05DE\u05E1\u05D5\u05D2 \u05DE\u05D7\u05E8\u05D5\u05D6\u05EA \u05D0\u05D5 \u05DE\u05D5\u05D2\u05D3\u05E8 \u05DC\u05E2\u05E8\u05DA \u05E9\u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA.
2077=\u05DC\u05D0 \u05E0\u05D9\u05EA\u05DF \u05DC\u05E6\u05D9\u05D9\u05DF eJSON \u05D0\u05DD \u05E2\u05DE\u05D5\u05D3\u05EA \u05EA\u05D5\u05DB\u05DF \u05D4\u05D0\u05D5\u05E1\u05E3 \u05D0\u05D9\u05E0\u05D4 \u05DE\u05D0\u05D7\u05E1\u05E0\u05EA JSON \u05D1\u05D9\u05E0\u05D0\u05E8\u05D9.
2078=\u05DC\u05D0 \u05E0\u05D9\u05EA\u05DF \u05DC\u05E6\u05D9\u05D9\u05DF eJSON \u05D0\u05DD \u05DC\u05DE\u05E1\u05DE\u05DA \u05D9\u05E9 \u05EA\u05D5\u05DB\u05DF \u05D1\u05D9\u05E0\u05D0\u05E8\u05D9.
2079=eJSON \u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA \u05D1\u05E9\u05D1\u05D9\u05DC \u05E4\u05E2\u05D5\u05DC\u05D4 \u05D6\u05D5.
2080=\u05DE\u05E1\u05DE\u05DA eJSON \u05D7\u05D9\u05D9\u05D1 \u05DC\u05D4\u05D9\u05D5\u05EA \u05D0\u05D5\u05D1\u05D9\u05D9\u05E7\u05D8 JSON.
2081=\u05DC\u05D0 \u05E0\u05D9\u05EA\u05DF \u05DC\u05D4\u05DE\u05D9\u05E8 \u05D0\u05EA \u05D4\u05DE\u05D7\u05E8\u05D5\u05D6\u05EA \u05E9\u05E1\u05D5\u05E4\u05E7\u05D4 {0} \u05DC\u05DE\u05E1\u05E4\u05E8.
2082=\u05E2\u05E8\u05DA \u05DC\u05D0 \u05EA\u05E7\u05E3 \u05D1-eJSON \u05D1\u05E9\u05D1\u05D9\u05DC field _id \u05DE\u05E1\u05D5\u05D2 "{0}".
2083=\u05DE\u05E4\u05EA\u05D7 \u05DC\u05D0 \u05EA\u05E7\u05E3 "{0}" \u05D1-eJSON \u05EA\u05D7\u05EA \u05D4\u05E9\u05D3\u05D4 _id.
2084=\u05E2\u05E8\u05DA _id \u05DC\u05D0 \u05EA\u05E7\u05E3 \u05D1-eJSON.
2089=\u05E4\u05E1\u05D5\u05E7\u05D9\u05D5\u05EA \u05D7\u05D9\u05E4\u05D5\u05E9 \u05DE\u05E8\u05D7\u05D1\u05D9 \u05D5\u05D8\u05E7\u05E1\u05D8 \u05D0\u05D9\u05E0\u05DD \u05E0\u05EA\u05DE\u05DB\u05D9\u05DD \u05D1\u05E9\u05D1\u05D9\u05DC \u05E4\u05E2\u05D5\u05DC\u05D4 \u05D6\u05D5.
2090=\u05E4\u05E1\u05D5\u05E7\u05D9\u05EA $id \u05D0\u05D9\u05E0\u05D4 \u05E0\u05EA\u05DE\u05DB\u05EA \u05D1\u05E9\u05D1\u05D9\u05DC \u05E4\u05E2\u05D5\u05DC\u05D4 \u05D6\u05D5.
2091=\u05DC\u05E0\u05EA\u05D9\u05D1 \u05E0\u05E4\u05E8\u05D3 \u05D0\u05E1\u05D5\u05E8 \u05DC\u05D4\u05DB\u05D9\u05DC \u05E9\u05DC\u05D1\u05D9 \u05DE\u05E2\u05E8\u05DA.
2092=\u05D4\u05E0\u05EA\u05D9\u05D1 \u05E9\u05E6\u05D5\u05D9\u05DF \u05E8\u05D9\u05E7 \u05D0\u05D5 null.
2093=\u05DE\u05E4\u05E8\u05D8 \u05DE\u05E1\u05E0\u05DF \u05D0\u05D9\u05E0\u05D5 \u05D0\u05D5\u05D1\u05D9\u05D9\u05E7\u05D8 JSON \u05EA\u05E7\u05E3.
2094=DistinctStrict \u05E0\u05EA\u05DE\u05DA \u05E2\u05DD Oracle Database 23c \u05D5\u05DE\u05E2\u05DC\u05D4.
2095=\u05DE\u05D3\u05D3\u05D9 TTL \u05E0\u05EA\u05DE\u05DB\u05D9\u05DD \u05D1\u05DE\u05D4\u05D3\u05D5\u05E8\u05D4 19c (\u05D5\u05DE\u05E2\u05DC\u05D4) \u05E9\u05DC Oracle Database.


#
# Internal errors  (2500 to 2999 error code range)
#
2500=\u05DC\u05D0\u05D5\u05E1\u05E3 {0} \u05DC\u05D0 \u05D9\u05DB\u05D5\u05DC \u05DC\u05D4\u05D9\u05D5\u05EA \u05EA\u05D5\u05DB\u05DF \u05D1\u05D9\u05E0\u05E8\u05D9 \u05D1\u05E1\u05D5\u05D2 \u05D4\u05E2\u05DE\u05D5\u05D3\u05D4 {1}.
2501=\u05D4\u05D0\u05D5\u05E1\u05E3 {0} \u05DE\u05E9\u05EA\u05DE\u05E9 \u05D1\u05E0\u05D9\u05D4\u05D5\u05DC \u05D2\u05E8\u05E1\u05D0\u05D5\u05EA {1}, \u05DB\u05EA\u05D9\u05D1\u05D5\u05EA \u05D1\u05DE\u05E6\u05D1 \u05D6\u05E8\u05D9\u05DE\u05D4 \u05D0\u05E1\u05D5\u05E8\u05D5\u05EA.
2502=\u05E9\u05DE\u05D9\u05E8\u05EA \u05DE\u05E1\u05DE\u05DA \u05D1\u05D0\u05D5\u05E1\u05E3 {0} \u05E0\u05DB\u05E9\u05DC\u05D4.
2503=\u05D4\u05D5\u05E1\u05E4\u05EA \u05DE\u05E1\u05DE\u05DA \u05DC\u05D0\u05D5\u05E1\u05E3 {0} \u05E0\u05DB\u05E9\u05DC\u05D4.
2504=\u05D0\u05D9 \u05D0\u05E4\u05E9\u05E8 \u05DC\u05D9\u05E6\u05D5\u05E8 \u05DE\u05E4\u05EA\u05D7 \u05DE\u05D1\u05D5\u05E1\u05E1 UUID.
2505=\u05DE\u05E1\u05DE\u05DA \u05E2\u05DD \u05D4\u05DE\u05E4\u05EA\u05D7 {0} \u05D4\u05D5\u05D0 \u05D1\u05D2\u05D5\u05D3\u05DC {1}, \u05E9\u05D7\u05D5\u05E8\u05D2 \u05DE\u05D4\u05DE\u05D2\u05D1\u05DC\u05D4 \u05E9\u05DC 2GB.
2506=\u05D4\u05E7\u05E6\u05D0\u05EA \u05DE\u05E4\u05EA\u05D7 IDENTITY \u05DE\u05D7\u05D9\u05D9\u05D1 \u05EA\u05DE\u05D9\u05DB\u05EA RETURNING \u05D1-SQL.
2507=\u05E9\u05D2\u05D9\u05D0\u05D4 \u05D1\u05D4\u05E9\u05D2\u05EA \u05D2\u05E8\u05E1\u05EA \u05DE\u05E1\u05D3 \u05E0\u05EA\u05D5\u05E0\u05D9\u05DD.

#
# Unimplemented errors (3000 to 3499 error code range)
#
3000=\u05D4\u05E7\u05D9\u05E6\u05D5\u05E5 \u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA, \u05D4\u05D0\u05D5\u05E1\u05E3 {0} \u05D0\u05D9\u05E0\u05D5 \u05DE\u05D1\u05D5\u05E1\u05E1 \u05D8\u05D1\u05DC\u05D4.
3001=\u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D7\u05D9\u05E4\u05D5\u05E9 JSON \u05D0\u05D9\u05E0\u05D5 \u05DE\u05DE\u05D5\u05DE\u05E9 \u05DC\u05E2\u05DE\u05D5\u05D3\u05D5\u05EA \u05EA\u05D5\u05DB\u05DF \u05DE\u05E1\u05D5\u05D2 {0}.
3002=\u05D0\u05D9\u05E0\u05D3\u05E7\u05E1 \u05D7\u05D9\u05E4\u05D5\u05E9 JSON \u05D0\u05D9\u05E0\u05D5 \u05DE\u05DE\u05D5\u05DE\u05E9 \u05DC\u05D0\u05D5\u05E1\u05E4\u05D9\u05DD \u05E2\u05DD \u05DE\u05E4\u05EA\u05D7\u05D5\u05EA NVARCHAR2.
3003=Java Virtual Machine \u200F(JVM) \u05D0\u05D9\u05E0\u05D5 \u05EA\u05D5\u05DE\u05DA \u05DE\u05D0\u05DC\u05D2\u05D5\u05E8\u05D9\u05EA\u05DD \u05E0\u05D9\u05D4\u05D5\u05DC \u05D4\u05D2\u05E8\u05E1\u05D0\u05D5\u05EA MD5. \u05E9\u05E0\u05D4 \u05DC\u05D0\u05DC\u05D2\u05D5\u05E8\u05D9\u05EA\u05DD \u05E0\u05D9\u05D4\u05D5\u05DC \u05D2\u05E8\u05E1\u05D0\u05D5\u05EA \u05D0\u05D7\u05E8.
3004=Java Virtual Machine \u200F(JVM) \u05D0\u05D9\u05E0\u05D5 \u05EA\u05D5\u05DE\u05DA \u05DE\u05D0\u05DC\u05D2\u05D5\u05E8\u05D9\u05EA\u05DD \u05E0\u05D9\u05D4\u05D5\u05DC \u05D4\u05D2\u05E8\u05E1\u05D0\u05D5\u05EA SHA256. \u05E9\u05E0\u05D4 \u05DC\u05D0\u05DC\u05D2\u05D5\u05E8\u05D9\u05EA\u05DD \u05E0\u05D9\u05D4\u05D5\u05DC \u05D2\u05E8\u05E1\u05D0\u05D5\u05EA \u05D0\u05D7\u05E8.
3005=\u05D4\u05EA\u05DB\u05D5\u05E0\u05D4 \u05DC\u05D0 \u05DE\u05D5\u05DE\u05E9\u05D4.
3006=\u05DE\u05E4\u05EA\u05D5\u05D7 \u05DE\u05E8\u05D7\u05D1\u05D9 JSON \u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA \u05D1\u05D0\u05D5\u05E1\u05E4\u05D9 \u05E0\u05EA\u05D5\u05E0\u05D9\u05DD \u05D4\u05D8\u05E8\u05D5\u05D2\u05E0\u05D9\u05D9\u05DD.
3007=\u05DE\u05E4\u05EA\u05D5\u05D7 \u05D7\u05D9\u05E4\u05D5\u05E9 JSON \u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA \u05D1\u05D0\u05D5\u05E1\u05E4\u05D9 \u05E0\u05EA\u05D5\u05E0\u05D9\u05DD \u05D4\u05D8\u05E8\u05D5\u05D2\u05E0\u05D9\u05D9\u05DD.
3008=\u05DE\u05E4\u05EA\u05D5\u05D7 \u05E4\u05D5\u05E0\u05E7\u05E6\u05D9\u05D5\u05E0\u05DC\u05D9 JSON \u05D0\u05D9\u05E0\u05D5 \u05E0\u05EA\u05DE\u05DA \u05D1\u05D0\u05D5\u05E1\u05E4\u05D9 \u05E0\u05EA\u05D5\u05E0\u05D9\u05DD \u05D4\u05D8\u05E8\u05D5\u05D2\u05E0\u05D9\u05D9\u05DD.
3009=\u05E9\u05D0\u05D9\u05DC\u05EA\u05D0 \u05DC\u05E4\u05D9 \u05D3\u05D5\u05D2\u05DE\u05D4 (QBE) \u05D0\u05D9\u05E0\u05D4 \u05E0\u05EA\u05DE\u05DB\u05EA \u05D1\u05D0\u05D5\u05E1\u05E4\u05D9 \u05E0\u05EA\u05D5\u05E0\u05D9\u05DD \u05D4\u05D8\u05E8\u05D5\u05D2\u05E0\u05D9\u05D9\u05DD.
