#
# Copyright (c) 2014, 2015, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

1101=A cser\u00E9lni k\u00EDv\u00E1nt {0} dokumentum nem tal\u00E1lhat\u00F3 ebben: {1}.
1102=Nincs megval\u00F3s\u00EDtva.
1103=A(z) {0} gy\u0171jtem\u00E9ny \u00EDr\u00E1sv\u00E9dett, {1} nem megengedett.
1104=A m\u00F3dos\u00EDt\u00E1sok nem t\u00E1mogatottak csomag alap\u00FA gy\u0171jtem\u00E9nyen: {0}.
1105=A sz\u0171r\u0151k \u00E9s m\u00F3dos\u00EDt\u00E1sok nem t\u00E1mogatottak csomag alap\u00FA gy\u0171jtem\u00E9nyen: {0}.
1106=A sz\u0171r\u0151k \u00E9s lek\u00E9pez\u00E9sek nem t\u00E1mogatottak csomag alap\u00FA gy\u0171jtem\u00E9nyen: {0}.
1107=A sz\u0171r\u0151k nem t\u00E1mogatottak csomag alap\u00FA gy\u0171jtem\u00E9nyen: {0}.
1108=Indexek nem megengedettek csomag alap\u00FA gy\u0171jtem\u00E9nyen: {0}.
1109=A(z) {0} gy\u0171jtem\u00E9ny nem rendelkezhet bin\u00E1ris tartalommal {1} oszlopt\u00EDpusban.
1110=Az indexk\u00E9relem {0} oszlopn\u00E1l t\u00F6bbet tartalmaz.
1111=A(z) {0} gy\u0171jtem\u00E9ny nem rendelkezik az utols\u00F3 m\u00F3dos\u00EDt\u00E1st jelz\u0151 id\u0151b\u00E9lyeggel.
1112=A(z) {0} gy\u0171jtem\u00E9ny \u00FAgy van konfigur\u00E1lva, hogy nem dobhat\u00F3 el.
1113=\u00C9rv\u00E9nytelen sz\u0171r\u00E9si felt\u00E9tel.
1114=A(z) {0} gy\u0171jtem\u00E9ny {1} verzi\u00F3kezel\u00E9st haszn\u00E1l, folyamatos \u00E1tviteli \u00EDr\u00E1s nem megengedett.
1115=A le\u00EDr\u00F3 nem egyezik megl\u00E9v\u0151 gy\u0171jtem\u00E9nnyel.
1116=N\u00F6vekm\u00E9nyes friss\u00EDt\u00E9sek \u00E9s jav\u00EDt\u00E1sok a dokumentumokon nem t\u00E1mogatottak.
1117=A(z) {1} szerinti lek\u00E9rdez\u00E9s nincs megval\u00F3s\u00EDtva csomag alap\u00FA gy\u0171jtem\u00E9nyen: {0}.
1118=A gy\u0171jtem\u00E9ny nev\u00E9t meg kell adni.
1119=Ez a gy\u0171jtem\u00E9ny m\u00E1r l\u00E9tezik: {0}.
1120=A(z) {0} \u00E9rt\u00E9k nem \u00E9rv\u00E9nyes {1} t\u00EDpus\u00FA kulcs.
1121=Nem siker\u00FClt dokumentumot besz\u00FArni a gy\u0171jtem\u00E9nybe: {0}.
1122=A csonkol\u00E1s nem t\u00E1mogatott, a(z) {0} gy\u0171jtem\u00E9ny nem t\u00E1bl\u00E1n alapul\u00F3.
1123=A Java virtu\u00E1lis sz\u00E1m\u00EDt\u00F3g\u00E9p (JVM) nem teszi t\u00E1mogatja az MD5 verzi\u00F3kezel\u00E9si algoritmust. V\u00E1ltson m\u00E1sik verzi\u00F3kezel\u00E9si algoritmusra.
1124=A Java virtu\u00E1lis sz\u00E1m\u00EDt\u00F3g\u00E9p (JVM) nem teszi t\u00E1mogatja az SHA256 verzi\u00F3kezel\u00E9si algoritmust. V\u00E1ltson m\u00E1sik verzi\u00F3kezel\u00E9si algoritmusra.

