#
# Copyright (c) 2014, 2015, Oracle and/or its affiliates. All rights reserved.
#

# Messages used in SODA API exceptions

1101=Le document {0} qui doit \u00EAtre remplac\u00E9 est introuvable dans {1}.
1102=Non impl\u00E9ment\u00E9.
1103=La collecte {0} est en lecture seule, {1} non autoris\u00E9.
1104=Mises \u00E0 jour non prises en charge sur la collecte bas\u00E9e sur un package {0}.
1105=Filtres et mises \u00E0 jour non pris en charge sur la collecte bas\u00E9e sur un package {0}.
1106=Filtres et projections non pris en charge sur la collecte bas\u00E9e sur un package {0}.
1107=Filtres non pris en charge sur la collecte bas\u00E9e sur un package {0}.
1108=Index non autoris\u00E9s sur la collecte bas\u00E9e sur un package {0}.
1109=La collecte {0} ne peut poss\u00E9der un contenu binaire dans le type de colonne {1}.
1110=La demande d''index contient plus de {0} colonnes.
1111=La collecte {0} ne comporte aucun horodatage indiquant la derni\u00E8re modification.
1112=La collecte {0} est configur\u00E9e de fa\u00E7on \u00E0 ne pas pouvoir \u00EAtre supprim\u00E9e.
1113=Condition de filtre non valide.
1114=La collecte {0} utilise la gestion des versions {1}, \u00E9critures de transmission en continu non autoris\u00E9es.
1115=Le descripteur ne correspond pas \u00E0 la collecte existante.
1116=Les mises \u00E0 jour incr\u00E9mentielles ou les patches sur les documents ne sont pas pris en charge.
1117=Requ\u00EAte par {1} non impl\u00E9ment\u00E9e sur la collecte bas\u00E9e sur un package {0}
1118=Le nom de la collecte doit \u00EAtre sp\u00E9cifi\u00E9.
1119=La collecte {0} existe d\u00E9j\u00E0.
1120=La valeur {0} n''est pas une cl\u00E9 valide de type {1}.
1121=Echec de l''insertion du document dans la collecte {0}.
1122=Troncature non prise en charge, la collecte {0} n''est pas bas\u00E9e sur une table.
1123=Java Virtual Machine (JVM) ne prend pas en charge l'algorithme de gestion des versions MD5. Utilisez un autre algorithme.
1124=Java Virtual Machine (JVM) ne prend pas en charge l'algorithme de gestion des versions SHA256. Utilisez un autre algorithme.

